[
    {
        "title": "Integrating AI and ML technologies across OT, ICS environments to enhance anomaly ...",
        "url": "https://industrialcyber.co/features/integrating-ai-and-ml-technologies-across-ot-ics-environments-to-enhance-anomaly-detection-and-operational-resilience/",
        "text_hash": "7810586252967ecf39c81191640870ba33318d231311503bfcf8e028c3c36ccb",
        "summary": "Industrial cybersecurity landscape adopts AI and ML technologies to enhance anomaly detection. Applying AI in OT environments presents unique challenges, as the data preconditions are different. Organizational teams are required to change their operational competencies with the infusion of AI/ML into cybersecurity. The reliance on AI also comes with risks; sub-degree adjustments could mean improving detection rates, but are also prone to introducing false negatives or false positives. The value here stretches beyond cybersecurity and well into operational resiliency, says Ofir Arkin, senior distinguished architect for cybersecurity platforms at NVIDIA.",
        "source": "industrialcyber.co",
        "keywords": [
            "cyber",
            "threats",
            "using",
            "enhance",
            "anomaly"
        ],
        "published_date": "2025-04-20",
        "published_time": "06:34:05",
        "rss_source": "United States"
    },
    {
        "title": "By Land, Sea and Air, U.S. Military Faces Cyber Threats to Mobility - The Cipher Brief",
        "url": "https://www.thecipherbrief.com/column_article/by-land-sea-and-air-u-s-military-faces-cyber-threats-to-mobility",
        "text_hash": "6ad467967a70edaa1d3d44e713a71f05455b8a9e979e6787f612bbc1de6c4e6b",
        "summary": "Annie Fixler, Mark Montgomery: U.S. military faces cyber threats to mobility. They say China would use cyber attacks to disrupt deployment of forces. Fixler and Montgomery: The cybersecurity of the critical air, rail, and maritime infrastructure is insufficient. The nation can no longer afford to waste time debating the issue, they say. The Cipher Brief is a project of the Foundation for Defense of Democracies (FDD) and the Center on Cyber and Technology Innovation (CCTI)",
        "source": "www.thecipherbrief.com",
        "keywords": [
            "annie",
            "fixler",
            "director",
            "center",
            "cyber"
        ],
        "published_date": "2025-04-20",
        "published_time": "06:15:49",
        "rss_source": "United States"
    },
    {
        "title": "US Embassy misinterpreted Cyber law, says govt – Zambia - News Diggers!",
        "url": "https://diggers.news/local/2025/04/20/us-embassy-misinterpreted-cyber-law-says-govt/",
        "text_hash": "1e5f76878bf5240a5ce100f8172db378bae11bf1645a4d692e55994f95160171",
        "summary": "US Embassy misinterpreted Cyber law, says govt – Zambia - News Diggers!. The Ministry of Foreign Affairs and International Cooperation has clarified that the Cyber Security Act does not mandate anyone to proactively intercept any electronic communications and transmit such communication to government. On Thursday, the US Embassy in Zambia issued an advisory, cautioning American citizens in or planning to visit Zambia about the new Cyber Security law that “requires the interception and surveillance of all electronic communications in the country”",
        "source": "diggers.news",
        "keywords": [
            "ministry",
            "foreign",
            "affairs",
            "international",
            "cooperation"
        ],
        "published_date": "2025-04-20",
        "published_time": "04:45:56",
        "rss_source": "United States"
    },
    {
        "title": "It's not too late for HH to repeal the bad Cyber laws – Mundubile – Zambia - News Diggers!",
        "url": "https://diggers.news/local/2025/04/20/its-not-too-late-for-hh-to-repeal-the-bad-cyber-laws-mundubile/",
        "text_hash": "0411a5856964d4996a380141c2bbc0f7b69ccf81a44e41785a107cfbb30f609a",
        "summary": "Mundubile says the fundamental rights of citizens will be violated by the new Cyber laws. He says it is not too late for President Hakainde Hichilema to repeal and replace the Cyber Security and Cyber Crimes Acts. Mundubile wondered what had changed since President Hichilesma had promised to repeal the Act while in opposition. The UPND leadership rose against the introduction of these bills. The... you must be a paid ePaper subscriber to read this article. Already a member? Log in here.",
        "source": "diggers.news",
        "keywords": [
            "cyber",
            "security",
            "crimes",
            "addressing",
            "media"
        ],
        "published_date": "2025-04-20",
        "published_time": "04:45:54",
        "rss_source": "United States"
    },
    {
        "title": "Cyber Alliance Seminar: Dan Roche, Professor, Computer Science, U.S. Naval Academy, Annapolis",
        "url": "https://www.bu.edu/hic/2025/04/19/cyber-alliance-seminar/",
        "text_hash": "8fd190707a2ae074dcc8beb3e5e7cdbe8ca15dd0310087c6e68f438b7db6f2ed",
        "summary": "Dan Roche is a professor in the Computer Science Department at the U.S. Naval Academy in Annapolis, Maryland. His research focuses on developing algorithms for exact mathematical computation and privacy-preserving cryptographic protocols. He is visiting the Faculty of Computing & Data Sciences while on sabbatical in the 2024-25 academic year. This is joint work with Chris Brown, Ellis Fenske, and Jeff Kosseff, for a forthcoming article that will appear in the Fordham Intellectual Property, Media & Entertainment Law Journal.",
        "source": "www.bu.edu",
        "keywords": [
            "cyber",
            "alliance",
            "seminar",
            "roche",
            "professor"
        ],
        "published_date": "2025-04-20",
        "published_time": "04:33:57",
        "rss_source": "United States"
    },
    {
        "title": "Digital arrest scam: Delhi cyber police arrest 3 after retired officer cheated of Rs 48.5 lakh",
        "url": "https://www.tribuneindia.com/news/delhi/digital-arrest-scam-delhi-cyber-police-arrest-3-after-retired-officer-cheated-of-rs-48-5-lakh/",
        "text_hash": "2acc398ae83a5691c85c52454959c73527a796b878dd526c1e39f55638daa53e",
        "summary": "Delhi cyber police arrest 3 after retired officer cheated of Rs 48.5 lakh. Accused used WhatsApp video calls to impersonate officials from TRAI, CBI, Mumbai Police, and even Supreme Court judges. For over 72 hours, the victim was kept under psychological surveillance, not allowed to contact anyone and manipulated into liquidating his Fixed Deposits, PPF, and other savings. The money was transferred to accounts falsely claimed to be under Supreme Court supervision. Both were found to be shell companies, created with forged documents solely for receiving and laundering cybercrime proceeds.",
        "source": "www.tribuneindia.com",
        "keywords": [
            "cyber",
            "crime",
            "south",
            "delhi",
            "police"
        ],
        "published_date": "2025-04-20",
        "published_time": "02:46:57",
        "rss_source": "United States"
    },
    {
        "title": "The camera I recommend to most new photographers is not a Nikon or Sony - ZDNET",
        "url": "https://www.zdnet.com/article/the-camera-i-recommend-to-most-new-photographers-is-not-a-nikon-or-sony/",
        "text_hash": "33ec24a916a5c4e37c91c4cc56bfd190cc158f3496134737b80a9b7de50f1244",
        "summary": "The Canon EOS R100 mirrorless camera is a great starter for aspiring photographers. It features a 24-megapixel sensor for great image quality and color. It can also capture 4K (UHD) video at 24 frames per second. Unfortunately, it doesn't have a flip-out preview screen. It's one of the lightest camera bodies on the market, but don't let its weight fool you into assuming it can't create quality images or video. The camera I recommend to most new photographers is not a Nikon or Sony - ZDNET.",
        "source": "www.zdnet.com",
        "keywords": [
            "deals",
            "cyber",
            "monday",
            "holiday"
        ],
        "published_date": "2025-04-19",
        "published_time": "23:32:26",
        "rss_source": "United States"
    },
    {
        "title": "VIDEO: Understanding Chinese Espionage Through 900 Cases | SpyCast",
        "url": "https://smallwarsjournal.com/2025/04/19/understanding-chinese-espionage-through-900-cases-spycast/",
        "text_hash": "1d045c1e228e724b94648c1e7ae84479600c7575774cdd9f352a86ae8a8bdd97",
        "summary": "This talk reveals how, under Xi Jinping, China’s intelligence operations have become more assertive. The United States and Taiwan are identified as primary intelligence targets, while Europe is a secondary focus for technology and economic espionage. The video points to a strategic shift towards targeting sub-federal entities, such as state governments, to amplify influence. It uses the Su Jan Fun case, involving radiation-hardened chips, to illustrate the critical need for understanding the technology being targeted. The Kevin Mallory case, where a former CIA and DIA officer was recruited via LinkedIn, serves as a cautionary tale about the vulnerabilities that foreign intelligence services can exploit.",
        "source": "smallwarsjournal.com",
        "keywords": [
            "cyber",
            "notes",
            "shift",
            "responsibilities",
            "outsourcing"
        ],
        "published_date": "2025-04-19",
        "published_time": "23:26:56",
        "rss_source": "United States"
    },
    {
        "title": "Mumbai Man Falls for Cyber Fraud, Loses Rs 10 Lakh in Re 1 Note Scam - Deccan Herald",
        "url": "https://www.deccanherald.com/india/maharashtra/mumbai-man-falls-for-reward-in-exchange-for-re-1-note-loses-rs-10-lakh-3501316",
        "text_hash": "6578bce137eb85567f7a66d17686c9b917720597b90a3d544627bd0daf438ae4",
        "summary": "Mumbai man falls for ‘reward’ in exchange for Re 1 note; loses Rs 10 lakh. The 45-year-old complainant, a resident of Mumbai’s Santacruz West, approached the West Region Cyber Police Station.",
        "source": "www.deccanherald.com",
        "keywords": [
            "mumbai",
            "after",
            "falling",
            "cyber",
            "promising"
        ],
        "published_date": "2025-04-19",
        "published_time": "22:57:59",
        "rss_source": "United States"
    },
    {
        "title": "Former NSA agent becomes venture capital partner in Israel - The Jerusalem Post",
        "url": "https://www.jpost.com/business-and-innovation/article-850494",
        "text_hash": "41f52616b2d8f3745de3bf99e2e38f8f0f450c9bb77a687dd4e5952ee41d661f",
        "summary": "Adm. (ret.) Michael S. Rogers served in the US security establishment for 37 years. He was head of the National Security Agency (NSA) and commander of the US Army Cyber Command. “It’s truly extraordinary how this country functions even in such situations,” he said in an interview with Globes during a recent trip to Israel. Rogers believes that October 7 was not only an Israeli tragedy, but also a global lesson about the limitations of intelligence networks and the importance of professional humility.",
        "source": "www.jpost.com",
        "keywords": [
            "cyber",
            "command",
            "speaks",
            "onstage",
            "during"
        ],
        "published_date": "2025-04-19",
        "published_time": "22:53:06",
        "rss_source": "United States"
    },
    {
        "title": "(Invisible) Angles Of The Cyber World – OpEd - Eurasia Review",
        "url": "https://www.eurasiareview.com/20042025-invisible-angles-of-the-cyber-world-oped/",
        "text_hash": "a1faf5dd449e660791e96f19ee1a34692954104d921805c8703a35e316c95754",
        "summary": "Laila Mickelwait is a leading expert in the field of anti-trafficking. She is an activist and the founder of the Justice Defense Fund and the global #Traffickinghub movement. Her father was a general and vascular surgeon and passed away in 2014 after suffering a heart attack. After her father’s death, she visited his grave and vowed to bring justice to abuse victims. She has presented at many events, conferences, and universities and has advocated for legislative reform at the United Nations and to lawmakers in numerous countries.",
        "source": "www.eurasiareview.com",
        "keywords": [
            "negligence",
            "technological",
            "practices",
            "driving",
            "forces"
        ],
        "published_date": "2025-04-19",
        "published_time": "22:36:36",
        "rss_source": "United States"
    },
    {
        "title": "Security startup SplxAI raised $7 million to preemptively police AI. Here's its pitch deck.",
        "url": "https://www.businessinsider.com/splx-ai-pitch-deck-security-startup-2025-4",
        "text_hash": "e209ce7cca07dcb3724be2f65e978cf8067b714514a6879aee15fc1eea1c4db4",
        "summary": "Security startup SplxAI raised $7 million to preemptively police AI. It tests for AI security vulnerabilities and edits system prompts to be safer. The company recently raised a seed round led by Launchhub Ventures, with participation from venture firms Rain Capital, Runtime Ventures, Inovo, DNV Ventures, and South Central Ventures. It can run over 2,000 attacks and 17 scans in less than an hour, including prompt injection attacks, in which AI systems are fed malicious prompts to check for profanity.",
        "source": "www.businessinsider.com",
        "keywords": [
            "company",
            "tests",
            "security",
            "vulnerabilities",
            "edits"
        ],
        "published_date": "2025-04-19",
        "published_time": "22:35:18",
        "rss_source": "United States"
    },
    {
        "title": "D7 Secures $9.5M Air Force Deal to Boost Cyber Defenses for Qatar's F-15QA Fleet",
        "url": "https://news.clearancejobs.com/2025/04/19/d7-secures-9-5m-air-force-deal-to-boost-cyber-defenses-for-qatars-f-15qa-fleet/",
        "text_hash": "0935ac1c3b50e5636440f027b4bc80984d318029706f8bc8136bb9db04323060",
        "summary": "US Foods Inc., La Mirada, California, has been awarded a maximum $173,565,952 for full-line food and beverage items. General Dynamics NASSCO – Norfolk, Norfolk, Virginia, is awarded a $127,247,319 firm-fixed-price contract for maintenance, modernization and repair of USS Oak Hill. L3 Technologies Inc., Camden, New Jersey, is given a $28,850,598 contract to procure spares and USG-2B System installations.",
        "source": "news.clearancejobs.com",
        "keywords": [
            "received",
            "million",
            "contract",
            "modification",
            "extend"
        ],
        "published_date": "2025-04-19",
        "published_time": "21:57:12",
        "rss_source": "United States"
    },
    {
        "title": "Q1 2025 Global Cyber Attack Report from Check Point Software: Africa most targeted region in an",
        "url": "http://businessghana.com/site/news/technology/326577/Q1-2025-Global-Cyber-Attack-Report-from-Check-Point-Software:-Africa-most-targeted-region-in-an-...",
        "text_hash": "1daf54535688302b5b55537f6a223fb2edc126be8d43b76b30adbf8b7684bac9",
        "summary": "Q1 2025 Global Cyber Attack Report from Check Point Software: Africa most targeted region in an almost 50% surge in cyber threats worldwide. In Q1 2025, cyber attacks per organisation increased by 47%, reaching an average of 1,925 weekly attacks. Education saw the highest number of attacks, with 4,484 weekly, followed by government and telecommunications with 2,678 and 2,664 attacks. Ransomware attacks rose by 126%, with North America accounting for 62% of global incidents, and consumer goods & services being the most targeted sector.",
        "source": "businessghana.com",
        "keywords": [
            "cyber",
            "attacks",
            "threats",
            "worldwide",
            "attack"
        ],
        "published_date": "2025-04-19",
        "published_time": "20:08:42",
        "rss_source": "United States"
    },
    {
        "title": "Dialysis provider DaVita, with 16 Long Island centers, probing ransomware attack - Newsday",
        "url": "https://www.newsday.com/business/davita-dialysis-cyberattack-w08h1tjp",
        "text_hash": "f743612a01491add4c27f435a3eb1abe477a8697d17cd0a095c3a684087fbcf5",
        "summary": "DaVita, with 16 Long Island centers, probing ransomware attack - Newsday. DaVita has more than 2,600 outpatient dialysis centers in 46 states and Washington, D.C. New York State health officials said Wednesday they were aware of the cyber intrusion. Ransomware is a type of software criminals use to encrypt an organization’s access to their own data, a cybersecurity expert said.. In recent years, Long Island businesses, health care providers, and government institutions have fallen victim to cyberattacks.",
        "source": "www.newsday.com",
        "keywords": [
            "davita",
            "which",
            "locations",
            "across",
            "island"
        ],
        "published_date": "2025-04-19",
        "published_time": "18:43:46",
        "rss_source": "United States"
    },
    {
        "title": "Xavier Gracia | Spain Cyber Leader - Deloitte",
        "url": "https://www.deloitte.com/bd/en/about/people/profiles.xavier-gracia+3f0fb465.html",
        "text_hash": "3f160037c40378651af08755fee7b80dd2d9b869cb2d5cb9b129e39b2d84912f",
        "summary": "Xavi Gracia is the leader of the cybersecurity practice at Deloitte Spain. His role is to accompany clients in their transformation process, helping them to solve their most complex cybersecurity challenges. He leads a team of more than 1,500 professionals, promoting talent development, as well as the evolution and innovation of services and capabilities. Xavi is a telecommunications engineer (UPC), a master's degree holder in information technology management (Salle URL) and a graduate of the IESE Business School.",
        "source": "www.deloitte.com",
        "keywords": [
            "spain",
            "leader",
            "cyber",
            "gracia",
            "cybersecurity"
        ],
        "published_date": "2025-04-19",
        "published_time": "17:01:37",
        "rss_source": "United States"
    },
    {
        "title": "Data theft, identity theft & etc;: Only few are insured - teltarif.de News",
        "url": "https://www.teltarif.de/en/cyberversicherung-bitkom-umfrage/news/98404.html",
        "text_hash": "266d8d22bc45590a9e6f1060d6b802bdc8c6ba3bd4251e3faaa61d2b37c11926",
        "summary": "76 percent of Internet users in Germany aged 16 and over surveyed do not have cyberinsurance coverage. 14 percent do not know if existing insurance policies might cover risks. At least one person in Germany currently has cyberins insurance, Bitkom says. Cyber insurance not only insures against financial damage, but can also provide extra support such as technical and legal advice or data recovery measures. For example, asset damage can be covered up to a certain limit, but there are also risks such as online fraud caused by fake shops and identity fraud.",
        "source": "www.teltarif.de",
        "keywords": [
            "cyber",
            "insurance",
            "coverage",
            "varies",
            "prozent"
        ],
        "published_date": "2025-04-19",
        "published_time": "21:17:16",
        "rss_source": "Germany"
    },
    {
        "title": "Litschau Implements Innovative Strategies for Cybersecurity and Insurance",
        "url": "https://thegermanyeye.com/litschau-enhances-cybersecurity-insurance-strategies-18478",
        "text_hash": "d66c85ba9bd5bac68a544ec207725f8454857364475ef49f283b29a459893743",
        "summary": "Litschau Implements Innovative Strategies for Cybersecurity and Insurance. Litschau is exploring innovative insurance solutions to further protect its assets and mitigate risks. The local government is committed to fostering a culture of awareness and preparedness among its staff and residents. Workshops and training programs will be introduced to educate the community about the importance of cybersecurity and the steps individuals can take to protect themselves online. The newly established cybersecurity strategy will focus on several key areas, including the development of robust security protocols and employee training.",
        "source": "thegermanyeye.com",
        "keywords": [
            "cyber",
            "threats",
            "continue",
            "evolve",
            "essential"
        ],
        "published_date": "2025-04-19",
        "published_time": "09:08:42",
        "rss_source": "Germany"
    },
    {
        "title": "Security: 40.000 times more machine identities",
        "url": "https://b2b-cyber-security.de/en/security-40-times-more-machine-identities/",
        "text_hash": "704bbc3a46491303136099eff94546ac51a79b8ce5517c45f6c23039cd5e2970",
        "summary": "Report shows that with 40.000 times more machine identities than human ones, this poses a challenge for corporate security. 92 percent of companies already operate without risky human users. The use of AI and machine learning workloads increased by 500 percent last year. Despite this rapid growth, the public attack surface decreased by 38 percent, indicating increased security for AI applications. The data you enter for the purpose of subscribing to the newsletter will be stored on the CleverReach servers in Germany or Ireland. It is analyzed how many recipients have opened the newsletter message and how often which link in the newsletter was clicked.",
        "source": "b2b-cyber-security.de",
        "keywords": [
            "subscribe",
            "newsletter",
            "cyber",
            "security",
            "month"
        ],
        "published_date": "2025-04-19",
        "published_time": "06:45:05",
        "rss_source": "Germany"
    },
    {
        "title": "140 percent plus: Remote ransomware is increasing rapidly - B2B Cyber Security",
        "url": "https://b2b-cyber-security.de/en/140-percent-plus-remote-ransomware-is-increasing-rapidly/",
        "text_hash": "007f549c3d4e908cc7b5523f1e8797f8776c32f5483587531f21403786ba4787",
        "summary": "CleverReach is a service that can be used to organize and analyze the sending of newsletters. The data you enter for the purpose of subscribing to the newsletter (e.g. email address) will be stored on the CleverReach servers in Germany or Ireland. If you do not want an analysis by Clever reach, you must unsubscribe from the newsletter. After you have unsubscribed, your data will be deleted as soon as possible. Recovery is not possible. Do the same if you want to use a different email address for your newsletter.",
        "source": "b2b-cyber-security.de",
        "keywords": [
            "percent",
            "increase",
            "remote",
            "ransomware",
            "research"
        ],
        "published_date": "2025-04-19",
        "published_time": "06:45:04",
        "rss_source": "Germany"
    },
    {
        "title": "NordPass wins at Global Tech Awards 2025 for excellence in Cyber Security Technology category",
        "url": "https://markets.businessinsider.com/news/stocks/nordpass-wins-at-global-tech-awards-2025-for-excellence-in-cyber-security-technology-category-1034598411",
        "text_hash": "60f1ed30dc0d48267be46d2540565af09dcdb531bfd41fba5fbf31961cbcfd4c",
        "summary": "NordPass wins at Global Tech Awards 2025 for excellence in Cyber Security Technology category. The award celebrates NordPass’ continuous efforts to deliver secure, adaptable, and easy-to-use digital security solutions for individuals and businesses alike. NordPass was created by the experts behind NordVPN — the advanced security and privacy app. All passwords are encrypted on the device, so only the user can access them. For more information: nordpass.com . For more. information: gabriele.gecaite@nordsec.com",
        "source": "markets.businessinsider.com",
        "keywords": [
            "award",
            "powerful",
            "validation",
            "doing",
            "cybersecurity"
        ],
        "published_date": "2025-04-19",
        "published_time": "06:36:56",
        "rss_source": "Germany"
    },
    {
        "title": "\"Canyon's version of the cyber truck.\" Brand's latest concept bike divides the internet",
        "url": "https://road.cc/content/tech-news/canyons-version-cyber-truck-313605",
        "text_hash": "3cce39b555229ff2460a27afc42777d238a97cb9885af4c89c0a9a9525ed4413",
        "summary": "German bike brand Canyon has released images of a concept e-bike. The company claims it would make \"riding more fun and more sustainable\" It's not the first concept bike Canyon has designed. Back in 2016 the brand released images. of a hydrogen powered e- bike, and in 2020, delved into the world of four-wheeled. concepts with an e-vehicle. But let's take a look at what we don't know, and what the internet really thinks.",
        "source": "road.cc",
        "keywords": [
            "canyon",
            "concept",
            "version",
            "cyber",
            "truck"
        ],
        "published_date": "2025-04-20",
        "published_time": "08:07:23",
        "rss_source": "England"
    },
    {
        "title": "From Cyber Commander to civilian defences: Major-General Jonathan Shaw on leading the ...",
        "url": "https://www.londondaily.news/from-cyber-commander-to-civilian-defences-major-general-jonathan-shaw-on-leading-the-fight-against-digital-threats/",
        "text_hash": "bcf21eecdf6ff6917a138aad6816f30ef60d2a8c9db8dacecd1a8a5ec0465624",
        "summary": "Major-General Jonathan Shaw is one of the UK's foremost experts on defence, strategy, and digital resilience. He served as the British Army’s first Head of Cyber Security. In this exclusive interview, we explore his views on today's most pressing cybersecurity challenges, how governments and organisations can stay ahead of digital threats. We need to move from a traditional top-down, command-and-control model to one that empowers those at the coalface, he says. The old hierarchical systems are simply too slow to react effectively, he adds.",
        "source": "www.londondaily.news",
        "keywords": [
            "security",
            "having",
            "served",
            "british",
            "first"
        ],
        "published_date": "2025-04-20",
        "published_time": "07:07:33",
        "rss_source": "England"
    },
    {
        "title": "\"Brussels, my love?\" Young & anxious - Europe's silent crisis - Yahoo News UK",
        "url": "https://uk.news.yahoo.com/brussels-love-young-anxious-europes-050140725.html",
        "text_hash": "5a14ee5f29f59fb114d00a1070e21a3c4498fcc72a9f3d7f02dfd9c424fcd8a0",
        "summary": "EU Commissioner Glenn Micallef says more needs to be done to improve the lives of all in the EU. He also stressed the importance of the Erasmus+ student exchange programme. The EU is a 'fantastic reality that millions of Europeans live every day', he said. Watch the full episode in the player above or listen to the full interview on the Yahoo News UK YouTube channel below:. \"Brussels, my love?\" Young & anxious - Europe's silent crisis - Yahoo news UK.",
        "source": "uk.news.yahoo.com",
        "keywords": [
            "cyber",
            "bullying",
            "mental",
            "health",
            "concerns"
        ],
        "published_date": "2025-04-19",
        "published_time": "12:05:09",
        "rss_source": "England"
    },
    {
        "title": "Cozy Bear's Wine Lure Drops WineLoader Malware on EU Diplomats - Hackread",
        "url": "https://hackread.com/cozy-bear-wine-lure-wineloader-malware-eu-diplomats/",
        "text_hash": "a53b4802a01d5bd8e5f9b60b8272e040f146122aecc03ffd10c24fc702d79b7a",
        "summary": "Midnight Blizzard (APT29/Cozy Bear) targets European embassies and Ministries of Foreign Affairs with sophisticated phishing emails disguised as wine tasting invitations. Researchers at Check Point Research (CPR), who have been tracking this activity, discovered that hackers are using a new malware called ‘Grape loader’ to gain entry. They then install an updated, sneakier version of a backdoor program called 'Wine loader' once inside. Researchers describe Grape loader as a relatively new tool used in the early stages of this attack to gather information.",
        "source": "hackread.com",
        "keywords": [
            "deeba",
            "veteran",
            "cybersecurity",
            "reporter",
            "decade"
        ],
        "published_date": "2025-04-20",
        "published_time": "00:14:14",
        "rss_source": "United States"
    },
    {
        "title": "Report casts light on China infiltration - Taipei Times",
        "url": "https://www.taipeitimes.com/News/front/archives/2025/04/20/2003835480",
        "text_hash": "fffba31ea6c603783ac7905f48ef65fea38b08a0ace8dcf52528c27289c69def",
        "summary": "Taiwanese organized crime, illegal money lenders, temples and civic groups are complicit in Beijing’s infiltration of the armed forces, the Ministry of National Defense said. Report casts light on China infiltration - Taipei Times. 87.5 percent of apprehended Chinese agents were reported by service members they tried to lure into becoming spies, the report said. Taiwan was subjected to 82 cyberattacks last month, a slight decrease from the number of attacks in the same month last year, the ministry said.",
        "source": "www.taipeitimes.com",
        "keywords": [
            "month",
            "cyberattacks",
            "slight",
            "decrease",
            "number"
        ],
        "published_date": "2025-04-19",
        "published_time": "21:43:20",
        "rss_source": "United States"
    },
    {
        "title": "Hackers Actively Exploiting Critical Exchange & SharePoint Server Vulnerabilities",
        "url": "https://cybersecuritynews.com/exchange-sharepoint-server-vulnerabilities/",
        "text_hash": "2a5e42e7681caf42ea33fb846fb9dff3928d2f2f34eee2c0c8390a16bb9144c9",
        "summary": "Threat actors have consistently exploited critical vulnerabilities in Exchange Server and SharePoint Server. Such attacks have been observed to lead to remote code execution, lateral movement, and exfiltration of sensitive data. Microsoft strongly urges organizations running on-premises Exchange or SharePoint servers to:Apply the latest security patches and updates without delay.Enable AMSI integration and ensure compatible antimalware solutions are active.Audit and harden NTLM authentication configurations, enabling Extended Protection for Authentication (EPA) where possible.",
        "source": "cybersecuritynews.com",
        "keywords": [
            "cyber",
            "security",
            "dedicated",
            "platform",
            "attack"
        ],
        "published_date": "2025-04-19",
        "published_time": "19:47:52",
        "rss_source": "United States"
    },
    {
        "title": "IRS axes flexible work schedules, rejects many 'deferred resignation' applications",
        "url": "https://federalnewsnetwork.com/workforce/2025/04/irs-axes-flexible-work-schedules-rejects-many-deferred-resignation-applications/",
        "text_hash": "c42deb7d54cea010ffbbb8f6d2cf92b172ba1fc4d56014980aeaeaacff822005",
        "summary": "The IRS gave employees another chance to accept a “deferred resignation” offer and leave the federal workforce later this year. Thousands of IRS employees applied for the deferred resignation offer, which would allow them to go on paid administrative leave and separate from the agency by the end of the fiscal year. The IRS denied deferred resignation to 2,100 employees — about 10% of the 20,000 employees who applied to take the offer. Among those denied were probationary employees, mostly fired in mid-February.",
        "source": "federalnewsnetwork.com",
        "keywords": [
            "federal",
            "there",
            "network",
            "technology",
            "image"
        ],
        "published_date": "2025-04-19",
        "published_time": "19:39:18",
        "rss_source": "United States"
    },
    {
        "title": "Head of UAE's Cybersecurity emphasises importance of international partnerships in ... - The Tribune",
        "url": "https://www.tribuneindia.com/news/world/head-of-uaes-cybersecurity-emphasises-importance-of-international-partnerships-in-strengthening-digital-security/",
        "text_hash": "18e16aad58678a654bf4505319837bacc3d70d751bd8856814c438bf5f3e6dc3",
        "summary": "UAE-US Business Council hosted a luncheon with Dr Mohammed Al-Kuwaiti, Chairman of the UAE Cybersecurity Council. He provided a preliminary overview of the cybersecurity landscape in light of the increasing technological transformations and challenges. He also discussed the ongoing preparations for the upcoming GISEC Global conference, scheduled to take place from May 6 to 9 in Dubai. The discussions included several prominent figures, including Khush Choksy, Senior Vice President of International Member Relations at the US Chamber of Commerce.",
        "source": "www.tribuneindia.com",
        "keywords": [
            "visit",
            "mohammed",
            "washington",
            "comes",
            "cybersecurity"
        ],
        "published_date": "2025-04-19",
        "published_time": "17:24:19",
        "rss_source": "United States"
    },
    {
        "title": "Security News This Week: Florida Man Enters the Encryption Wars - WIRED",
        "url": "https://www.wired.com/story/florida-man-enters-the-encryption-wars/",
        "text_hash": "5f0049802507f292be0056c76259b47a1eaecebdd8fc5eede608e56841aed497",
        "summary": "Immigrations and Customs Enforcement has a $30 million contract with Palantir to build a “near-real time” surveillance platform. The Department of Homeland Security has been sending aggressive emails telling people with temporary legal status to leave the US. A draft bill in the state of Florida would require social media companies to provide law enforcement with encryption backdoors so cops could access users’ accounts. WIRED took a look at the most dangerous hackers you've never heard of, diving deep on the unrelenting and two-faced Russian intelligence group Gamaredon.",
        "source": "www.wired.com",
        "keywords": [
            "judge",
            "rules",
            "against",
            "police",
            "phone"
        ],
        "published_date": "2025-04-19",
        "published_time": "17:03:06",
        "rss_source": "United States"
    },
    {
        "title": "Hacking US crosswalks to talk like Zuck is as easy as 1234 - The Register",
        "url": "https://www.theregister.com/2025/04/19/us_crosswalk_button_hacking/",
        "text_hash": "8b5ab34168d155e0812bb6c0864eb4d92b3281d21c495848e6a9e6f6f1fe8996",
        "summary": "Hackers hijack US crosswalks to talk like Zuck is as easy as 1234 - The Register. In Seattle this week, some crosswalk buttons started playing AI-generated messages spoofing tech tycoon Jeff Bezos. Similar hacks were spotted, or rather heard, in Silicon Valley. The city government isn't thrilled either: Fixing the tampered buttons is eating up staff time that could be spent elsewhere. It's not known who's behind the pranks, but whoever it is will likely keep at it.",
        "source": "www.theregister.com",
        "keywords": [
            "working",
            "vendor",
            "explore",
            "stronger",
            "security"
        ],
        "published_date": "2025-04-19",
        "published_time": "16:44:48",
        "rss_source": "United States"
    },
    {
        "title": "Army expands access to encrypted Wickr platform in aim to curb insecure comms, bolster integration",
        "url": "https://breakingdefense.com/2025/04/army-expands-access-to-encrypted-wickr-platform-in-aim-to-curb-insecure-comms-bolster-integration/",
        "text_hash": "e85654ced6abd4fefbda38e481b35c0bfcf09cb32213b44ee9c946606ecfe503",
        "summary": "The Army has announced its Army Enterprise Wickr platform is expanding to a wider audience. Wickr was well known as a commercially available encryption service. The proliferation of Wickr in the Army’s ranks comes on the heels of “Signal-gate’ The Army is also looking to integrate Wickr with its Army Vantage program, its Army Intelligence Data Platform and Mission Support Services, the service said in a recent press release. The service said ECMA “continues to onboard new user requests on a rolling basis, contingent on mission priority.",
        "source": "breakingdefense.com",
        "keywords": [
            "security",
            "wickr",
            "operates",
            "department",
            "defense"
        ],
        "published_date": "2025-04-19",
        "published_time": "15:51:19",
        "rss_source": "United States"
    },
    {
        "title": "Dems fret over DOGE feeding sensitive data into random AI - The Register",
        "url": "https://www.theregister.com/2025/04/18/house_democrats_doge/",
        "text_hash": "a475fa83dadec6353b822a6972f6dc1c0e91f2b7b5369fd2e06f305ea1df5e29",
        "summary": "DOGE's use of AI runs afoul of several federal laws and the OMB's own AI directives. The Dems believe Musk is self-dealing by using his own Grok-2 AI model to ingest government data. \"Without proper protections, feeding sensitive data into an AI system puts it into the possession of a system's operator — a massive breach of public and employee trust and an increase in cybersecurity risks surrounding that data,\" the Dems said in a letter to the White House.",
        "source": "www.theregister.com",
        "keywords": [
            "narrower",
            "topics",
            "cybersecurity",
            "infrastructure",
            "security"
        ],
        "published_date": "2025-04-19",
        "published_time": "15:45:30",
        "rss_source": "United States"
    },
    {
        "title": "New payment-card scam involves a phone call, some malware and a personal tap",
        "url": "https://therecord.media/new-payment-card-scam-involves-malware-tap",
        "text_hash": "127f552576223a3b144d98377385a8317e2d08a51f97c318537d627c11131be0",
        "summary": "A new payment-card scam involves a phone call, some malware and a personal tap. Financial institutions should be on alert for a scam that combines social engineering, previously undocumented malware and mobile phones’ near-field communication (NFC) capabilities. The malware, which Cleafy is calling SuperCard X, overlaps with malicious code first reported by researchers at Slovakia-based ESET in 2024. U.S. authorities arrested two Chinese nationals earlier this year in a “tap to pay” scam.",
        "source": "therecord.media",
        "keywords": [
            "cybersecurity",
            "companies",
            "enforcement",
            "agencies",
            "warning"
        ],
        "published_date": "2025-04-19",
        "published_time": "13:40:18",
        "rss_source": "United States"
    },
    {
        "title": "Institute of Information Management (IIM) Australia Successfully Concludes 2025 Annual ...",
        "url": "https://www.finanznachrichten.de/nachrichten-2025-04/65159062-institute-of-information-management-iim-australia-successfully-concludes-2025-annual-conference-induction-investiture-in-brisbane-008.htm",
        "text_hash": "a59f0280a3aed92b18f246208c1068756da53ca2fa2401b42e4cffd033641232",
        "summary": "The Institute of Information Management (IIM) Australia is pleased to announce the successful conclusion of its 2025 Annual Conference, Induction, and Investiture Ceremony. With the theme \"Navigating Data Integrity and Compliance in the Australian Digital Landscape,\" the event brought together distinguished professionals, industry leaders, inductees, and guests from both the public and private sectors. The conference reaffirmed IIM Australia's unwavering commitment to promoting thought leadership, regulatory awareness, and excellence in data governance amid the ongoing digital transformation.",
        "source": "www.finanznachrichten.de",
        "keywords": [
            "light",
            "critical",
            "developments",
            "privacy",
            "other"
        ],
        "published_date": "2025-04-19",
        "published_time": "19:11:49",
        "rss_source": "Germany"
    },
    {
        "title": "Farewell Asda, hello Voyado: these are our most read retail technology articles from last week",
        "url": "https://retailtechinnovationhub.com/home/2025/4/20/farewell-asda-hello-voyado-these-are-our-most-read-retail-technology-articles-from-last-week",
        "text_hash": "b7ea6ef5ab303d7875b9b2ef087291a39e944babfd53cdaa18f99202c3dfb797",
        "summary": "Swedish retail tech firm Voyado hires former SAP Emarsys exec Thomas Harris as CRO. Rob Barnes departs Asda and CIO role after driving technology change across the business. Flagship, JD.com, Nedap, HEMA, HyperFinity, InPost, Yodel, SAP Emarys, and Unibail-Rodamco-Westfield all featured. Check out the articles on this here website that caught your fancy last week, including Flagship and Nedap.",
        "source": "retailtechinnovationhub.com",
        "keywords": [
            "security",
            "sleep",
            "happens",
            "cybersecurity",
            "threats"
        ],
        "published_date": "2025-04-20",
        "published_time": "05:09:50",
        "rss_source": "England"
    },
    {
        "title": "Microsoft explains TPM benefits and why it makes Windows 11 better than 10 - Neowin",
        "url": "https://www.neowin.net/news/microsoft-explains-tpm-benefits-and-why-it-makes-windows-11-better-than-10/",
        "text_hash": "e1f2c849269caba99415338f2139db5473c07b56b0e9acecbb57673d570421e7",
        "summary": "Microsoft explains TPM benefits and why it makes Windows 11 better than 10. As Windows 10's end-of-support date approaches, most people will be looking to make the jump, and Microsoft is also looking forward to that. The TPM 2.0 is one of the system requirements for Windows 11. Microsoft has explained why that is and how it helps make Windows 11 a better OS than Windows 10. It even suggests that those who are unable to upgrade due to ineligible hardware dump their PC and get a new one with Windows 11 instead.",
        "source": "www.neowin.net",
        "keywords": [
            "feature",
            "called",
            "secure",
            "helps",
            "malicious"
        ],
        "published_date": "2025-04-19",
        "published_time": "21:54:18",
        "rss_source": "England"
    },
    {
        "title": "'He and the likes of Cowan-Dickie are pushing for Lions honours' - Rugbypass.com",
        "url": "https://www.rugbypass.com/news/sale-boss-alex-sanderson-backs-tom-curry-to-make-lions-squad/",
        "text_hash": "1f022a6418643866891fc6b9ee52ebf775fb98b9a89f7dac7ad6dff316b1da72",
        "summary": "Sale Sharks beat Harlequins 43-29 at Twickenham Stoop. Alex Sanderson backs Tom Curry to get on a second Lions tour. England flanker produced the kind of carrying and try-scoring performance which England fans have enjoyed for many years. Sanderson: 'He and the likes of Cowan-Dickie are pushing for Lions honours and they richly deserve it if you’re just going on that game' Quins boss Danny Wilson refuses to give up on his team’s hopes.",
        "source": "www.rugbypass.com",
        "keywords": [
            "cyber",
            "security",
            "company",
            "instrumental",
            "recovering"
        ],
        "published_date": "2025-04-19",
        "published_time": "17:42:53",
        "rss_source": "England"
    },
    {
        "title": "Chip makes cybersecurity easier - Control Engineering Europe",
        "url": "https://www.controlengeurope.com/article/215091/Chip-makes-cybersecurity-easier.aspx",
        "text_hash": "36a65aa290a8d1bc1ad86760d5cd841669bc567473487e2fe4ccaf2aea9f29ec",
        "summary": "The Profinet IO TSP-1 device chip supports the Profibus User Organization’s Security Class 1 specification. The TPS-1 chip includes a number of different security features that can be summarised under the term ‘security-by-design’ The introduction of DCP Read-Only mode aims to ensures the availability of an existing device connection between the controller and the device. This way, critical services are not lost in the event of an attack. The chip was designed to provide device manufacturers with a fast, easy and cost-saving way to integrate the ProfinetIO device interface into their devices.",
        "source": "www.controlengeurope.com",
        "keywords": [
            "adoption",
            "cyber",
            "resilience",
            "european",
            "standard"
        ],
        "published_date": "2025-04-19",
        "published_time": "14:59:40",
        "rss_source": "England"
    },
    {
        "title": "Securing the future of industrial automation - Control Engineering Europe",
        "url": "https://www.controlengeurope.com/article/215089/Securing-the-future-of-industrial-automation.aspx",
        "text_hash": "71dee3ebe2c96840043a6ba42c0e258c08cc1365a57b9449837da4141f02f2dd",
        "summary": "In February 2024, five production plants at German battery manufacturer Varta came to a halt. A cyberattack had infiltrated its operational technology (OT) systems. Manufacturing operations that once relied on isolated, air-gapped systems are now highly networked. A single breach can cause catastrophic disruption, halting assembly lines, corrupting product quality or even compromising intellectual property. OryxAlign can provide advanced security solutions tailored for industrial automation. It offers a managed extended detection and response solution that offers real-time monitoring across IT and OT networks.",
        "source": "www.controlengeurope.com",
        "keywords": [
            "combat",
            "growing",
            "cyber",
            "threat",
            "manufacturers"
        ],
        "published_date": "2025-04-19",
        "published_time": "14:49:53",
        "rss_source": "England"
    },
    {
        "title": "Ransomware attacks are increasing sharply - B2B Cyber Security",
        "url": "https://b2b-cyber-security.de/en/ransomware-angriffe-steigen-stark-an/",
        "text_hash": "1ed4441797cf13bdfa3b25ca3ef1a577eef45860fe81be954e5db69aa537ea7a",
        "summary": "February 2025 was a record month, according to experts at Bitdefender Labs. Compared to February 2024, attacks in February 2025 increased by 126 percent. Germany is among the top five countries attacked. The Clop (CI0p) group was the most active in February and was responsible for 335 of 962 attacks. It exploited the vulnerabilities CVE-9,8-2024 and CVE-50623- 2024 in the file transfer software Cleo, each rated 55956.",
        "source": "b2b-cyber-security.de",
        "keywords": [
            "bitdefender",
            "february",
            "record",
            "month",
            "according"
        ],
        "published_date": "2025-04-20",
        "published_time": "07:26:37",
        "rss_source": "Germany"
    },
    {
        "title": "North Wales Police issue warning over fraudulent DVLA emails - Wrexham.com",
        "url": "https://wrexham.com/news/north-wales-police-issue-warning-over-dvla-fraud-268965.html",
        "text_hash": "2283d9a6063751accf06df22f24e3b5a9a429f6bcae7c0e71efd347d66130994",
        "summary": "North Wales Police issue warning over fraudulent DVLA emails. One email carries the subject line “Update Your Road Tax’ and falsely states that the recipient’s vehicle is “not legally allowed to be on the road’ North Wales Police said: “Scammers have been targeting motorists in recent weeks with attempts to gather personal and financial details from them via scam emails.”Officials say the most effective way to access DVLA services is by visiting the official government website at GOV.UK.",
        "source": "wrexham.com",
        "keywords": [
            "forwarding",
            "phishing",
            "emails",
            "national",
            "cyber"
        ],
        "published_date": "2025-04-20",
        "published_time": "10:33:20",
        "rss_source": "England"
    }
]