[
    {
        "title": "Integrating AI and ML technologies across OT, ICS environments to enhance anomaly ...",
        "url": "https://industrialcyber.co/features/integrating-ai-and-ml-technologies-across-ot-ics-environments-to-enhance-anomaly-detection-and-operational-resilience/",
        "text_hash": "7810586252967ecf39c81191640870ba33318d231311503bfcf8e028c3c36ccb",
        "summary": "Industrial cybersecurity landscape adopts AI and ML technologies to enhance anomaly detection. Applying AI in OT environments presents unique challenges, as the data preconditions are different. Organizational teams are required to change their operational competencies with the infusion of AI/ML into cybersecurity. The reliance on AI also comes with risks; sub-degree adjustments could mean improving detection rates, but are also prone to introducing false negatives or false positives. The value here stretches beyond cybersecurity and well into operational resiliency, says Ofir Arkin, senior distinguished architect for cybersecurity platforms at NVIDIA.",
        "source": "industrialcyber.co",
        "keywords": [
            "cyber",
            "threats",
            "using",
            "enhance",
            "anomaly"
        ],
        "published_date": "2025-04-20",
        "published_time": "06:34:05",
        "rss_source": "United States"
    },
    {
        "title": "By Land, Sea and Air, U.S. Military Faces Cyber Threats to Mobility - The Cipher Brief",
        "url": "https://www.thecipherbrief.com/column_article/by-land-sea-and-air-u-s-military-faces-cyber-threats-to-mobility",
        "text_hash": "6ad467967a70edaa1d3d44e713a71f05455b8a9e979e6787f612bbc1de6c4e6b",
        "summary": "Annie Fixler, Mark Montgomery: U.S. military faces cyber threats to mobility. They say China would use cyber attacks to disrupt deployment of forces. Fixler and Montgomery: The cybersecurity of the critical air, rail, and maritime infrastructure is insufficient. The nation can no longer afford to waste time debating the issue, they say. The Cipher Brief is a project of the Foundation for Defense of Democracies (FDD) and the Center on Cyber and Technology Innovation (CCTI)",
        "source": "www.thecipherbrief.com",
        "keywords": [
            "annie",
            "fixler",
            "director",
            "center",
            "cyber"
        ],
        "published_date": "2025-04-20",
        "published_time": "06:15:49",
        "rss_source": "United States"
    },
    {
        "title": "US Embassy misinterpreted Cyber law, says govt – Zambia - News Diggers!",
        "url": "https://diggers.news/local/2025/04/20/us-embassy-misinterpreted-cyber-law-says-govt/",
        "text_hash": "1e5f76878bf5240a5ce100f8172db378bae11bf1645a4d692e55994f95160171",
        "summary": "US Embassy misinterpreted Cyber law, says govt – Zambia - News Diggers!. The Ministry of Foreign Affairs and International Cooperation has clarified that the Cyber Security Act does not mandate anyone to proactively intercept any electronic communications and transmit such communication to government. On Thursday, the US Embassy in Zambia issued an advisory, cautioning American citizens in or planning to visit Zambia about the new Cyber Security law that “requires the interception and surveillance of all electronic communications in the country”",
        "source": "diggers.news",
        "keywords": [
            "ministry",
            "foreign",
            "affairs",
            "international",
            "cooperation"
        ],
        "published_date": "2025-04-20",
        "published_time": "04:45:56",
        "rss_source": "United States"
    },
    {
        "title": "It's not too late for HH to repeal the bad Cyber laws – Mundubile – Zambia - News Diggers!",
        "url": "https://diggers.news/local/2025/04/20/its-not-too-late-for-hh-to-repeal-the-bad-cyber-laws-mundubile/",
        "text_hash": "0411a5856964d4996a380141c2bbc0f7b69ccf81a44e41785a107cfbb30f609a",
        "summary": "Mundubile says the fundamental rights of citizens will be violated by the new Cyber laws. He says it is not too late for President Hakainde Hichilema to repeal and replace the Cyber Security and Cyber Crimes Acts. Mundubile wondered what had changed since President Hichilesma had promised to repeal the Act while in opposition. The UPND leadership rose against the introduction of these bills. The... you must be a paid ePaper subscriber to read this article. Already a member? Log in here.",
        "source": "diggers.news",
        "keywords": [
            "cyber",
            "security",
            "crimes",
            "addressing",
            "media"
        ],
        "published_date": "2025-04-20",
        "published_time": "04:45:54",
        "rss_source": "United States"
    },
    {
        "title": "Cyber Alliance Seminar: Dan Roche, Professor, Computer Science, U.S. Naval Academy, Annapolis",
        "url": "https://www.bu.edu/hic/2025/04/19/cyber-alliance-seminar/",
        "text_hash": "8fd190707a2ae074dcc8beb3e5e7cdbe8ca15dd0310087c6e68f438b7db6f2ed",
        "summary": "Dan Roche is a professor in the Computer Science Department at the U.S. Naval Academy in Annapolis, Maryland. His research focuses on developing algorithms for exact mathematical computation and privacy-preserving cryptographic protocols. He is visiting the Faculty of Computing & Data Sciences while on sabbatical in the 2024-25 academic year. This is joint work with Chris Brown, Ellis Fenske, and Jeff Kosseff, for a forthcoming article that will appear in the Fordham Intellectual Property, Media & Entertainment Law Journal.",
        "source": "www.bu.edu",
        "keywords": [
            "cyber",
            "alliance",
            "seminar",
            "roche",
            "professor"
        ],
        "published_date": "2025-04-20",
        "published_time": "04:33:57",
        "rss_source": "United States"
    },
    {
        "title": "Digital arrest scam: Delhi cyber police arrest 3 after retired officer cheated of Rs 48.5 lakh",
        "url": "https://www.tribuneindia.com/news/delhi/digital-arrest-scam-delhi-cyber-police-arrest-3-after-retired-officer-cheated-of-rs-48-5-lakh/",
        "text_hash": "2acc398ae83a5691c85c52454959c73527a796b878dd526c1e39f55638daa53e",
        "summary": "Delhi cyber police arrest 3 after retired officer cheated of Rs 48.5 lakh. Accused used WhatsApp video calls to impersonate officials from TRAI, CBI, Mumbai Police, and even Supreme Court judges. For over 72 hours, the victim was kept under psychological surveillance, not allowed to contact anyone and manipulated into liquidating his Fixed Deposits, PPF, and other savings. The money was transferred to accounts falsely claimed to be under Supreme Court supervision. Both were found to be shell companies, created with forged documents solely for receiving and laundering cybercrime proceeds.",
        "source": "www.tribuneindia.com",
        "keywords": [
            "cyber",
            "crime",
            "south",
            "delhi",
            "police"
        ],
        "published_date": "2025-04-20",
        "published_time": "02:46:57",
        "rss_source": "United States"
    },
    {
        "title": "The camera I recommend to most new photographers is not a Nikon or Sony - ZDNET",
        "url": "https://www.zdnet.com/article/the-camera-i-recommend-to-most-new-photographers-is-not-a-nikon-or-sony/",
        "text_hash": "33ec24a916a5c4e37c91c4cc56bfd190cc158f3496134737b80a9b7de50f1244",
        "summary": "The Canon EOS R100 mirrorless camera is a great starter for aspiring photographers. It features a 24-megapixel sensor for great image quality and color. It can also capture 4K (UHD) video at 24 frames per second. Unfortunately, it doesn't have a flip-out preview screen. It's one of the lightest camera bodies on the market, but don't let its weight fool you into assuming it can't create quality images or video. The camera I recommend to most new photographers is not a Nikon or Sony - ZDNET.",
        "source": "www.zdnet.com",
        "keywords": [
            "deals",
            "cyber",
            "monday",
            "holiday"
        ],
        "published_date": "2025-04-19",
        "published_time": "23:32:26",
        "rss_source": "United States"
    },
    {
        "title": "VIDEO: Understanding Chinese Espionage Through 900 Cases | SpyCast",
        "url": "https://smallwarsjournal.com/2025/04/19/understanding-chinese-espionage-through-900-cases-spycast/",
        "text_hash": "1d045c1e228e724b94648c1e7ae84479600c7575774cdd9f352a86ae8a8bdd97",
        "summary": "This talk reveals how, under Xi Jinping, China’s intelligence operations have become more assertive. The United States and Taiwan are identified as primary intelligence targets, while Europe is a secondary focus for technology and economic espionage. The video points to a strategic shift towards targeting sub-federal entities, such as state governments, to amplify influence. It uses the Su Jan Fun case, involving radiation-hardened chips, to illustrate the critical need for understanding the technology being targeted. The Kevin Mallory case, where a former CIA and DIA officer was recruited via LinkedIn, serves as a cautionary tale about the vulnerabilities that foreign intelligence services can exploit.",
        "source": "smallwarsjournal.com",
        "keywords": [
            "cyber",
            "notes",
            "shift",
            "responsibilities",
            "outsourcing"
        ],
        "published_date": "2025-04-19",
        "published_time": "23:26:56",
        "rss_source": "United States"
    },
    {
        "title": "Mumbai Man Falls for Cyber Fraud, Loses Rs 10 Lakh in Re 1 Note Scam - Deccan Herald",
        "url": "https://www.deccanherald.com/india/maharashtra/mumbai-man-falls-for-reward-in-exchange-for-re-1-note-loses-rs-10-lakh-3501316",
        "text_hash": "6578bce137eb85567f7a66d17686c9b917720597b90a3d544627bd0daf438ae4",
        "summary": "Mumbai man falls for ‘reward’ in exchange for Re 1 note; loses Rs 10 lakh. The 45-year-old complainant, a resident of Mumbai’s Santacruz West, approached the West Region Cyber Police Station.",
        "source": "www.deccanherald.com",
        "keywords": [
            "mumbai",
            "after",
            "falling",
            "cyber",
            "promising"
        ],
        "published_date": "2025-04-19",
        "published_time": "22:57:59",
        "rss_source": "United States"
    },
    {
        "title": "Former NSA agent becomes venture capital partner in Israel - The Jerusalem Post",
        "url": "https://www.jpost.com/business-and-innovation/article-850494",
        "text_hash": "41f52616b2d8f3745de3bf99e2e38f8f0f450c9bb77a687dd4e5952ee41d661f",
        "summary": "Adm. (ret.) Michael S. Rogers served in the US security establishment for 37 years. He was head of the National Security Agency (NSA) and commander of the US Army Cyber Command. “It’s truly extraordinary how this country functions even in such situations,” he said in an interview with Globes during a recent trip to Israel. Rogers believes that October 7 was not only an Israeli tragedy, but also a global lesson about the limitations of intelligence networks and the importance of professional humility.",
        "source": "www.jpost.com",
        "keywords": [
            "cyber",
            "command",
            "speaks",
            "onstage",
            "during"
        ],
        "published_date": "2025-04-19",
        "published_time": "22:53:06",
        "rss_source": "United States"
    },
    {
        "title": "(Invisible) Angles Of The Cyber World – OpEd - Eurasia Review",
        "url": "https://www.eurasiareview.com/20042025-invisible-angles-of-the-cyber-world-oped/",
        "text_hash": "a1faf5dd449e660791e96f19ee1a34692954104d921805c8703a35e316c95754",
        "summary": "Laila Mickelwait is a leading expert in the field of anti-trafficking. She is an activist and the founder of the Justice Defense Fund and the global #Traffickinghub movement. Her father was a general and vascular surgeon and passed away in 2014 after suffering a heart attack. After her father’s death, she visited his grave and vowed to bring justice to abuse victims. She has presented at many events, conferences, and universities and has advocated for legislative reform at the United Nations and to lawmakers in numerous countries.",
        "source": "www.eurasiareview.com",
        "keywords": [
            "negligence",
            "technological",
            "practices",
            "driving",
            "forces"
        ],
        "published_date": "2025-04-19",
        "published_time": "22:36:36",
        "rss_source": "United States"
    },
    {
        "title": "Security startup SplxAI raised $7 million to preemptively police AI. Here's its pitch deck.",
        "url": "https://www.businessinsider.com/splx-ai-pitch-deck-security-startup-2025-4",
        "text_hash": "e209ce7cca07dcb3724be2f65e978cf8067b714514a6879aee15fc1eea1c4db4",
        "summary": "Security startup SplxAI raised $7 million to preemptively police AI. It tests for AI security vulnerabilities and edits system prompts to be safer. The company recently raised a seed round led by Launchhub Ventures, with participation from venture firms Rain Capital, Runtime Ventures, Inovo, DNV Ventures, and South Central Ventures. It can run over 2,000 attacks and 17 scans in less than an hour, including prompt injection attacks, in which AI systems are fed malicious prompts to check for profanity.",
        "source": "www.businessinsider.com",
        "keywords": [
            "company",
            "tests",
            "security",
            "vulnerabilities",
            "edits"
        ],
        "published_date": "2025-04-19",
        "published_time": "22:35:18",
        "rss_source": "United States"
    },
    {
        "title": "D7 Secures $9.5M Air Force Deal to Boost Cyber Defenses for Qatar's F-15QA Fleet",
        "url": "https://news.clearancejobs.com/2025/04/19/d7-secures-9-5m-air-force-deal-to-boost-cyber-defenses-for-qatars-f-15qa-fleet/",
        "text_hash": "0935ac1c3b50e5636440f027b4bc80984d318029706f8bc8136bb9db04323060",
        "summary": "US Foods Inc., La Mirada, California, has been awarded a maximum $173,565,952 for full-line food and beverage items. General Dynamics NASSCO – Norfolk, Norfolk, Virginia, is awarded a $127,247,319 firm-fixed-price contract for maintenance, modernization and repair of USS Oak Hill. L3 Technologies Inc., Camden, New Jersey, is given a $28,850,598 contract to procure spares and USG-2B System installations.",
        "source": "news.clearancejobs.com",
        "keywords": [
            "received",
            "million",
            "contract",
            "modification",
            "extend"
        ],
        "published_date": "2025-04-19",
        "published_time": "21:57:12",
        "rss_source": "United States"
    },
    {
        "title": "Q1 2025 Global Cyber Attack Report from Check Point Software: Africa most targeted region in an",
        "url": "http://businessghana.com/site/news/technology/326577/Q1-2025-Global-Cyber-Attack-Report-from-Check-Point-Software:-Africa-most-targeted-region-in-an-...",
        "text_hash": "1daf54535688302b5b55537f6a223fb2edc126be8d43b76b30adbf8b7684bac9",
        "summary": "Q1 2025 Global Cyber Attack Report from Check Point Software: Africa most targeted region in an almost 50% surge in cyber threats worldwide. In Q1 2025, cyber attacks per organisation increased by 47%, reaching an average of 1,925 weekly attacks. Education saw the highest number of attacks, with 4,484 weekly, followed by government and telecommunications with 2,678 and 2,664 attacks. Ransomware attacks rose by 126%, with North America accounting for 62% of global incidents, and consumer goods & services being the most targeted sector.",
        "source": "businessghana.com",
        "keywords": [
            "cyber",
            "attacks",
            "threats",
            "worldwide",
            "attack"
        ],
        "published_date": "2025-04-19",
        "published_time": "20:08:42",
        "rss_source": "United States"
    },
    {
        "title": "Dialysis provider DaVita, with 16 Long Island centers, probing ransomware attack - Newsday",
        "url": "https://www.newsday.com/business/davita-dialysis-cyberattack-w08h1tjp",
        "text_hash": "f743612a01491add4c27f435a3eb1abe477a8697d17cd0a095c3a684087fbcf5",
        "summary": "DaVita, with 16 Long Island centers, probing ransomware attack - Newsday. DaVita has more than 2,600 outpatient dialysis centers in 46 states and Washington, D.C. New York State health officials said Wednesday they were aware of the cyber intrusion. Ransomware is a type of software criminals use to encrypt an organization’s access to their own data, a cybersecurity expert said.. In recent years, Long Island businesses, health care providers, and government institutions have fallen victim to cyberattacks.",
        "source": "www.newsday.com",
        "keywords": [
            "davita",
            "which",
            "locations",
            "across",
            "island"
        ],
        "published_date": "2025-04-19",
        "published_time": "18:43:46",
        "rss_source": "United States"
    },
    {
        "title": "Xavier Gracia | Spain Cyber Leader - Deloitte",
        "url": "https://www.deloitte.com/bd/en/about/people/profiles.xavier-gracia+3f0fb465.html",
        "text_hash": "3f160037c40378651af08755fee7b80dd2d9b869cb2d5cb9b129e39b2d84912f",
        "summary": "Xavi Gracia is the leader of the cybersecurity practice at Deloitte Spain. His role is to accompany clients in their transformation process, helping them to solve their most complex cybersecurity challenges. He leads a team of more than 1,500 professionals, promoting talent development, as well as the evolution and innovation of services and capabilities. Xavi is a telecommunications engineer (UPC), a master's degree holder in information technology management (Salle URL) and a graduate of the IESE Business School.",
        "source": "www.deloitte.com",
        "keywords": [
            "spain",
            "leader",
            "cyber",
            "gracia",
            "cybersecurity"
        ],
        "published_date": "2025-04-19",
        "published_time": "17:01:37",
        "rss_source": "United States"
    },
    {
        "title": "Data theft, identity theft & etc;: Only few are insured - teltarif.de News",
        "url": "https://www.teltarif.de/en/cyberversicherung-bitkom-umfrage/news/98404.html",
        "text_hash": "266d8d22bc45590a9e6f1060d6b802bdc8c6ba3bd4251e3faaa61d2b37c11926",
        "summary": "76 percent of Internet users in Germany aged 16 and over surveyed do not have cyberinsurance coverage. 14 percent do not know if existing insurance policies might cover risks. At least one person in Germany currently has cyberins insurance, Bitkom says. Cyber insurance not only insures against financial damage, but can also provide extra support such as technical and legal advice or data recovery measures. For example, asset damage can be covered up to a certain limit, but there are also risks such as online fraud caused by fake shops and identity fraud.",
        "source": "www.teltarif.de",
        "keywords": [
            "cyber",
            "insurance",
            "coverage",
            "varies",
            "prozent"
        ],
        "published_date": "2025-04-19",
        "published_time": "21:17:16",
        "rss_source": "Germany"
    },
    {
        "title": "Litschau Implements Innovative Strategies for Cybersecurity and Insurance",
        "url": "https://thegermanyeye.com/litschau-enhances-cybersecurity-insurance-strategies-18478",
        "text_hash": "d66c85ba9bd5bac68a544ec207725f8454857364475ef49f283b29a459893743",
        "summary": "Litschau Implements Innovative Strategies for Cybersecurity and Insurance. Litschau is exploring innovative insurance solutions to further protect its assets and mitigate risks. The local government is committed to fostering a culture of awareness and preparedness among its staff and residents. Workshops and training programs will be introduced to educate the community about the importance of cybersecurity and the steps individuals can take to protect themselves online. The newly established cybersecurity strategy will focus on several key areas, including the development of robust security protocols and employee training.",
        "source": "thegermanyeye.com",
        "keywords": [
            "cyber",
            "threats",
            "continue",
            "evolve",
            "essential"
        ],
        "published_date": "2025-04-19",
        "published_time": "09:08:42",
        "rss_source": "Germany"
    },
    {
        "title": "Security: 40.000 times more machine identities",
        "url": "https://b2b-cyber-security.de/en/security-40-times-more-machine-identities/",
        "text_hash": "704bbc3a46491303136099eff94546ac51a79b8ce5517c45f6c23039cd5e2970",
        "summary": "Report shows that with 40.000 times more machine identities than human ones, this poses a challenge for corporate security. 92 percent of companies already operate without risky human users. The use of AI and machine learning workloads increased by 500 percent last year. Despite this rapid growth, the public attack surface decreased by 38 percent, indicating increased security for AI applications. The data you enter for the purpose of subscribing to the newsletter will be stored on the CleverReach servers in Germany or Ireland. It is analyzed how many recipients have opened the newsletter message and how often which link in the newsletter was clicked.",
        "source": "b2b-cyber-security.de",
        "keywords": [
            "subscribe",
            "newsletter",
            "cyber",
            "security",
            "month"
        ],
        "published_date": "2025-04-19",
        "published_time": "06:45:05",
        "rss_source": "Germany"
    },
    {
        "title": "140 percent plus: Remote ransomware is increasing rapidly - B2B Cyber Security",
        "url": "https://b2b-cyber-security.de/en/140-percent-plus-remote-ransomware-is-increasing-rapidly/",
        "text_hash": "007f549c3d4e908cc7b5523f1e8797f8776c32f5483587531f21403786ba4787",
        "summary": "CleverReach is a service that can be used to organize and analyze the sending of newsletters. The data you enter for the purpose of subscribing to the newsletter (e.g. email address) will be stored on the CleverReach servers in Germany or Ireland. If you do not want an analysis by Clever reach, you must unsubscribe from the newsletter. After you have unsubscribed, your data will be deleted as soon as possible. Recovery is not possible. Do the same if you want to use a different email address for your newsletter.",
        "source": "b2b-cyber-security.de",
        "keywords": [
            "percent",
            "increase",
            "remote",
            "ransomware",
            "research"
        ],
        "published_date": "2025-04-19",
        "published_time": "06:45:04",
        "rss_source": "Germany"
    },
    {
        "title": "NordPass wins at Global Tech Awards 2025 for excellence in Cyber Security Technology category",
        "url": "https://markets.businessinsider.com/news/stocks/nordpass-wins-at-global-tech-awards-2025-for-excellence-in-cyber-security-technology-category-1034598411",
        "text_hash": "60f1ed30dc0d48267be46d2540565af09dcdb531bfd41fba5fbf31961cbcfd4c",
        "summary": "NordPass wins at Global Tech Awards 2025 for excellence in Cyber Security Technology category. The award celebrates NordPass’ continuous efforts to deliver secure, adaptable, and easy-to-use digital security solutions for individuals and businesses alike. NordPass was created by the experts behind NordVPN — the advanced security and privacy app. All passwords are encrypted on the device, so only the user can access them. For more information: nordpass.com . For more. information: gabriele.gecaite@nordsec.com",
        "source": "markets.businessinsider.com",
        "keywords": [
            "award",
            "powerful",
            "validation",
            "doing",
            "cybersecurity"
        ],
        "published_date": "2025-04-19",
        "published_time": "06:36:56",
        "rss_source": "Germany"
    },
    {
        "title": "\"Canyon's version of the cyber truck.\" Brand's latest concept bike divides the internet",
        "url": "https://road.cc/content/tech-news/canyons-version-cyber-truck-313605",
        "text_hash": "3cce39b555229ff2460a27afc42777d238a97cb9885af4c89c0a9a9525ed4413",
        "summary": "German bike brand Canyon has released images of a concept e-bike. The company claims it would make \"riding more fun and more sustainable\" It's not the first concept bike Canyon has designed. Back in 2016 the brand released images. of a hydrogen powered e- bike, and in 2020, delved into the world of four-wheeled. concepts with an e-vehicle. But let's take a look at what we don't know, and what the internet really thinks.",
        "source": "road.cc",
        "keywords": [
            "canyon",
            "concept",
            "version",
            "cyber",
            "truck"
        ],
        "published_date": "2025-04-20",
        "published_time": "08:07:23",
        "rss_source": "England"
    },
    {
        "title": "From Cyber Commander to civilian defences: Major-General Jonathan Shaw on leading the ...",
        "url": "https://www.londondaily.news/from-cyber-commander-to-civilian-defences-major-general-jonathan-shaw-on-leading-the-fight-against-digital-threats/",
        "text_hash": "bcf21eecdf6ff6917a138aad6816f30ef60d2a8c9db8dacecd1a8a5ec0465624",
        "summary": "Major-General Jonathan Shaw is one of the UK's foremost experts on defence, strategy, and digital resilience. He served as the British Army’s first Head of Cyber Security. In this exclusive interview, we explore his views on today's most pressing cybersecurity challenges, how governments and organisations can stay ahead of digital threats. We need to move from a traditional top-down, command-and-control model to one that empowers those at the coalface, he says. The old hierarchical systems are simply too slow to react effectively, he adds.",
        "source": "www.londondaily.news",
        "keywords": [
            "security",
            "having",
            "served",
            "british",
            "first"
        ],
        "published_date": "2025-04-20",
        "published_time": "07:07:33",
        "rss_source": "England"
    },
    {
        "title": "\"Brussels, my love?\" Young & anxious - Europe's silent crisis - Yahoo News UK",
        "url": "https://uk.news.yahoo.com/brussels-love-young-anxious-europes-050140725.html",
        "text_hash": "5a14ee5f29f59fb114d00a1070e21a3c4498fcc72a9f3d7f02dfd9c424fcd8a0",
        "summary": "EU Commissioner Glenn Micallef says more needs to be done to improve the lives of all in the EU. He also stressed the importance of the Erasmus+ student exchange programme. The EU is a 'fantastic reality that millions of Europeans live every day', he said. Watch the full episode in the player above or listen to the full interview on the Yahoo News UK YouTube channel below:. \"Brussels, my love?\" Young & anxious - Europe's silent crisis - Yahoo news UK.",
        "source": "uk.news.yahoo.com",
        "keywords": [
            "cyber",
            "bullying",
            "mental",
            "health",
            "concerns"
        ],
        "published_date": "2025-04-19",
        "published_time": "12:05:09",
        "rss_source": "England"
    },
    {
        "title": "Cozy Bear's Wine Lure Drops WineLoader Malware on EU Diplomats - Hackread",
        "url": "https://hackread.com/cozy-bear-wine-lure-wineloader-malware-eu-diplomats/",
        "text_hash": "a53b4802a01d5bd8e5f9b60b8272e040f146122aecc03ffd10c24fc702d79b7a",
        "summary": "Midnight Blizzard (APT29/Cozy Bear) targets European embassies and Ministries of Foreign Affairs with sophisticated phishing emails disguised as wine tasting invitations. Researchers at Check Point Research (CPR), who have been tracking this activity, discovered that hackers are using a new malware called ‘Grape loader’ to gain entry. They then install an updated, sneakier version of a backdoor program called 'Wine loader' once inside. Researchers describe Grape loader as a relatively new tool used in the early stages of this attack to gather information.",
        "source": "hackread.com",
        "keywords": [
            "deeba",
            "veteran",
            "cybersecurity",
            "reporter",
            "decade"
        ],
        "published_date": "2025-04-20",
        "published_time": "00:14:14",
        "rss_source": "United States"
    },
    {
        "title": "Report casts light on China infiltration - Taipei Times",
        "url": "https://www.taipeitimes.com/News/front/archives/2025/04/20/2003835480",
        "text_hash": "fffba31ea6c603783ac7905f48ef65fea38b08a0ace8dcf52528c27289c69def",
        "summary": "Taiwanese organized crime, illegal money lenders, temples and civic groups are complicit in Beijing’s infiltration of the armed forces, the Ministry of National Defense said. Report casts light on China infiltration - Taipei Times. 87.5 percent of apprehended Chinese agents were reported by service members they tried to lure into becoming spies, the report said. Taiwan was subjected to 82 cyberattacks last month, a slight decrease from the number of attacks in the same month last year, the ministry said.",
        "source": "www.taipeitimes.com",
        "keywords": [
            "month",
            "cyberattacks",
            "slight",
            "decrease",
            "number"
        ],
        "published_date": "2025-04-19",
        "published_time": "21:43:20",
        "rss_source": "United States"
    },
    {
        "title": "Hackers Actively Exploiting Critical Exchange & SharePoint Server Vulnerabilities",
        "url": "https://cybersecuritynews.com/exchange-sharepoint-server-vulnerabilities/",
        "text_hash": "2a5e42e7681caf42ea33fb846fb9dff3928d2f2f34eee2c0c8390a16bb9144c9",
        "summary": "Threat actors have consistently exploited critical vulnerabilities in Exchange Server and SharePoint Server. Such attacks have been observed to lead to remote code execution, lateral movement, and exfiltration of sensitive data. Microsoft strongly urges organizations running on-premises Exchange or SharePoint servers to:Apply the latest security patches and updates without delay.Enable AMSI integration and ensure compatible antimalware solutions are active.Audit and harden NTLM authentication configurations, enabling Extended Protection for Authentication (EPA) where possible.",
        "source": "cybersecuritynews.com",
        "keywords": [
            "cyber",
            "security",
            "dedicated",
            "platform",
            "attack"
        ],
        "published_date": "2025-04-19",
        "published_time": "19:47:52",
        "rss_source": "United States"
    },
    {
        "title": "IRS axes flexible work schedules, rejects many 'deferred resignation' applications",
        "url": "https://federalnewsnetwork.com/workforce/2025/04/irs-axes-flexible-work-schedules-rejects-many-deferred-resignation-applications/",
        "text_hash": "c42deb7d54cea010ffbbb8f6d2cf92b172ba1fc4d56014980aeaeaacff822005",
        "summary": "The IRS gave employees another chance to accept a “deferred resignation” offer and leave the federal workforce later this year. Thousands of IRS employees applied for the deferred resignation offer, which would allow them to go on paid administrative leave and separate from the agency by the end of the fiscal year. The IRS denied deferred resignation to 2,100 employees — about 10% of the 20,000 employees who applied to take the offer. Among those denied were probationary employees, mostly fired in mid-February.",
        "source": "federalnewsnetwork.com",
        "keywords": [
            "federal",
            "there",
            "network",
            "technology",
            "image"
        ],
        "published_date": "2025-04-19",
        "published_time": "19:39:18",
        "rss_source": "United States"
    },
    {
        "title": "Head of UAE's Cybersecurity emphasises importance of international partnerships in ... - The Tribune",
        "url": "https://www.tribuneindia.com/news/world/head-of-uaes-cybersecurity-emphasises-importance-of-international-partnerships-in-strengthening-digital-security/",
        "text_hash": "18e16aad58678a654bf4505319837bacc3d70d751bd8856814c438bf5f3e6dc3",
        "summary": "UAE-US Business Council hosted a luncheon with Dr Mohammed Al-Kuwaiti, Chairman of the UAE Cybersecurity Council. He provided a preliminary overview of the cybersecurity landscape in light of the increasing technological transformations and challenges. He also discussed the ongoing preparations for the upcoming GISEC Global conference, scheduled to take place from May 6 to 9 in Dubai. The discussions included several prominent figures, including Khush Choksy, Senior Vice President of International Member Relations at the US Chamber of Commerce.",
        "source": "www.tribuneindia.com",
        "keywords": [
            "visit",
            "mohammed",
            "washington",
            "comes",
            "cybersecurity"
        ],
        "published_date": "2025-04-19",
        "published_time": "17:24:19",
        "rss_source": "United States"
    },
    {
        "title": "Security News This Week: Florida Man Enters the Encryption Wars - WIRED",
        "url": "https://www.wired.com/story/florida-man-enters-the-encryption-wars/",
        "text_hash": "5f0049802507f292be0056c76259b47a1eaecebdd8fc5eede608e56841aed497",
        "summary": "Immigrations and Customs Enforcement has a $30 million contract with Palantir to build a “near-real time” surveillance platform. The Department of Homeland Security has been sending aggressive emails telling people with temporary legal status to leave the US. A draft bill in the state of Florida would require social media companies to provide law enforcement with encryption backdoors so cops could access users’ accounts. WIRED took a look at the most dangerous hackers you've never heard of, diving deep on the unrelenting and two-faced Russian intelligence group Gamaredon.",
        "source": "www.wired.com",
        "keywords": [
            "judge",
            "rules",
            "against",
            "police",
            "phone"
        ],
        "published_date": "2025-04-19",
        "published_time": "17:03:06",
        "rss_source": "United States"
    },
    {
        "title": "Hacking US crosswalks to talk like Zuck is as easy as 1234 - The Register",
        "url": "https://www.theregister.com/2025/04/19/us_crosswalk_button_hacking/",
        "text_hash": "8b5ab34168d155e0812bb6c0864eb4d92b3281d21c495848e6a9e6f6f1fe8996",
        "summary": "Hackers hijack US crosswalks to talk like Zuck is as easy as 1234 - The Register. In Seattle this week, some crosswalk buttons started playing AI-generated messages spoofing tech tycoon Jeff Bezos. Similar hacks were spotted, or rather heard, in Silicon Valley. The city government isn't thrilled either: Fixing the tampered buttons is eating up staff time that could be spent elsewhere. It's not known who's behind the pranks, but whoever it is will likely keep at it.",
        "source": "www.theregister.com",
        "keywords": [
            "working",
            "vendor",
            "explore",
            "stronger",
            "security"
        ],
        "published_date": "2025-04-19",
        "published_time": "16:44:48",
        "rss_source": "United States"
    },
    {
        "title": "Army expands access to encrypted Wickr platform in aim to curb insecure comms, bolster integration",
        "url": "https://breakingdefense.com/2025/04/army-expands-access-to-encrypted-wickr-platform-in-aim-to-curb-insecure-comms-bolster-integration/",
        "text_hash": "e85654ced6abd4fefbda38e481b35c0bfcf09cb32213b44ee9c946606ecfe503",
        "summary": "The Army has announced its Army Enterprise Wickr platform is expanding to a wider audience. Wickr was well known as a commercially available encryption service. The proliferation of Wickr in the Army’s ranks comes on the heels of “Signal-gate’ The Army is also looking to integrate Wickr with its Army Vantage program, its Army Intelligence Data Platform and Mission Support Services, the service said in a recent press release. The service said ECMA “continues to onboard new user requests on a rolling basis, contingent on mission priority.",
        "source": "breakingdefense.com",
        "keywords": [
            "security",
            "wickr",
            "operates",
            "department",
            "defense"
        ],
        "published_date": "2025-04-19",
        "published_time": "15:51:19",
        "rss_source": "United States"
    },
    {
        "title": "Dems fret over DOGE feeding sensitive data into random AI - The Register",
        "url": "https://www.theregister.com/2025/04/18/house_democrats_doge/",
        "text_hash": "a475fa83dadec6353b822a6972f6dc1c0e91f2b7b5369fd2e06f305ea1df5e29",
        "summary": "DOGE's use of AI runs afoul of several federal laws and the OMB's own AI directives. The Dems believe Musk is self-dealing by using his own Grok-2 AI model to ingest government data. \"Without proper protections, feeding sensitive data into an AI system puts it into the possession of a system's operator — a massive breach of public and employee trust and an increase in cybersecurity risks surrounding that data,\" the Dems said in a letter to the White House.",
        "source": "www.theregister.com",
        "keywords": [
            "narrower",
            "topics",
            "cybersecurity",
            "infrastructure",
            "security"
        ],
        "published_date": "2025-04-19",
        "published_time": "15:45:30",
        "rss_source": "United States"
    },
    {
        "title": "New payment-card scam involves a phone call, some malware and a personal tap",
        "url": "https://therecord.media/new-payment-card-scam-involves-malware-tap",
        "text_hash": "127f552576223a3b144d98377385a8317e2d08a51f97c318537d627c11131be0",
        "summary": "A new payment-card scam involves a phone call, some malware and a personal tap. Financial institutions should be on alert for a scam that combines social engineering, previously undocumented malware and mobile phones’ near-field communication (NFC) capabilities. The malware, which Cleafy is calling SuperCard X, overlaps with malicious code first reported by researchers at Slovakia-based ESET in 2024. U.S. authorities arrested two Chinese nationals earlier this year in a “tap to pay” scam.",
        "source": "therecord.media",
        "keywords": [
            "cybersecurity",
            "companies",
            "enforcement",
            "agencies",
            "warning"
        ],
        "published_date": "2025-04-19",
        "published_time": "13:40:18",
        "rss_source": "United States"
    },
    {
        "title": "Institute of Information Management (IIM) Australia Successfully Concludes 2025 Annual ...",
        "url": "https://www.finanznachrichten.de/nachrichten-2025-04/65159062-institute-of-information-management-iim-australia-successfully-concludes-2025-annual-conference-induction-investiture-in-brisbane-008.htm",
        "text_hash": "a59f0280a3aed92b18f246208c1068756da53ca2fa2401b42e4cffd033641232",
        "summary": "The Institute of Information Management (IIM) Australia is pleased to announce the successful conclusion of its 2025 Annual Conference, Induction, and Investiture Ceremony. With the theme \"Navigating Data Integrity and Compliance in the Australian Digital Landscape,\" the event brought together distinguished professionals, industry leaders, inductees, and guests from both the public and private sectors. The conference reaffirmed IIM Australia's unwavering commitment to promoting thought leadership, regulatory awareness, and excellence in data governance amid the ongoing digital transformation.",
        "source": "www.finanznachrichten.de",
        "keywords": [
            "light",
            "critical",
            "developments",
            "privacy",
            "other"
        ],
        "published_date": "2025-04-19",
        "published_time": "19:11:49",
        "rss_source": "Germany"
    },
    {
        "title": "Farewell Asda, hello Voyado: these are our most read retail technology articles from last week",
        "url": "https://retailtechinnovationhub.com/home/2025/4/20/farewell-asda-hello-voyado-these-are-our-most-read-retail-technology-articles-from-last-week",
        "text_hash": "b7ea6ef5ab303d7875b9b2ef087291a39e944babfd53cdaa18f99202c3dfb797",
        "summary": "Swedish retail tech firm Voyado hires former SAP Emarsys exec Thomas Harris as CRO. Rob Barnes departs Asda and CIO role after driving technology change across the business. Flagship, JD.com, Nedap, HEMA, HyperFinity, InPost, Yodel, SAP Emarys, and Unibail-Rodamco-Westfield all featured. Check out the articles on this here website that caught your fancy last week, including Flagship and Nedap.",
        "source": "retailtechinnovationhub.com",
        "keywords": [
            "security",
            "sleep",
            "happens",
            "cybersecurity",
            "threats"
        ],
        "published_date": "2025-04-20",
        "published_time": "05:09:50",
        "rss_source": "England"
    },
    {
        "title": "Microsoft explains TPM benefits and why it makes Windows 11 better than 10 - Neowin",
        "url": "https://www.neowin.net/news/microsoft-explains-tpm-benefits-and-why-it-makes-windows-11-better-than-10/",
        "text_hash": "e1f2c849269caba99415338f2139db5473c07b56b0e9acecbb57673d570421e7",
        "summary": "Microsoft explains TPM benefits and why it makes Windows 11 better than 10. As Windows 10's end-of-support date approaches, most people will be looking to make the jump, and Microsoft is also looking forward to that. The TPM 2.0 is one of the system requirements for Windows 11. Microsoft has explained why that is and how it helps make Windows 11 a better OS than Windows 10. It even suggests that those who are unable to upgrade due to ineligible hardware dump their PC and get a new one with Windows 11 instead.",
        "source": "www.neowin.net",
        "keywords": [
            "feature",
            "called",
            "secure",
            "helps",
            "malicious"
        ],
        "published_date": "2025-04-19",
        "published_time": "21:54:18",
        "rss_source": "England"
    },
    {
        "title": "'He and the likes of Cowan-Dickie are pushing for Lions honours' - Rugbypass.com",
        "url": "https://www.rugbypass.com/news/sale-boss-alex-sanderson-backs-tom-curry-to-make-lions-squad/",
        "text_hash": "1f022a6418643866891fc6b9ee52ebf775fb98b9a89f7dac7ad6dff316b1da72",
        "summary": "Sale Sharks beat Harlequins 43-29 at Twickenham Stoop. Alex Sanderson backs Tom Curry to get on a second Lions tour. England flanker produced the kind of carrying and try-scoring performance which England fans have enjoyed for many years. Sanderson: 'He and the likes of Cowan-Dickie are pushing for Lions honours and they richly deserve it if you’re just going on that game' Quins boss Danny Wilson refuses to give up on his team’s hopes.",
        "source": "www.rugbypass.com",
        "keywords": [
            "cyber",
            "security",
            "company",
            "instrumental",
            "recovering"
        ],
        "published_date": "2025-04-19",
        "published_time": "17:42:53",
        "rss_source": "England"
    },
    {
        "title": "Chip makes cybersecurity easier - Control Engineering Europe",
        "url": "https://www.controlengeurope.com/article/215091/Chip-makes-cybersecurity-easier.aspx",
        "text_hash": "36a65aa290a8d1bc1ad86760d5cd841669bc567473487e2fe4ccaf2aea9f29ec",
        "summary": "The Profinet IO TSP-1 device chip supports the Profibus User Organization’s Security Class 1 specification. The TPS-1 chip includes a number of different security features that can be summarised under the term ‘security-by-design’ The introduction of DCP Read-Only mode aims to ensures the availability of an existing device connection between the controller and the device. This way, critical services are not lost in the event of an attack. The chip was designed to provide device manufacturers with a fast, easy and cost-saving way to integrate the ProfinetIO device interface into their devices.",
        "source": "www.controlengeurope.com",
        "keywords": [
            "adoption",
            "cyber",
            "resilience",
            "european",
            "standard"
        ],
        "published_date": "2025-04-19",
        "published_time": "14:59:40",
        "rss_source": "England"
    },
    {
        "title": "Securing the future of industrial automation - Control Engineering Europe",
        "url": "https://www.controlengeurope.com/article/215089/Securing-the-future-of-industrial-automation.aspx",
        "text_hash": "71dee3ebe2c96840043a6ba42c0e258c08cc1365a57b9449837da4141f02f2dd",
        "summary": "In February 2024, five production plants at German battery manufacturer Varta came to a halt. A cyberattack had infiltrated its operational technology (OT) systems. Manufacturing operations that once relied on isolated, air-gapped systems are now highly networked. A single breach can cause catastrophic disruption, halting assembly lines, corrupting product quality or even compromising intellectual property. OryxAlign can provide advanced security solutions tailored for industrial automation. It offers a managed extended detection and response solution that offers real-time monitoring across IT and OT networks.",
        "source": "www.controlengeurope.com",
        "keywords": [
            "combat",
            "growing",
            "cyber",
            "threat",
            "manufacturers"
        ],
        "published_date": "2025-04-19",
        "published_time": "14:49:53",
        "rss_source": "England"
    },
    {
        "title": "Ransomware attacks are increasing sharply - B2B Cyber Security",
        "url": "https://b2b-cyber-security.de/en/ransomware-angriffe-steigen-stark-an/",
        "text_hash": "1ed4441797cf13bdfa3b25ca3ef1a577eef45860fe81be954e5db69aa537ea7a",
        "summary": "February 2025 was a record month, according to experts at Bitdefender Labs. Compared to February 2024, attacks in February 2025 increased by 126 percent. Germany is among the top five countries attacked. The Clop (CI0p) group was the most active in February and was responsible for 335 of 962 attacks. It exploited the vulnerabilities CVE-9,8-2024 and CVE-50623- 2024 in the file transfer software Cleo, each rated 55956.",
        "source": "b2b-cyber-security.de",
        "keywords": [
            "bitdefender",
            "february",
            "record",
            "month",
            "according"
        ],
        "published_date": "2025-04-20",
        "published_time": "07:26:37",
        "rss_source": "Germany"
    },
    {
        "title": "North Wales Police issue warning over fraudulent DVLA emails - Wrexham.com",
        "url": "https://wrexham.com/news/north-wales-police-issue-warning-over-dvla-fraud-268965.html",
        "text_hash": "2283d9a6063751accf06df22f24e3b5a9a429f6bcae7c0e71efd347d66130994",
        "summary": "North Wales Police issue warning over fraudulent DVLA emails. One email carries the subject line “Update Your Road Tax’ and falsely states that the recipient’s vehicle is “not legally allowed to be on the road’ North Wales Police said: “Scammers have been targeting motorists in recent weeks with attempts to gather personal and financial details from them via scam emails.”Officials say the most effective way to access DVLA services is by visiting the official government website at GOV.UK.",
        "source": "wrexham.com",
        "keywords": [
            "forwarding",
            "phishing",
            "emails",
            "national",
            "cyber"
        ],
        "published_date": "2025-04-20",
        "published_time": "10:33:20",
        "rss_source": "England"
    },
    {
        "title": "Digital sabre-rattling: In a world on edge, cybersecurity may be the next line of defence",
        "url": "https://www.firstpost.com/world/digital-sabre-rattling-in-a-world-on-edge-cybersecurity-may-be-the-next-line-of-defence-13881477.html",
        "text_hash": "277d80dbc6806ea5cc1cd406ec0cc8c1c12ef79afd6b0f6a5b610357658efc49",
        "summary": "Experts warn that cyberattacks could disrupt critical systems and escalate into conflict. Despite the growing threat, President Trump has cut cybersecurity staff and funding, raising concerns about America’s digital defences. Meanwhile, US adversaries — including China, Russia, Iran and North Korea — are stepping up cyber cooperation, adding fears of a broader digital arms race. Vulnerabilities have grown as people and businesses use connected devices to count steps, manage finances and operate facilities such as water plants and ports. Each network and connection is a potential target for foreign governments or the hacking groups that sometimes do their bidding.",
        "source": "www.firstpost.com",
        "keywords": [
            "despite",
            "growing",
            "threat",
            "president",
            "trump"
        ],
        "published_date": "2025-04-20",
        "published_time": "14:26:44",
        "rss_source": "United States"
    },
    {
        "title": "Healthcare leaders: Prepare for a very different HIPAA security rule | Viewpoint",
        "url": "https://www.chiefhealthcareexecutive.com/view/healthcare-leaders-prepare-for-a-very-different-hipaa-security-rule-viewpoint",
        "text_hash": "99b70a7f5f76a8d51b613d3468f6afe3141602f65857df269d6a1412027e7a8f",
        "summary": "Cybersecurity is an enterprise-wide risk issue, not just an IT issue, says Joe Oleksak. The proposed rule eliminates the distinction between “addressable” and “required” For many healthcare organizations, this will necessitate the complete reinvention of the organization’s security architecture, he says. The era of executive ownership of cybersecurity preparedness is here, Oleksakov says. It is a concern that has the potential to overshadow practically any other operational concern without warning.",
        "source": "www.chiefhealthcareexecutive.com",
        "keywords": [
            "recent",
            "years",
            "cybersecurity",
            "profession",
            "predicted"
        ],
        "published_date": "2025-04-20",
        "published_time": "14:09:02",
        "rss_source": "United States"
    },
    {
        "title": "Week in review: LLM package hallucinations harm supply chains, Nagios Log Server flaws fixed",
        "url": "https://www.helpnetsecurity.com/2025/04/20/week-in-review-llm-package-hallucinations-harm-supply-chains-nagios-log-server-flaws-fixed/",
        "text_hash": "c60637c48df7d3d1354777da197a06057c70e3d66c59261b40c767f6ebdde16e",
        "summary": "Apple has released emergency security updates for iOS/iPadOS, macOS, tvOS and visionOS. Windows NTLM vulnerability exploited in multiple attack campaigns. Hertz data breach linked to last year’s exploitation of Cleo zero-day vulnerabilities by a ransomware gang. Cybercriminal groups embrace corporate structures to scale, sustain operations.. The future of the Common Vulnerabilities and Exposures (CVE) program hangs in the balance: MITRE could lose the US federal funding that helps them maintain it.",
        "source": "www.helpnetsecurity.com",
        "keywords": [
            "security",
            "python",
            "software",
            "foundation",
            "check"
        ],
        "published_date": "2025-04-20",
        "published_time": "14:02:15",
        "rss_source": "United States"
    },
    {
        "title": "Obituary for Brandon Stewart Ahring | Williamson Funeral Homes, Ltd.",
        "url": "https://www.williamsonfh.com/obituary/Brandon-Ahring",
        "text_hash": "1bcb72899e8a97ecc6797bd8e3df458bc3ebf0e1f93efee21e3cb55137bdb6ba",
        "summary": "Brandon Stewart Ahring, 22, of Holiday Shores, IL, passed away on Wednesday, April 16, 2025 near Hamel, IL. He was a 2021 graduate of Father McGivney Catholic High School, where he ran Cross Country & Track. Brandon was currently attending his 4th year at SIU-Edwardsville, working toward earning a degree in Cyber Security. Funeral Mass will be held at 11 AM on April 23, 2025 at St. Michael Catholic Church in Staunton, IL,. Interment will follow in Memorial Park Cemetery.",
        "source": "www.williamsonfh.com",
        "keywords": [
            "currently",
            "attending",
            "where",
            "working",
            "toward"
        ],
        "published_date": "2025-04-20",
        "published_time": "13:50:20",
        "rss_source": "United States"
    },
    {
        "title": "Countries shore up digital defenses as tensions raise the threat of cyberwarfare - ABC News",
        "url": "https://abcnews.go.com/Politics/wireStory/countries-shore-digital-defenses-global-tensions-raise-threat-120987665",
        "text_hash": "561fe80ca36e9d2839e085013317e4fa19e670816ceac37b65da2bdc643c7976",
        "summary": "Countries shore up digital defenses as tensions raise the threat of cyberwarfare. Hackers linked to Russia's government launched a cyberattack last spring against municipal water plants in rural Texas. A year later, countries around the world are preparing for greater digital conflict as increasing global tensions and a looming trade war have raised the stakes. Businesses now are increasingly concerned about cyberattacks, and governments have moved to a war footing, according to a report this month by NCC Group, a British cybersecurity firm.",
        "source": "abcnews.go.com",
        "keywords": [
            "security",
            "confluence",
            "events",
            "national",
            "cyber"
        ],
        "published_date": "2025-04-20",
        "published_time": "13:44:53",
        "rss_source": "United States"
    },
    {
        "title": "Innovative strategic partnership between Sharjah Cyber Security Center and Fortinet Inc.",
        "url": "https://www.zawya.com/en/press-release/government-news/innovative-strategic-partnership-between-sharjah-cyber-security-center-and-fortinet-inc-h4wplfck",
        "text_hash": "8d5f9144b16cbeb06d9aa291b1e6931fc0ab212eeb475ad75d69cfcb5faa64d2",
        "summary": "Sharjah Cyber Security Center, operating under Sharjah Digital Department (SDD), has signed a memorandum of understanding (MoU) with Fortinet Inc. The agreement aims to reinforce cooperation in ICT security and enhance national capabilities in addressing cyber threats. Both parties aim to enhance institutional capabilities and advance national digital resilience through skill-building, shared expertise, and strategic collaboration. The partnership also includes access to Fortinet’s NSE training materials, advisory support for incident response, and joint efforts in gap assessments and cloud security.",
        "source": "www.zawya.com",
        "keywords": [
            "agreement",
            "reinforce",
            "cooperation",
            "security",
            "enhance"
        ],
        "published_date": "2025-04-20",
        "published_time": "12:54:20",
        "rss_source": "United States"
    },
    {
        "title": "Your Local College: The Surprising Place You Might Find Cleared Work - ClearanceJobs",
        "url": "https://news.clearancejobs.com/2025/04/20/your-local-college-the-surprising-place-you-might-find-cleared-work/",
        "text_hash": "905905fc2576addb539c0f87c5b4065b388c25f9809d466afa4c6def810a0d7e",
        "summary": "An increasing number of higher education institutions are operating, or moving to open, classified laboratories. A security clearance sponsored by their university can provide a sizeable advantage against their uncleared fellow graduates in the post-graduation job search. The pairing seems obvious, but the job opportunities it presents remain relatively low profile, likely because most cleared workers aren’t searching college and university job vacancies. The information is believed to be accurate as of the publication date, but no guarantee or warranty is offered or implied. Laws and government policies are subject to change.",
        "source": "news.clearancejobs.com",
        "keywords": [
            "among",
            "areas",
            "focus",
            "highlighted",
            "missile"
        ],
        "published_date": "2025-04-20",
        "published_time": "12:28:13",
        "rss_source": "United States"
    },
    {
        "title": "Switching to Cybersecurity: Advice for Midcareer Professionals - GovTech",
        "url": "https://www.govtech.com/blogs/lohrmann-on-cybersecurity/switching-to-cybersecurity-advice-for-midcareer-professionals",
        "text_hash": "d9464fb6327da318722403748fb1301c6323d514a696a8b3fbcf4ffc3a44ed6d",
        "summary": "Dan Lohrmann offers practical ways to \"get to yes\" securely. From fortifying cybersecurity defenses and leveraging AI to optimizing cloud infrastructure and securing mobile platforms, Dan offers advice for midcareer professionals.",
        "source": "www.govtech.com",
        "keywords": [
            "often",
            "asked",
            "question",
            "cyber",
            "career"
        ],
        "published_date": "2025-04-20",
        "published_time": "09:06:22",
        "rss_source": "United States"
    },
    {
        "title": "Cybersecurity Companies in The USA - TechBullion",
        "url": "https://techbullion.com/cybersecurity-companies-in-the-usa/",
        "text_hash": "4726687ba4b401f890d259a23f31162a5bd3eb60eb9bb204aebac7104399e4d7",
        "summary": "The field of cybersecurity is thriving in the U.S. Organizations operating here assist businesses, government entities, and individuals in countering cyber threats. Selecting the right cybersecurity partner is a critical decision for companies of all sizes. A well-chosen contractor can not only enhance protection but also streamline processes related to risk management. The country’s unique ecosystem, blending cutting-edge technology, skilled professionals, and a demand for innovation, positions the US as a leader in this domain.",
        "source": "techbullion.com",
        "keywords": [
            "explore",
            "leading",
            "cybersecurity",
            "firms",
            "protecting"
        ],
        "published_date": "2025-04-20",
        "published_time": "04:13:09",
        "rss_source": "United States"
    },
    {
        "title": "CISA extends MITRE's CVE program for 11 months | Digital Watch Observatory",
        "url": "https://dig.watch/updates/cisa-extends-mitres-cve-program-for-11-months",
        "text_hash": "c4419bcf41723fed01df6fb6d53fec6a5134782b837aafc76a59b36c7e1627a7",
        "summary": "US Cybersecurity and Infrastructure Security Agency (CISA) has extended its contract with the MITRE Corporation to continue operating the Common Vulnerabilities and Exposures (CVE) program for an additional 11 months. The decision was made one day before the existing contract was set to expire. The contract, which originally concluded on April 17, includes provisions for optional extensions through March 2026. A group of CVE Board members announced the formation of a new non-profit organisation — the CVE Foundation — aimed at supporting the long-term sustainability and governance of the initiative.",
        "source": "dig.watch",
        "keywords": [
            "cybersecurity",
            "infrastructure",
            "security",
            "agency",
            "extended"
        ],
        "published_date": "2025-04-20",
        "published_time": "02:01:45",
        "rss_source": "United States"
    },
    {
        "title": "Bridging The Cybersecurity Gap: Lessons From The U.S Cyber Security Strategy For Pakistan",
        "url": "https://www.dailyparliamenttimes.com/2025/04/20/bridging-the-cybersecurity-gap-lessons-from-the-u-s-cyber-security-strategy-for-pakistan/",
        "text_hash": "2e97312d5fa580790f73a122b1f40d5acc8fd2daecc1db5dece3167674119ea0",
        "summary": "The essential nature of cybersecurity for national security and economic stability is now a fundamental requirement in today’s digital world. Countries worldwide including Pakistan and the United States developed policies to counter cyber threats as they acknowledged the urgent need. Pakistan experiences an extreme lack of skilled professionals in the field of cybersecurity. Qualified cybersecurity professionals in Pakistan are in short supply which hinders effective response to developing cyber threats. Basic cybersecurity practices remain unknown to many individuals and small businesses which leads to higher vulnerability levels. The existing cybersecurity infrastructure such as Security Operations Centers (SOCs) and Computer Emergency Response Teams (CERTs) lacks development and proper resources.",
        "source": "www.dailyparliamenttimes.com",
        "keywords": [
            "cyber",
            "national",
            "threats",
            "acknowledged",
            "urgent"
        ],
        "published_date": "2025-04-20",
        "published_time": "15:31:50",
        "rss_source": "United States"
    },
    {
        "title": "Cyber threats target F-35 in new era of military defense risks",
        "url": "https://bulgarianmilitary.com/2025/04/20/cyber-threats-target-f-35-in-new-era-of-military-defense-risks/",
        "text_hash": "341d231f6a3617e504996e9054cbe1d7a4649dd35183d1eee8be0cdbaa794b8a",
        "summary": "Cybersecurity has emerged as a cornerstone of military strategy, rivaling the importance of air or nuclear defenses. Modern combat platforms, from fighter jets to naval fleets, rely on interconnected networks for navigation, communication, and targeting. A cyber breach could disrupt mission-critical data, compromise stealth capabilities, or even ground the aircraft. In April 2025, a NATO exercise in the Czech Republic exposed a stark reality: a simulated cyberattack on critical infrastructure could paralyze allied defenses in hours. The transformation of warfare in 2025 hinges on the digitization of military systems.",
        "source": "bulgarianmilitary.com",
        "keywords": [
            "conducted",
            "april",
            "exercise",
            "tested",
            "virtual"
        ],
        "published_date": "2025-04-20",
        "published_time": "15:08:52",
        "rss_source": "United States"
    },
    {
        "title": "Bombay HC Receives Assurance from Police on Cyber Fraud Cases - Deccan Herald",
        "url": "https://www.deccanherald.com/india/maharashtra/will-act-with-alacrity-on-cyber-fraud-cases-police-assure-bombay-hc-3501629",
        "text_hash": "6d22779acde541ca45a96886ea31c9dfdf490ed68713d6065d4610cea21f2053",
        "summary": "Bombay HC Receives Assurance from Police on Cyber Fraud Cases. Will act with alacrity on cyber fraud cases: Police assure Bombay HC. Justices Revati Mohite Dere and Neela Gokhale in the order passed on April 15 noted that cyber Fraud cases were on the rise.",
        "source": "www.deccanherald.com",
        "keywords": [
            "alacrity",
            "cyber",
            "fraud",
            "cases",
            "police"
        ],
        "published_date": "2025-04-20",
        "published_time": "13:34:00",
        "rss_source": "United States"
    },
    {
        "title": "Is your DNA information safe? Scientists warn of cyber threats - Earth.com",
        "url": "https://www.earth.com/news/is-your-dna-information-safe-scientists-warn-of-cyber-threats/",
        "text_hash": "a7714f37533d2604eb1979f7026de490e4e94e373d18926f4ee614e601367eca",
        "summary": "Experts warn that next-generation DNA sequencing (NGS) might be a new target for cybercriminals. Attackers can slip in cyber-biosecurity exploits by uploading corrupted files or by intercepting data on unsecured networks. “Genomic data is one of the most personal forms of data we have,” stated Dr. Mahreen-Ul-Hassan from the Shaheed Benazir Bhutto Women University, who co-authored the study.",
        "source": "www.earth.com",
        "keywords": [
            "researchers",
            "sequencing",
            "tools",
            "cyber",
            "threats"
        ],
        "published_date": "2025-04-20",
        "published_time": "12:37:50",
        "rss_source": "United States"
    },
    {
        "title": "Rooting Your Phone Opens the Door to Cyber Threats, Study Finds - iHLS",
        "url": "https://i-hls.com/archives/128594",
        "text_hash": "3b090fe68de22380151abcc213917b6f779a43da67c8a2741c03224b54cae08a",
        "summary": "Zimperium: Rooting Your Phone Opens the Door to Cyber Threats, Study Finds. Rooting provides users with privileged access to the operating system, enabling them to bypass system restrictions and install apps from unofficial sources. However, this practice opens the door to various risks, including the installation of malicious apps that bypass standard security checks. Attackers often exploit these vulnerabilities by using rootkits to gain elevated privileges and execute malicious activities. To mitigate these threats, the firm recommends that companies implement strict mobile device policies and adopt advanced threat detection measures.",
        "source": "i-hls.com",
        "keywords": [
            "cyber",
            "threats",
            "analysis",
            "shows",
            "users"
        ],
        "published_date": "2025-04-20",
        "published_time": "12:13:06",
        "rss_source": "United States"
    },
    {
        "title": "Yokogawa Recorder Vulnerability Could Let Attackers Hijack Critical Industrial Systems",
        "url": "https://thecyberexpress.com/yokogawa-flaw-exposes-industrial-systems/",
        "text_hash": "90ab04065e719411b530dbc919525903d9a0828795f09e1af3ee74243a4c8dc8",
        "summary": "A high-severity vulnerability has been discovered in a range of industrial recorder and data acquisition systems. The vulnerability is linked to insecure default settings in Yokogawa’s recorder products. This means that when the devices are connected to a network without any configuration changes, anyone with network access can gain full access to critical functions. Such unrestricted access allows an attacker to manipulate measured values, alter system settings, and potentially compromise the integrity of critical operations in sectors like manufacturing, energy, and agriculture.",
        "source": "thecyberexpress.com",
        "keywords": [
            "authentication",
            "interaction",
            "needed",
            "making",
            "attractive"
        ],
        "published_date": "2025-04-21",
        "published_time": "06:36:16",
        "rss_source": "United States"
    },
    {
        "title": "Increased visibility leads to increased cyber resilience - Security Magazine",
        "url": "https://www.securitymagazine.com/articles/101554-increased-visibility-leads-to-increased-cyber-resilience",
        "text_hash": "2308b94b43954c1e65a0727975a13bcb2301c8c89e6393a80ecf2d0ed25bc36a",
        "summary": "David Kellerman, Field CTO at Cymulate, talks about the risks of security silos. Security operations (SecOps) teams face a difficult challenge in keeping up with the number of repetitive and varied tasks. Security teams must take a step back and implement a comprehensive strategy, such as exposure validation, that can validate exposures. Increased visibility into the organization’s security efforts allows teams to work in unison and address the most pressing threats, says Kellerman. to ensure cyber resilience, organizations must consider all of the pieces as one whole.",
        "source": "www.securitymagazine.com",
        "keywords": [
            "cyber",
            "resilience",
            "essential",
            "modern",
            "threat"
        ],
        "published_date": "2025-04-21",
        "published_time": "05:23:37",
        "rss_source": "United States"
    },
    {
        "title": "Inside the Mind of Cybersecurity's Game-Changer - Entrepreneur",
        "url": "https://www.entrepreneur.com/en-gb/technology/inside-the-mind-of-cybersecuritys-game-changer/490199",
        "text_hash": "146c4053a9495a6b066f202b1b0823b275f4b9d33bb27b38f978fe48ee3ca1aa",
        "summary": "Spencer Summons is a multi award-winning cyber strategy leader and mentor. He has over 30 years' experience in high-risk security and cyber. He is the founder of Opliciti, a cyber security organisation supporting organisations and high net worth individuals to protect their assets, data and intellectual property from cyber-crime. Summons reveals how the landscape has evolved, the challenges facing businesses today, and the strategies that can protect against the most sophisticated cyber threats. Click here for more from Spencer Summons.",
        "source": "www.entrepreneur.com",
        "keywords": [
            "founder",
            "opliciti",
            "cyber",
            "security",
            "organisation"
        ],
        "published_date": "2025-04-21",
        "published_time": "05:15:22",
        "rss_source": "United States"
    },
    {
        "title": "Examining AI in cyber insurance | Insurance Business America",
        "url": "https://www.insurancebusinessmag.com/us/tv/examining-ai-in-cyber-insurance-531994.aspx",
        "text_hash": "f392f73090ab3bbc120fbdbbd545073c4577ced5faf495ac77ac3b1a696af338",
        "summary": "Examining AI in cyber insurance. Join Tokio Marine HCC Cyber and Professional Lines Group's Dan Crane and Eugene Eychis as they examine the impact of AI. They look at the ways in which AI is currently enhancing risk assessment, strategies to mitigate its risks and emerging technologies they are most excited about.",
        "source": "www.insurancebusinessmag.com",
        "keywords": [
            "roundtable",
            "special",
            "insurance",
            "business",
            "tokio"
        ],
        "published_date": "2025-04-21",
        "published_time": "05:03:32",
        "rss_source": "United States"
    },
    {
        "title": "Opportunities in Cyber Security: A growing field with boundless potential",
        "url": "https://www.edexlive.com/opinion/2025/Apr/21/opportunities-in-cyber-security-a-growing-field-with-boundless-potential",
        "text_hash": "8b69fbc73956c946fff9d9109f61fb4657e383875223f475d563af27ae70a628",
        "summary": "In today’s digital age, the importance of Cyber Security has skyrocketed. As cyber threats become more sophisticated, organizations worldwide are looking for experts to safeguard their sensitive data, networks, and infrastructure. Leading institutions now offer specialized programs that equip students with both the theoretical knowledge and hands-on experience needed to tackle modern security challenges. Key sectors, such as banking, healthcare, e-commerce, and even government agencies, are investing heavily in strengthening their security measures. A comprehensive education in Cyber Security is essential for those who wish to thrive in this industry.",
        "source": "www.edexlive.com",
        "keywords": [
            "beyond",
            "coursework",
            "research",
            "plays",
            "pivotal"
        ],
        "published_date": "2025-04-21",
        "published_time": "04:57:12",
        "rss_source": "United States"
    },
    {
        "title": "Key Updates on Attacks, Vulnerabilities, & Data Breaches - Cyber Security News Letter",
        "url": "https://cybersecuritynews.com/cyber-security-news-letter/",
        "text_hash": "e65beb49ffec710784fa223b0caa8420ed9f96a9864441dd092767b7946b97b6",
        "summary": "This edition focuses on new threats and the evolving landscape of digital defenses. Key topics include sophisticated ransomware attacks and the growing impact of state-sponsored cyber operations on global security. We examine how cutting-edge technologies like artificial intelligence (AI), machine learning (ML), and quantum computing are reshaping cybersecurity. We will also evaluate recent regulatory changes, such as the European Union’s General Data Protection Regulation (GDPR) and California's Consumer Privacy Act (CCPA), which are establishing new standards for data privacy and security.",
        "source": "cybersecuritynews.com",
        "keywords": [
            "cyber",
            "attack",
            "hackers",
            "abuse",
            "deliver"
        ],
        "published_date": "2025-04-21",
        "published_time": "04:52:10",
        "rss_source": "United States"
    },
    {
        "title": "Cyber threats now a daily reality for one in three businesses - Help Net Security",
        "url": "https://www.helpnetsecurity.com/2025/04/21/businesses-fraud-consequence/",
        "text_hash": "2adc2cbcf1ad139a0c76375055d36f1e5755513b1cb3ee8c9ed4b616fa3af6b2",
        "summary": "Businesses are losing out on an average of $98.5 million a year as a consequence of cyber threats, fraud, regulatory hurdles and operational inefficiencies. 37% of respondents said their company experiences cyber threats daily, and 74% face critical or high-profile threats on a monthly basis. The cost of disharmony is highest among technology companies, followed by insurance, financial services and fintech respondents. Fintech strategy is key to growth. 82% of surveyed leaders said they have implemented embedded finance solutions, realizing an average 8.5% growth in sales.",
        "source": "www.helpnetsecurity.com",
        "keywords": [
            "businesses",
            "losing",
            "average",
            "million",
            "consequence"
        ],
        "published_date": "2025-04-21",
        "published_time": "04:34:24",
        "rss_source": "United States"
    },
    {
        "title": "We'll use Cyber Security Act to attract investment and ensure digital integrity – Mutati",
        "url": "https://diggers.news/local/2025/04/21/well-use-cyber-security-act-to-attract-investment-and-ensure-digital-integrity-mutati/",
        "text_hash": "7b9a5ae0c3114323f8f61a746bb1c7beff5e147bd72915ca63e16b79d10d0895",
        "summary": "Science and Technology Minister Felix Mutati says government had the safety of Zambians in mind when enacting the Cyber Security Law. We'll use Cyber Security Act to attract investment and ensure digital integrity – Mutati. Mutati: \"It’s our responsibility to ensure that this Act also drives investment, innovation and creativity, creating opportunities for our people and growing the economy\" He says the law is aimed at protecting the country's sovereignty and digital integrity. The law is expected to come into force on January 1, 2015.",
        "source": "diggers.news",
        "keywords": [
            "science",
            "technology",
            "minister",
            "felix",
            "mutati"
        ],
        "published_date": "2025-04-21",
        "published_time": "04:32:06",
        "rss_source": "United States"
    },
    {
        "title": "Cyber Fraud and Family Controversies: The Chequered Career of Former DG&IGP Om Prakash",
        "url": "https://www.deccanherald.com/india/karnataka/bengaluru/who-is-om-prakash-ex-karnataka-top-cop-murdered-by-wife-2-3502058",
        "text_hash": "d8cbea73865c119e0b5d1ff89c4a3b1ed3f2e4dce0e08c04bff40874cee13f24",
        "summary": "The cyber con, first reported by DH, saw him lose Rs 10,000. A fraudster, posing as an ICICI Bank employee, convinced him to share his credit card details under the pretext of renewal. A look at former DG&IGP's chequered career can be read here.",
        "source": "www.deccanherald.com",
        "keywords": [
            "cyber",
            "fraud",
            "victim",
            "shady",
            "dealings"
        ],
        "published_date": "2025-04-21",
        "published_time": "03:25:00",
        "rss_source": "United States"
    },
    {
        "title": "Bianca Gonzalez warns viewers vs threatening comments on housemates - GMA Network",
        "url": "https://www.gmanetwork.com/news/showbiz/chikaminute/943317/pinoy-big-brother-bianca-gonzalez-threatening-comments-housemates/story/",
        "text_hash": "03696829b48376352b24d2dfdb29a0b63833f87620e6f7e2cffd1e024560240c",
        "summary": "Bianca Gonzalez has a short message for the viewers of \"Pinoy Big Brother: Celebrity Collab Edition\" On Sunday's episode of the show, the PBB host warned viewers over some offensive remarks made against the current and former PBB housemates. Bianca said that these types of comments can count as cyber libel. The reality show airs new episodes on GMA Network at 10 p.m. on weekdays and 6:15 p.M. on weekends. The duos of Dustin-Ralph, Michael-Emilio and Brent-Vince were nominated for eviction.",
        "source": "www.gmanetwork.com",
        "keywords": [
            "uulitin",
            "namin",
            "cyber",
            "libel",
            "criminal"
        ],
        "published_date": "2025-04-21",
        "published_time": "00:51:17",
        "rss_source": "United States"
    },
    {
        "title": "CW Innovation Awards: Transforming cyber security with AI | Computer Weekly",
        "url": "https://www.computerweekly.com/news/366622833/CW-Innovation-Awards-Transforming-cyber-security-with-AI",
        "text_hash": "4e25f55c8817726e2606fe13c699458e538459408077ebaa1e1bf688de022c6b",
        "summary": "Hong Kong-based Citic Telecom International CPC faced growing pressure to protect its IT assets. Traditional penetration testing, though essential, was costly and required cyber security expertise. TrustCSI AI Pentest automates penetration testing processes, making them faster, more accurate, and accessible to non-experts. Each outsourced penetration test for one system used to be HK$20,000 (US$2,571), and penetration testing for 20 critical systems per year amounts to around HK$400,000.",
        "source": "www.computerweekly.com",
        "keywords": [
            "facing",
            "rising",
            "cyber",
            "threats",
            "shortage"
        ],
        "published_date": "2025-04-21",
        "published_time": "00:13:54",
        "rss_source": "United States"
    },
    {
        "title": "As AI Threats Grow, Wyoming Gets A Certified Cyber Defense Training Center",
        "url": "https://cowboystatedaily.com/2025/04/20/as-ai-threats-grow-wyoming-gets-a-certified-cyber-defense-training-center/",
        "text_hash": "c4b5c24e928281a9ea0c650be52d2de11fdf3d9ca596d394813fd562814c8802",
        "summary": "Laramie County Community College has been designated as a National Center of Academic Excellence in Cyber Defense. LCCC is the only institution in Wyoming to hold the designation. To receive the designation, programs must align with the work of either the DOD, CIA, FBI or other federal organizations that are protecting U.S. cyber infrastructure. The certification comes as artificial intelligence offers more challenges with cybersecurity. It's a win for the entire campus, our students and the broader community, says Dan McIntosh, Information Technology Pathway coordinator.",
        "source": "cowboystatedaily.com",
        "keywords": [
            "laramie",
            "county",
            "community",
            "college",
            "institution"
        ],
        "published_date": "2025-04-20",
        "published_time": "23:08:22",
        "rss_source": "United States"
    },
    {
        "title": "Protected NHIs: Key to Cyber Resilience - Security Boulevard",
        "url": "https://securityboulevard.com/2025/04/protected-nhis-key-to-cyber-resilience/",
        "text_hash": "56b3187f9a46fc478505b37e3c5dff875a7e33b646dd39f3afd0a63335fbe348",
        "summary": "Protected Non-Human Identities (NHIs) have become a crucial factor for organizations looking to strengthen their cybersecurity framework. These identities protect the system from unauthorized access, reducing the threat of data breaches and enhancing an organization’s cyber resilience. Management of protected NHIs isn’t simply about creating and deploying these machine identities. It is an ongoing process that encompasses numerous stages, including discovery, classification, monitoring, threat detection and decommissioning. A comprehensive NHI management platform can provide insights into ownership, permissions, usage patterns, and potential vulnerabilities.",
        "source": "securityboulevard.com",
        "keywords": [
            "essence",
            "these",
            "identities",
            "protect",
            "system"
        ],
        "published_date": "2025-04-20",
        "published_time": "22:19:20",
        "rss_source": "United States"
    },
    {
        "title": "Digital Defenses Raised as Global Tensions Raise Threat of Cyberwarfare",
        "url": "https://broadbandbreakfast.com/digital-defenses-raised-as-global-tensions-raise-threat-of-cyberwarfare/",
        "text_hash": "510fc98c5b16520c64de4a8e633ffc1545559452f4ae3e0bf0f68159cf2358df",
        "summary": "Experts warn of heightened cyberthreats and a growing digital arms race. A cyberattack could cause significant economic damage, disrupt vital public systems. Many in the U.S. are already calling for a more muscular approach to protecting the digital frontier. “Hybrid war is here to stay,” said Tom Kellermann, senior vice president of cyberstrategy at Contrast Security, a cybersecurity firm. ‘We need to stop playing defense — it’s time to make them play defense,’ he said.",
        "source": "broadbandbreakfast.com",
        "keywords": [
            "cyber",
            "experts",
            "warning",
            "heightened",
            "cyberthreats"
        ],
        "published_date": "2025-04-20",
        "published_time": "20:07:27",
        "rss_source": "United States"
    },
    {
        "title": "The Impact of AI Regulations on Cybersecurity Strategy",
        "url": "https://cybersecuritynews.com/ai-regulations-on-cybersecurity/",
        "text_hash": "769bdb2c0c03ae3a338a9dfbfd3475c661e46e5d268046e096e1fbdfdc674015",
        "summary": "AI regulations are emerging worldwide, aiming to address ethical concerns, data privacy, and security risks associated with advanced machine learning systems. For cybersecurity leaders, understanding and adapting to these evolving regulations is not just a compliance exercise it is a strategic imperative. The intersection of AI and regulation is reshaping how organizations approach risk management, innovation, and operational resilience in the digital age. The challenge lies in balancing the need for innovation with the necessity of compliance. This requires close collaboration between legal, technical and operational teams to ensure that AI-enabled cybersecurity solutions are both effective and compliant.",
        "source": "cybersecuritynews.com",
        "keywords": [
            "failure",
            "result",
            "legal",
            "penalties",
            "reputational"
        ],
        "published_date": "2025-04-20",
        "published_time": "19:58:58",
        "rss_source": "United States"
    },
    {
        "title": "Mapping The Cyber Kill Chain Using Correlated Security Logs And Timeline Tools",
        "url": "https://cybersecuritynews.com/mapping-the-cyber-kill-chain-using-correlated-security-logs-and-timeline-tools/",
        "text_hash": "2cf6677801361e6afcf3eb22f0eb5a80ba3e07e9892a19237d7c5a69add620f0",
        "summary": "The cyber kill chain has become a foundational model for understanding, detecting, and responding to complex cyberattacks. Originally developed by Lockheed Martin, this framework breaks down an attack into a series of distinct stages. Each stage represents a unique opportunity for defenders to detect and disrupt the attack. By visualizing attacks in this way, security teams can better anticipate threats, deploy targeted defenses, and respond more effectively when incidents occur. The seven stages are reconnaissance, weaponization, delivery, exploitation, installation, command and control, and actions on objectives.",
        "source": "cybersecuritynews.com",
        "keywords": [
            "cyber",
            "chain",
            "become",
            "foundational",
            "model"
        ],
        "published_date": "2025-04-20",
        "published_time": "19:58:57",
        "rss_source": "United States"
    },
    {
        "title": "TikToker Samiya Hijab's response surfaces after her private video goes viral",
        "url": "https://www.aiknewshd.tv/2504200024-tiktoker-samiya-hijabs-response-surfaces-after-her-private-video-goes-viral",
        "text_hash": "c647ab93c94e055741ee574af3db6bde8fac96c3e2c6c0ff10257e773769781f",
        "summary": "Samiya Hijab, 23, has come out to refute any link to the video. She claims that the video is doctored and AI-produced. She has vowed to take her opponents to task through the legal process and intimated her intent to lodge an official complaint at the Federal Investigation Agency (FIA) Cyber Crime Wing. The TikTok sensation requested her fans not to give credit to \"baseless and false\" material that is being posted on the web, calling on support at this time.",
        "source": "www.aiknewshd.tv",
        "keywords": [
            "cyber",
            "crime",
            "matter",
            "legally",
            "complaint"
        ],
        "published_date": "2025-04-20",
        "published_time": "23:05:46",
        "rss_source": "Germany"
    },
    {
        "title": "Hawk Eye: Open-source scanner uncovers secrets and PII across platforms",
        "url": "https://www.helpnetsecurity.com/2025/04/21/hawk-eye-open-source-scanner/",
        "text_hash": "9c8ec2338f1b0b89506bea557c86685c175e34125f5bdf1c5ffec4b0345917e3",
        "summary": "Hawk Eye is an open-source tool that helps find sensitive data before it leaks. It runs from the command line and checks many types of storage for PII and secrets: passwords, API keys, and personal information. It supports 350+ file types (including videos, images, and documents), uses advanced OCR, and ensures complete data privacy by running entirely on-prem. It works across a wide range of sources: S3 buckets, databases, messaging apps like Slack, file systems, and cloud platforms like Google Drive.",
        "source": "www.helpnetsecurity.com",
        "keywords": [
            "subscribe",
            "security",
            "monthly",
            "newsletter",
            "informed"
        ],
        "published_date": "2025-04-21",
        "published_time": "05:35:00",
        "rss_source": "United States"
    },
    {
        "title": "FOG Ransomware Spread by Cybercriminals Claiming Ties to DOGE | Trend Micro (US)",
        "url": "https://www.trendmicro.com/en_us/research/25/d/fog-ransomware-concealed-within-binary-loaders-linking-themselve.html",
        "text_hash": "7fe685fffc5b1e8fe3092e377647570f00bec20f87c0df37cdb7ee82dac5d59c",
        "summary": "FOG ransomware is being distributed by cybercriminals trolling users by abusing the name of the Department of Government Efficiency (DOGE), or individuals connected to the government initiative. A total of nine samples were uploaded to VirusTotal between March 27 and April 2. FOG ransomware has had 100 victims since January this year; with the most victim counts in February at 53. The group declared 18 and 29 victims in January and March respectively. They also declared in their leak site that their victims come from the technology, education, manufacturing and transportation sectors. Other victim sectors include business services, healthcare, retail, and consumer services.",
        "source": "www.trendmicro.com",
        "keywords": [
            "trend",
            "vision",
            "enterprise",
            "cybersecurity",
            "platform"
        ],
        "published_date": "2025-04-21",
        "published_time": "04:40:59",
        "rss_source": "United States"
    },
    {
        "title": "As Trump Shifts Cybersecurity to States, Many Aren't Ready - Governing Magazine",
        "url": "https://www.governing.com/infrastructure/as-trump-shifts-cybersecurity-to-states-many-arent-ready",
        "text_hash": "ebe2e758a032f8ff88a514cd90e91e1ef155c1de3d0cc05df96cbb1253126d07",
        "summary": "As Trump Shifts Cybersecurity to States, Many Aren't Ready - Governing Magazine. States and local communities are facing a rise in cyberthreats. They include threats to critical infrastructure, increased activity from foreign actors. But the Trump order and federal funding cuts, a shortage of IT experts at the local level and an overall lack of preparedness could weaken their efforts, experts say.. In 2023, of the 48 states that participated in the Nationwide Cybersecurity Review, only 22 states reached or surpassed the recommended levels of security in their systems.",
        "source": "www.governing.com",
        "keywords": [
            "protecting",
            "critical",
            "infrastructure",
            "water",
            "treatment"
        ],
        "published_date": "2025-04-21",
        "published_time": "04:04:32",
        "rss_source": "United States"
    },
    {
        "title": "The Quiet Cybersecurity Revolution: How Scribe Brought Real-Time Risk Visibility to a ...",
        "url": "https://www.techtimes.com/articles/310064/20250420/quiet-cybersecurity-revolution-how-scribe-brought-real-time-risk-visibility-global-enterprise.htm",
        "text_hash": "9c5435596477b107c618518c1fdd2c15b2bf892bbbe69ddc57a402b2fc742f5e",
        "summary": "Scribe Security provides real-time analysis of software artifacts throughout the development lifecycle. The company's technology was deployed across the enterprise's CI/CD pipelines to generate high-accuracy Software Bills of Materials (SBOMs) Scribe's policy engine allowed for risk scoring and automated gating based on security conditions. For example, a build older than 30 days or containing critical vulnerabilities could be flagged—or automatically blocked—before reaching production. The firm reported a 40% reduction in time spent preparing for audits, thanks to machine-readable attestations and automated SBOM generation.",
        "source": "www.techtimes.com",
        "keywords": [
            "company",
            "sprawling",
            "network",
            "development",
            "pipelines"
        ],
        "published_date": "2025-04-21",
        "published_time": "02:14:35",
        "rss_source": "United States"
    },
    {
        "title": "The Rise of Job-Ready Entry-Level Cybersecurity Credentials - Tech Times",
        "url": "https://www.techtimes.com/articles/310062/20250420/rise-job-ready-entry-level-cybersecurity-credentials.htm",
        "text_hash": "3243b093eb97e8668f8b500c25527fd912c66c57557655627f02231624a518ae",
        "summary": "Cybersecurity is no longer a niche field; it's a critical function of every modern organization. As the demand for skilled professionals continues to surge, so does the need for clear, credible entry points into the industry. In response, a new generation of entry-level certifications is emerging to simulate job environments and cultivate real-world readiness. The World Economic Forum's Future of Jobs Report 2025 affirms this shift, stating that 23% of jobs globally are expected to change in the next five years.",
        "source": "www.techtimes.com",
        "keywords": [
            "cybersecurity",
            "longer",
            "niche",
            "field",
            "critical"
        ],
        "published_date": "2025-04-21",
        "published_time": "01:54:37",
        "rss_source": "United States"
    },
    {
        "title": "Hackers are turning DNA sequencing into a biosecurity nightmare",
        "url": "https://www.thebrighterside.news/post/hackers-are-turning-dna-sequencing-into-a-biosecurity-nightmare/",
        "text_hash": "914adbf5b9b0c32fc3be5449876f24cfbb5cc3b14a819d6be9447263e772c76f",
        "summary": "Genomic data is one of the most personal forms of data we have. Hackers could use combined genetic and diagnostic data to identify individuals, exploit genetic vulnerabilities, or manipulate sensitive health records. Research into securing genetic data remains fragmented, often focusing only on narrow areas like microbial sequencing or software systems. This gap makes systems vulnerable to attacks at every stage—from initial DNA collection to data storage and analysis. “Our work is a wake-up call,\" said Dr. Nasreen Anjum, the study's lead author.",
        "source": "www.thebrighterside.news",
        "keywords": [
            "explore",
            "rising",
            "cybersecurity",
            "threats",
            "facing"
        ],
        "published_date": "2025-04-21",
        "published_time": "01:20:53",
        "rss_source": "United States"
    },
    {
        "title": "Top APAC firms recognised at innovation awards - Computer Weekly",
        "url": "https://www.computerweekly.com/news/366622876/Top-APAC-firms-recognised-at-innovation-awards",
        "text_hash": "93d39e055b7215cc7f70b321b63f11f202ed32e30e03506796a473c2ff4bbc61",
        "summary": "Citic Telecom International CPC developed an AI-powered penetration testing tool to automate security audits and reduce costs. Other APAC firms such as DBS Bank and CapitaLand Investment across the region were also recognised for their efforts to improve productivity, customer experience and business processes. Each project was assessed based on its business impact and value, innovation in solving a business problem and change management, which is instrumental to the success of any digital transformation initiative.Here are the winning entries: cyber security with AI, SAP revamp and finding revenue gains from parked cars.",
        "source": "www.computerweekly.com",
        "keywords": [
            "security",
            "shortage",
            "cyber",
            "experts",
            "further"
        ],
        "published_date": "2025-04-21",
        "published_time": "00:13:55",
        "rss_source": "United States"
    },
    {
        "title": "Sharjah Cyber Security Centre, Fortinet Inc. forge strategic partnership - The Tribune",
        "url": "https://www.tribuneindia.com/news/world/sharjah-cyber-security-centre-fortinet-inc-forge-strategic-partnership/",
        "text_hash": "e62c400367476762d0049c24926d55769b67889062b424d82cde89c8c116210d",
        "summary": "Sharjah Cyber Security Centre, Fortinet Inc. forge strategic partnership. The agreement aims to reinforce cooperation in ICT security and enhance national capabilities in addressing cyber threats. Both parties aim to enhance institutional capabilities and advance national digital resilience through skill-building, shared expertise, and strategic collaboration. The partnership also includes access to Fortinet. Inc.'s NSE training materials, advisory support for incident response, and joint efforts in gap assessments, enterprise networking, cloud security, and digital forensics.",
        "source": "www.tribuneindia.com",
        "keywords": [
            "sharjah",
            "strategic",
            "efforts",
            "strengthen",
            "cybersecurity"
        ],
        "published_date": "2025-04-20",
        "published_time": "23:27:28",
        "rss_source": "United States"
    },
    {
        "title": "Grid Modernization Only Succeeds With Strong Cybersecurity - HackerNoon",
        "url": "https://hackernoon.com/grid-modernization-only-succeeds-with-strong-cybersecurity",
        "text_hash": "388124e6af081b5420b13df21e4315a9772ca358e684d45bda4aa90aee660889",
        "summary": "Grid Modernization Only Succeeds With Strong Cybersecurity - HackerNoon. Modernization is vital because America’s electrical infrastructure is old. Most circuit breakers and transmission lines were last updated in the 1960s and 1970s. If a cybercriminal were to cause rolling blackouts or shut down the power grid entirely, untold damage could occur. Are current cybersecurity measures enough to protect power infrastructure during grid modernization is the question on experts’ minds. The older the unit is, the more vulnerable it is to tampering.",
        "source": "hackernoon.com",
        "keywords": [
            "however",
            "digitalization",
            "comes",
            "cyber",
            "threats"
        ],
        "published_date": "2025-04-20",
        "published_time": "22:12:15",
        "rss_source": "United States"
    },
    {
        "title": "Biitland.com Crypto Platform Review: Safe or Risky Investment? - Indonewyork.com",
        "url": "https://indonewyork.com/us-news/biitland-com-crypto-platform-review-safe-or-risky-investment.html",
        "text_hash": "893f2676f1fe02b32d3c6d0a6e3011fc701c71a86289bcb72e07438efba9b5af",
        "summary": "Biitland.com is a comprehensive cryptocurrency platform that offers a range of services including trading, investment, and secure wallet functionalities. By understanding its core offerings, users can better assess both the reliability and potential risks associated with the platform. The platform aims to cater to both novice and experienced traders, making it a versatile choice in the ever-evolving crypto landscape. It offers a mobile-friendly interface, allowing users to trade on the go, which is essential for those who prefer managing their investments from their smartphones. It supports a wide variety of cryptocurrencies, allowing investors to diversify their portfolios effectively.",
        "source": "indonewyork.com",
        "keywords": [
            "these",
            "audits",
            "performed",
            "independent",
            "cybersecurity"
        ],
        "published_date": "2025-04-21",
        "published_time": "00:11:51",
        "rss_source": "Germany"
    },
    {
        "title": "Syria : EU entrusts ex-Lebanese spymaster with security in Syria - Intelligence Online",
        "url": "https://www.intelligenceonline.com/corporate-intelligence/2025/04/21/eu-entrusts-ex-lebanese-spymaster-with-security-in-syria,110436873-art",
        "text_hash": "d9542a51af77c0bb8757a8fd8252ae5f9038ea1a6318089f19927d60a9ae8e31",
        "summary": "You can choose which cookies you accept to have stored on your device. You can change these settings at any time by going to our Cookie management page. Intelligence Online uses cookies to provide reliable and secure features, measure and analyse website traffic and provide support to the website users. Either “Accept and close” to agree to all cookies or go to “Manage cookies’ to review your options.",
        "source": "www.intelligenceonline.com",
        "keywords": [
            "lebanese",
            "former",
            "local",
            "intelligence",
            "chief"
        ],
        "published_date": "2025-04-21",
        "published_time": "04:01:14",
        "rss_source": "England"
    },
    {
        "title": "CISA issues guidance amid unconfirmed Oracle Cloud breach",
        "url": "https://www.cloudcomputing-news.net/news/cisa-issues-guidance-amid-unconfirmed-oracle-cloud-breach/",
        "text_hash": "34a420e7dc575deb612f60b6b2bb0db4484955481c6b48164f62fa02c59c94c6",
        "summary": "CISA issues guidance amid unconfirmed Oracle Cloud breach. CISA’s guidance highlights the danger of credential material being embedded in scripts, automation tools, or infrastructure templates. This advisory follows claims made in recent weeks about a large-scale breach involving up to 6 million records and as many as 140,000 Oracle tenants. Oracle has publicly denied any compromise of its Oracle Cloud Infrastructure (OCI) and maintains that customer data has not been affected. Despite these denials, the company hasn’t issued formal guidance or a public advisory outlining next steps.",
        "source": "www.cloudcomputing-news.net",
        "keywords": [
            "security",
            "cybersecurity",
            "infrastructure",
            "agency",
            "urging"
        ],
        "published_date": "2025-04-21",
        "published_time": "02:02:22",
        "rss_source": "England"
    },
    {
        "title": "\"We need a new sheriff for the AI Wild West\": 1on1 with Elad Schulman, CEO of Lasso",
        "url": "https://forbes.co.il/e/we-need-a-new-sheriff-for-the-ai-wild-west-1on1-with-elad-schulman-ceo-of-lasso-forbes-israel-ai-michael-matias/",
        "text_hash": "3cf271813b9b1f28aae82f717f264265785112de8b52ad2375b7880a11a5b61a",
        "summary": "The arrival of Generative AI marks perhaps the fastest and most dramatic technological change we’ve ever experienced. Elad Schulman, CEO and Co-Founder of Lasso, reinforced my understanding that organizations must rapidly adapt to this new reality. “We are not just creating another security tool but an entire platform enabling organizations to adopt AI safely,” he said. Michael Matias is CEO and co-founder of Clarity, an AI-powered cybersecurity startup backed by venture capital firms Bessemer and Mimecast.",
        "source": "forbes.co.il",
        "keywords": [
            "before",
            "founding",
            "clarity",
            "matias",
            "studied"
        ],
        "published_date": "2025-04-20",
        "published_time": "12:09:27",
        "rss_source": "Israel"
    },
    {
        "title": "In collaboration with the UAE Cyber Security Council and GISEC 2025, emt to ... - TechBullion",
        "url": "https://techbullion.com/in-collaboration-with-the-uae-cyber-security-council-and-gisec-2025-emt-to-present-cyber-escape-room-experience/",
        "text_hash": "2dc476b05bb312bb83cedbd18a77a455fa6e77ee1d9f944bfa5a0b94358848df",
        "summary": "emt, a leading innovator in cybersecurity solutions and services, in association with the UAE Cyber Security Council, are excited to announce their participation in the upcoming GISEC 2025 exhibition. The 2nd edition of the exclusive and immersive “Cyber Escape Experience” will be held at the Dubai World Trade Centre. This thrilling and interactive experience will challenge participants to solve cybersecurity-related puzzles and scenarios in a race against time, testing their knowledge of the latest security practices and innovations. emt’s CEO, Mo Mobasseri, said: “The Cyber Escape Experience offers a powerful and engaging way to highlight the critical importance of cybersecurity”",
        "source": "techbullion.com",
        "keywords": [
            "cyber",
            "experience",
            "security",
            "council",
            "gisec"
        ],
        "published_date": "2025-04-21",
        "published_time": "07:07:59",
        "rss_source": "United States"
    },
    {
        "title": "CyberArk unveils identity security solution to secure AI agents at scale - FutureCIO",
        "url": "https://futurecio.tech/cyberark-unveils-identity-security-solution-to-secure-ai-agents-at-scale/",
        "text_hash": "79dec6eb33803dbb447e9fd1032fae671e25efee247b195b8894e3a48564fe6b",
        "summary": "CyberArk unveils identity security solution to secure AI agents at scale. CyberArk Secure AI Agents Solution aims to enable organisations to implement identity-first security for agentic AI using the CyberArk Identity Security Platform. The solution offers a comprehensive approach, leveraging the Cyber Ark Identity Security platform's intelligent privilege controls to secure the full spectrum of identities across every environment, matching the pace of innovation inherent to an organisation's agentic workforce. It claims to provide:. Scalability and automation of machine identity security;. The ability to secure agents on day one by combining the principles of human identity security with the scalability and. automation ofMachine identity security.",
        "source": "futurecio.tech",
        "keywords": [
            "cyberark",
            "organisations",
            "model",
            "secure",
            "future"
        ],
        "published_date": "2025-04-21",
        "published_time": "07:04:15",
        "rss_source": "United States"
    },
    {
        "title": "Two ways AI hype is worsening the cybersecurity skills crisis | CSO Online",
        "url": "https://www.csoonline.com/article/3958818/two-ways-ai-hype-is-worsening-the-cybersecurity-skills-crisis.html",
        "text_hash": "86f75f894fc83759801e631cad32613a5dab3e44524021762c5a5d2b9336b0fd",
        "summary": "Gartner: 98% of organizations have already adopted or are planning to adopt generative AI or another form of AI. Only 1% plan not to adopt AI, and the other 1% is not sure. Security professionals are being expected to govern their organisation’s AI use while also figuring out how to integrate the technology into their own workflows, often without proper training. The result? Overstretched teams, mounting pressure, and an ever-widening skills gap, says Richard Addiscott, VP analyst at Gartner.",
        "source": "www.csoonline.com",
        "keywords": [
            "despite",
            "these",
            "growing",
            "pressures",
            "faced"
        ],
        "published_date": "2025-04-21",
        "published_time": "06:34:51",
        "rss_source": "United States"
    },
    {
        "title": "The nine lives of the FFIEC cyber assessment tool | ABA Banking Journal",
        "url": "https://bankingjournal.aba.com/2025/04/the-nine-lives-of-the-ffiec-cyber-assessment-tool/",
        "text_hash": "610233a6413d1c1dc10d94eb22dd1ff6898f13f0cf9eeda0b13c8c14910b0db1",
        "summary": "The Federal Financial Institutions Examination Council released the first version of its Cybersecurity Assessment Tool, or CAT. Last year, the FFIEC announced it would sunset the CAT in August 2025. Regulators assert that demonstrating compliance with regulatory expectations is voluntary. As the countdown accelerates to CAT sunset, banks are evaluating recommended replacements. The CRI Profile is managed by a non-profit organization that developed through collaborative work of ABA, Bank Policy Institute/BITS and Financial Services Sector Coordinating Council.",
        "source": "bankingjournal.aba.com",
        "keywords": [
            "cyber",
            "security",
            "institute",
            "profile",
            "center"
        ],
        "published_date": "2025-04-21",
        "published_time": "08:15:29",
        "rss_source": "United States"
    },
    {
        "title": "Cyber-risks in the water sector: modernise and segment to protect yourself - Stormshield",
        "url": "https://www.stormshield.com/news/cyber-risks-in-the-water-sector-modernise-and-segment-to-protect-yourself/",
        "text_hash": "277a69463063003fb4eda7a4b2db7e5fe77b2af5b1877e26e9fbb6d47574bdeb",
        "summary": "At least 31 compromises affecting players in the water sector in France have been examined by ANSSI since 2021, warning of clear vulnerabilities in water and wastewater services. European NIS2 directive is expected to require organisations to put in place enhanced governance, defence, protection and resilience measures in the face of cyber-threats. The industry should progressively adopt more secure solutions, while integrating cybersecurity principles into every stage of operations. This implies a continuous effort to modernise infrastructures and regularly update systems. Infrastructure operators and managers require training in good cybersecurity practices so that they can respond effectively.",
        "source": "www.stormshield.com",
        "keywords": [
            "water",
            "sector",
            "facing",
            "increasingly",
            "complex"
        ],
        "published_date": "2025-04-21",
        "published_time": "08:05:29",
        "rss_source": "United States"
    },
    {
        "title": "A billion dollar scam: UN warns of 'cancer' of cyber crime as Southeast Asian syndicates go global",
        "url": "https://www.firstpost.com/world/a-billion-dollar-scam-un-warns-of-cancer-of-cyber-crime-as-southeast-asian-syndicates-go-global-13881663.html",
        "text_hash": "c7f5cd049536cba4f0c12b1b5a9f8f7f4409e9f3775ff10a3342e90cbe6378dc",
        "summary": "Criminal networks that emerged in Southeast Asia in recent years have evolved into a sophisticated global industry, the United Nations says. “It spreads like a cancer,” said John Wojcik, a regional analyst for UNODC. Conservative estimates indicate there are hundreds of large-scale scam farms around the world generating tens of billions of dollars in annual profits, the UN says. The United States alone reported more than $5.6 billion in losses to cryptocurrency scams in 2023, including $4 million in pig-butchering scams.",
        "source": "www.firstpost.com",
        "keywords": [
            "criminal",
            "networks",
            "emerged",
            "southeast",
            "recent"
        ],
        "published_date": "2025-04-21",
        "published_time": "08:00:08",
        "rss_source": "United States"
    },
    {
        "title": "Leveraging AI in the UK public sector - Open Access Government",
        "url": "https://www.openaccessgovernment.org/leveraging-ai-in-the-uk-public-sector/191091/",
        "text_hash": "e6aa19934f91b782a9351a4c16549c43d504969be81372d50c8abe708f2bf856",
        "summary": "Simon Dobbs, Director of Technology at Bytes Software Services, explains how to leverage artificial intelligence in the UK public sector effectively. The UK Government recently announced plans to put artificial intelligence (AI) at the forefront of their strategy. For AI to excel and flourish, the public and private sectors need to work together to deliver on the promise of AI and transform how we work and live. There are five key areas to consider to ensure your project succeeds. Data quality using the right data. Synthetic data can be a valuable resource in scenarios where real data is scarce.",
        "source": "www.openaccessgovernment.org",
        "keywords": [
            "security",
            "identification",
            "protection",
            "always",
            "important"
        ],
        "published_date": "2025-04-21",
        "published_time": "09:01:48",
        "rss_source": "England"
    },
    {
        "title": "Report: Cybersecurity tops tariffs as Q1 priority for supply chains - DIGIT",
        "url": "https://www.digit.fyi/report-cybersecurity-tops-tariffs-as-q1-priority-for-supply-chains/",
        "text_hash": "f06bf402033ab2a85b087ee397b4d52b441eece713044ccbf5c5bf49d2bfa982",
        "summary": "West Monroe's Q1 2025 Supply Chain Poll found that cybersecurity is still the priority for supply chain leaders. 91% of firms are confident that their business can withstand current market volatility. 98% of companies have integrated AI into their operations, with more than three-quarters using it for inventory management and demand forecasting. Less than half (44%) of supply chains said they are using emerging tech for workforce planning, and, surprisingly, even fewer (43%) are using AI for logistics and transportation routing.",
        "source": "www.digit.fyi",
        "keywords": [
            "despite",
            "tariff",
            "tension",
            "cybersecurity",
            "priority"
        ],
        "published_date": "2025-04-21",
        "published_time": "08:55:54",
        "rss_source": "England"
    },
    {
        "title": "AWS security compliance made easy: IT-Magic's DevOps Solutions for a stronger security posture",
        "url": "https://www.londondaily.news/aws-security-compliance-made-easy-it-magics-devops-solutions-for-a-stronger-security-posture/",
        "text_hash": "4dbdcca1046c94b83689076b7e8dfab73515298ec07c30b0e6c7466eaf23c571",
        "summary": "AWS operates under a shared responsibility model, where AWS is responsible for the security of the cloud. IT-Magic helps businesses fulfil their responsibilities effectively by leveraging AWS’s robust security features and compliance certifications. It addresses these challenges by combining comprehensive security audits with DevOps practices to automate compliance efforts. For businesses seeking expert assistance with these tools and broader DevOps implementations, consider exploring the services offered at https://itmagic.pro/services/aws-devops.‘Proactively address vulnerabilities with continuous monitoring and automated remediation strategies’",
        "source": "www.londondaily.news",
        "keywords": [
            "today",
            "world",
            "security",
            "compliance",
            "paramount"
        ],
        "published_date": "2025-04-21",
        "published_time": "08:48:15",
        "rss_source": "England"
    },
    {
        "title": "R Street sees opportunity through new request for information to inform cyber regulatory ...",
        "url": "https://insidecybersecurity.com/daily-news/r-street-sees-opportunity-through-new-request-information-inform-cyber-regulatory",
        "text_hash": "58ff860336369aab53320366fbf3dd56456935008c28673be0f7936792bb99bd",
        "summary": "R Street Institute's Haiman Wong sees opportunity through new request for information to inform cyber regulatory harmonization. A pulse check would be very helpful moving forward before any further direct cutting, streamlining or drastic actions are done, Wong says. Wong is an R Street resident fellow focused on cyber security and regulation. The R Street Institute is based in Washington, D.C. and has offices in New York and Washington, DC.",
        "source": "insidecybersecurity.com",
        "keywords": [
            "subscriber",
            "access",
            "exclusive",
            "analysis",
            "cybersecurity"
        ],
        "published_date": "2025-04-21",
        "published_time": "10:08:58",
        "rss_source": "United States"
    },
    {
        "title": "The Week Ahead: National Security Institute hosts Salt Typhoon event - Inside Cybersecurity",
        "url": "https://insidecybersecurity.com/daily-news/week-ahead-national-security-institute-hosts-salt-typhoon-event-acting-pentagon-cio",
        "text_hash": "ff09be6e02dd18997fee3e6fc9e48f47b4682575e54c1ce0ec45b76526348cf1",
        "summary": "The National Security Institute convenes an event on the fallout from Salt Typhoon and impacts to the communications sector. Performing the Duties of DOD CIO Katie Arrington headlines a luncheon hosted by the Washington, D.C. chapter of the Armed Forces Communications and Electronics Association. House Intelligence ranking member Jim Himes (D-CT) kicks off NSI's Wednesday event on cyber challenges faced by telecom networks.",
        "source": "insidecybersecurity.com",
        "keywords": [
            "house",
            "intelligence",
            "ranking",
            "member",
            "himes"
        ],
        "published_date": "2025-04-21",
        "published_time": "10:08:54",
        "rss_source": "United States"
    },
    {
        "title": "How next-generation firewalls are evolving in a world of AI-enabled cyberattacks",
        "url": "https://www.cybersecuritydive.com/spons/how-next-generation-firewalls-are-evolving-in-a-world-of-ai-enabled-cyberat/745666/",
        "text_hash": "ad973ac0511301b18f195dd4091dfb3b511d3a673f0601cbfa51404cafe0bba7",
        "summary": "The resilience of perimeter security is being put to the test by the growing capabilities of AI-enabled attacks. Some Next-Generation Firewalls (NGFWs) can effectively thwart up to 99% of known threats and can proactively identify anomalies indicative of emerging attack patterns. Traditional firewalls are ill-equipped to safeguard AI infrastructure from emerging, AI-specific threats like prompt injection attacks on AI chatbots or malicious training data ingestion into large language models. A strategically placed firewall in the correct location can be a much better solution than relying on constantly trying to install endpoint agents for comprehensive protection.",
        "source": "www.cybersecuritydive.com",
        "keywords": [
            "vulnerability",
            "alert",
            "screen",
            "symbolizing",
            "cybersecurity"
        ],
        "published_date": "2025-04-21",
        "published_time": "09:58:42",
        "rss_source": "United States"
    },
    {
        "title": "How to Prevent RDP (Remote Desktop Protocol) Attacks? - SentinelOne",
        "url": "https://www.sentinelone.com/cybersecurity-101/threat-intelligence/how-to-prevent-remote-desktop-protocol-attacks/",
        "text_hash": "d74a94e09927026eaff41123f0f5d46c27ace7652e75012b166f2cbcfff60b82",
        "summary": "RDP is a communication connection protocol developed by Microsoft. It lets users control desktop devices remotely (or any device with Microsoft OS) Remote desktop connections use the TCP (Transmission Control Protocol) port 3389 which is the main hub of remote connections. When threat actors compromise its encrypted channels and take over, that’s what we call a remote desktop protocol attack. How to Detect Unauthorized RDP Access: Check your RDP logs to look for signs of odd behaviors or malicious activities. Look for failed login attempts and frequent logins from unrecognizable IP addresses.",
        "source": "www.sentinelone.com",
        "keywords": [
            "businesses",
            "build",
            "trust",
            "network",
            "security"
        ],
        "published_date": "2025-04-21",
        "published_time": "09:45:10",
        "rss_source": "United States"
    },
    {
        "title": "Atrium Health Wake Forest Baptist CEO plans to retire, and more | MED MOVES",
        "url": "https://www.chiefhealthcareexecutive.com/view/atrium-health-wake-forest-baptist-ceo-plans-to-retire-and-more-med-moves",
        "text_hash": "c95fd782bf312cc68c1f9f22292ef6c357d1cde7946ceafd3dc7df5101e482f3",
        "summary": "Dr. Julie A. Freischlag, CEO and chief academic officer of Atrium Health Wake Forest Baptist, is planning to retire. She has been a practicing vascular surgeon for 38 years. OSF HealthCare names CEO for system’s central region Kimberly Russo. Dr. DeAnn Bullock, MD, has been named chief medical officer of Nashville General Hospital. OSF Healthcare's central region includes Peoria, Illinois, and its surrounding communities. She replaces Bob Anderson, who retired in January.",
        "source": "www.chiefhealthcareexecutive.com",
        "keywords": [
            "information",
            "secure",
            "landscape",
            "chief",
            "healthcare"
        ],
        "published_date": "2025-04-21",
        "published_time": "09:29:11",
        "rss_source": "United States"
    },
    {
        "title": "EU Bolsters Cybersecurity With NIS2 Directive - EE Times",
        "url": "https://www.eetimes.com/eu-bolsters-cybersecurity-with-nis2-directive/",
        "text_hash": "bc304a7c7dad1d663de39cf9e1fb845c5e6c35b6b39cb98f84630fba5e44beb7",
        "summary": "The European Union (EU) enacted the Network and Information Systems 2.0 Directive, known as NIS2, in 2022. For the first time, the new version of the directive makes directors and executives accountable, subjecting them to strict penalties. With increasing digitalization and industrial societies’ critical reliance on information systems, the EU views enhanced cybersecurity as a paramount priority. The explicit focus on supply chain cybersecurity is a significant departure from the previous directive. The move comes amid escalating geopolitical tensions and a surge in sophisticated cyber threats.",
        "source": "www.eetimes.com",
        "keywords": [
            "cyber",
            "crisis",
            "management",
            "authorities",
            "single"
        ],
        "published_date": "2025-04-21",
        "published_time": "08:01:48",
        "rss_source": "United States"
    },
    {
        "title": "Countries shore up their digital defenses as global tensions raise the threat of cyberwarfare",
        "url": "https://uk.news.yahoo.com/countries-shore-digital-defenses-global-092001694.html",
        "text_hash": "a63db5a48ff16933dc396ff991dfcb9dcd2369f71ea567e0f61c4e210e96d972",
        "summary": "Experts warn of heightened cybersecurity threats and a digital arms race as countries defend themselves. Businesses in particular are increasingly concerned about cyberattacks. US President Donald Trump has upended America's digital defences by shrinking and firing those at cybersecurity agencies. Each network and connection is a potential target for foreign governments or hacking groups that sometimes do their bidding. The cyberattacks that frighten experts the most burrow deeply into telephone or computer networks, inserting backdoors or malware for later use, such as Volt Typhoon.",
        "source": "uk.news.yahoo.com",
        "keywords": [
            "businesses",
            "particular",
            "increasingly",
            "concerned",
            "about"
        ],
        "published_date": "2025-04-21",
        "published_time": "09:50:41",
        "rss_source": "England"
    },
    {
        "title": "AI – Buzzword, buzz kill or bubble? - Open Access Government",
        "url": "https://www.openaccessgovernment.org/ai-buzzword-buzz-kill-or-bubble/191149/",
        "text_hash": "11700e67e1030d82036c2ff624314bc5ae49fff7affb0368025e941f7f98b899",
        "summary": "AI presents opportunities for increased efficiency and analysing data. But it also raises issues regarding job security and data privacy. The need for human oversight remains critical, Colin Wheeler from Survey Solutions explains. The opportunities with AI seem fabulous, and the potential impact, for good or for ill, seems huge. For companies, there are risks of staff using AI apps and uploading sensitive and confidential data to third-party systems. Human involvement in the process isn’t going away, and nor should it, but making the process more effective.",
        "source": "www.openaccessgovernment.org",
        "keywords": [
            "while",
            "presents",
            "opportunities",
            "efficiency",
            "automating"
        ],
        "published_date": "2025-04-21",
        "published_time": "09:43:45",
        "rss_source": "England"
    },
    {
        "title": "VPNs driving 25% of incident response cases, Sophos finds - DIGIT",
        "url": "https://www.digit.fyi/vpns-driving-25-of-incident-response-cases-sophos-finds/",
        "text_hash": "ed8f7f50fced2af654bec79842eb7094edbd24d34ec9c4c2046349ba752ad95a",
        "summary": "VPNs driving 25% of incident response cases, Sophos finds. Firewalls, virtual private network (VPN) appliances, and other network edge devices acted as the vector for a fourth of all initial compromises in businesses. Small and midsized businesses alike, ransomware and data theft accounted for almost 30% of all managed detection and response incidents tracked by Sophos in 2024. New advancing techniques in social engineering, malware, and initial compromise continue to plague software-as-a-service platforms.",
        "source": "www.digit.fyi",
        "keywords": [
            "security",
            "cybersecurity",
            "driving",
            "incident",
            "response"
        ],
        "published_date": "2025-04-21",
        "published_time": "09:26:25",
        "rss_source": "England"
    },
    {
        "title": "MEXC Announces the Listing of Balance (EPT) with 6,000,000 EPT and 50,000 USDT in Rewards",
        "url": "https://www.itnewsonline.com/PRNewswire/MEXC-Announces-the-Listing-of-Balance-EPT-with-6000000-EPT-and-50000-USDT-in-Rewards/1052550",
        "text_hash": "52a849ab804b6c49fb57a0f5e0a02d846c97d4dfa72c60149004c2b5c20dcbad",
        "summary": "MEXC Announces the Listing of Balance (EPT) with 6,000,000 EPT and 50,000 USDT in Rewards. Balance is an innovative Web3 platform that integrates AI and blockchain technologies to create immersive digital interaction experiences. MEXC has established itself as a leading exchange by consistently offering users early access to high-potential crypto assets. In 2024 alone, the platform listed 2,376 new tokens, including 1,716 initial listings. The listing of EPT opens new investment avenues in the rapidly evolving AI-driven gaming space.",
        "source": "www.itnewsonline.com",
        "keywords": [
            "latest",
            "online",
            "wildberries",
            "launches",
            "sales"
        ],
        "published_date": "2025-04-21",
        "published_time": "09:18:43",
        "rss_source": "England"
    },
    {
        "title": "CSA enhances cybersecurity guidance with cloud, AI, OT additions to certification schemes",
        "url": "https://industrialcyber.co/critical-infrastructure/csa-enhances-cybersecurity-guidance-with-cloud-ai-ot-additions-to-certification-schemes/",
        "text_hash": "e770403f220d1ad9af7d1bdd56f9e8a6fc8454dd7de38685a8fc2161350ece63",
        "summary": "CSA enhances cybersecurity guidance with cloud, AI, OT additions to certification schemes. CSA is assessing the possibility of requiring organizations that are given access to sensitive data to obtain these marks before they can be licensed or bid for government contracts. SMEs can get help with implementing cybersecurity measures aligned to the Cyber Essentials mark from CSA’s Chief Information Security Officer (C ISO) as-a-Service scheme. The CSA offers up to 70 percent co-funding for eligible SMEs to engage cybersecurity consultancy services.",
        "source": "industrialcyber.co",
        "keywords": [
            "cyber",
            "security",
            "agency",
            "singapore",
            "expanded"
        ],
        "published_date": "2025-04-21",
        "published_time": "11:30:05",
        "rss_source": "United States"
    },
    {
        "title": "IBM X-Force reports evolving threat landscape amid shifting tactics, marking rise in stealth ...",
        "url": "https://industrialcyber.co/reports/ibm-x-force-reports-evolving-threat-landscape-amid-shifting-tactics-marking-rise-in-stealth-and-identity-exploits/",
        "text_hash": "803360f73c9a6969c3d32b9466fd423cdd501d85920972878a572c54a4ab282b",
        "summary": "IBM released the 2025 X-Force Threat Intelligence Index, highlighting that cybercriminals continued to pivot to stealthier tactics. Hackers openly trade exploits on the dark web to target critical infrastructure, while ransomware and infostealer operators exfiltrate millions of credentials from enterprises. Despite the magnitude of these challenges, IBM reported that most organizations still don’t have a cyber crisis plan or playbooks for scenarios that require swift responses.“Cybercriminals are most often breaking in without breaking anything – capitalizing on identity gaps overflowing from complex hybrid cloud environments,” Mark Hughes, global managing partner of cybersecurity services at IBM said.",
        "source": "industrialcyber.co",
        "keywords": [
            "organizations",
            "develop",
            "their",
            "cybersecurity",
            "playbooks"
        ],
        "published_date": "2025-04-21",
        "published_time": "11:26:27",
        "rss_source": "United States"
    },
    {
        "title": "5 ways corporate boards can support CISOs in 2025 | SC Media",
        "url": "https://www.scworld.com/perspective/5-ways-corporate-boards-can-support-cisos-in-2025",
        "text_hash": "684f5eeac3e6c83c6aba2209f0a16fbea8f6ebe0c7ef0a7e6a379020b3b4ae87",
        "summary": "A cyberattack can cost thousands, if not millions, in financial damages, disrupt operations, and severely damage a company's brand and reputation. The CISO’s role has become multifaceted, charged with both protecting a company and helping it make good business and product decisions. 82% of CISOs now report directly to CEOs, a dramatic increase from 47% in 2023. Despite this increase in C-suite collaboration, significant gaps remain between CISOs and the boardroom.",
        "source": "www.scworld.com",
        "keywords": [
            "furthermore",
            "cyber",
            "threats",
            "become",
            "complex"
        ],
        "published_date": "2025-04-21",
        "published_time": "11:08:46",
        "rss_source": "United States"
    },
    {
        "title": "Qatar emerges as regional leader in cybersecurity through strategic initiatives",
        "url": "https://thepeninsulaqatar.com/article/21/04/2025/qatar-emerges-as-regional-leader-in-cybersecurity-through-strategic-initiatives",
        "text_hash": "2298e9fd6bb9ef730dd19bd7e7a006cd2d4bdb33a8b3c59b46657cb858c86c90",
        "summary": "Qatar emerges as regional leader in cybersecurity through strategic initiatives. National Cyber Security Strategy 2024-2030 embeds cybersecurity within the broader national development framework. Cybersecurity should be seen as an enabler of Qatar’s strategic frameworks, rather than just a technical control or an optional safeguard, says Amer Bazerbachi, Associate Partner - Advisory at KPMG Doha. The strategy is well aligned with the core pillars of the Qatar National Vision 2030, particularly in the areas of economic and human development.",
        "source": "thepeninsulaqatar.com",
        "keywords": [
            "national",
            "bazerbachi",
            "highlighted",
            "cyber",
            "security"
        ],
        "published_date": "2025-04-21",
        "published_time": "07:36:56",
        "rss_source": "United States"
    },
    {
        "title": "PureSquare: PureVPN Earns VPN Trust Seal Accreditation, Backing Its Longstanding ...",
        "url": "https://www.finanznachrichten.de/nachrichten-2025-04/65162296-puresquare-purevpn-earns-vpn-trust-seal-accreditation-backing-its-longstanding-commitment-to-user-privacy-200.htm",
        "text_hash": "a04b933854212780b53c30204c63f3219fb4f642a37b44b01c4321b9e9f410b2",
        "summary": "PureVPN has received the VPN Trust Seal from i2Coalition's VPN Trust Initiative (VTI) The accreditation reaffirms PureVPN's compliance with independently verified standards for secure operations, privacy protection, and transparent service delivery. A KPMG study found that nearly 86% of the U.S. population considers data privacy an increasing concern. PureVPN empowers its users to navigate the digital landscape safely by encrypting connections, monitoring the dark web, securely storing passwords, preventing third-party tracking, and reclaiming personal data.",
        "source": "www.finanznachrichten.de",
        "keywords": [
            "internet",
            "freedom",
            "expression",
            "information",
            "about"
        ],
        "published_date": "2025-04-21",
        "published_time": "09:04:46",
        "rss_source": "Germany"
    },
    {
        "title": "Bageltechnews: A resource for funds recovery services in the cryptocurrency space",
        "url": "https://www.londondaily.news/bageltechnews-a-resource-for-funds-recovery-services-in-the-cryptocurrency-space/",
        "text_hash": "06a80198aec93f7fcecc54c479e5f540c767ff421dadacfee13b7468a66abf23",
        "summary": "BagelTechNews is a resource for funds recovery services in the cryptocurrency space. The services focus on restitution of lost assets with an emphasis on cryptocurrency recovery. Specialist teams, consisting of experts in finance, cybersecurity professionals, and law enforcement personnel, support the complex recovery process. Recovery services require picking an established organisation because they ensure professional standards. You should focus on services that demonstrate both successful outcomes and satisfied clients, as well as clear methods for recovery. The comprehensive resource provides both asset recovery solutions and teaches users effective cybersecurity measures and asset protection techniques.",
        "source": "www.londondaily.news",
        "keywords": [
            "specialist",
            "teams",
            "consisting",
            "experts",
            "finance"
        ],
        "published_date": "2025-04-21",
        "published_time": "12:03:43",
        "rss_source": "England"
    },
    {
        "title": "Asia-Pacific Post-Quantum Cryptography Market Outlook Report 2024-2034, with Focus on ...",
        "url": "https://uk.finance.yahoo.com/news/asia-pacific-post-quantum-cryptography-112900786.html",
        "text_hash": "c7b1ff19cab8228bef95f3485aa4ec210e11ff64b3d16958be20e39996e0ecdf",
        "summary": "Asia-Pacific Post-Quantum Cryptography Market: Focus on Application, Product, and Country - Analysis and Forecast, 2024-2034. The Asia-Pacific post-quantum cryptography market was valued at $111.1 million in 2024 and is expected to grow at a CAGR of 43.41%, reaching $4.08 billion by 2034. Strong regulatory initiatives, heightened cybersecurity awareness, and partnerships between government agencies, tech companies, and academic institutions are driving the market.",
        "source": "uk.finance.yahoo.com",
        "keywords": [
            "report",
            "profiles",
            "players",
            "cryptography",
            "market"
        ],
        "published_date": "2025-04-21",
        "published_time": "11:33:13",
        "rss_source": "England"
    },
    {
        "title": "UK's Lomond school pioneers Bitcoin payment for tuition The Block - Blockchain News",
        "url": "https://blockchaintechnology-news.com/news/uks-lomond-school-pioneers-bitcoin-payment-for-tuition/",
        "text_hash": "f5c813a49aab20475185890b1dc0c79d1124b77708eedb605a04ae9e7ce57fa2",
        "summary": "UK's Lomond school pioneers Bitcoin payment for tuition. Starting the autumn term of 2025, the Scottish institution will accept cryptocurrency payments through regulated providers CoinCorner and Musqet. The school’s Bitcoin payment initiative includes a carefully managed implementation strategy that addresses risk through phased rollout and currency conversion options. The announcement was made on April 11 at Cheatcode, a national Bitcoin conference featuring prominent industry figures including Cameron and Tyler Winklevoss, co-creators of Gemini, and Alex Gladstein, Chief Strategy Officer at the Human Rights Foundation.",
        "source": "blockchaintechnology-news.com",
        "keywords": [
            "cyber",
            "security",
            "decentralised",
            "finance",
            "payments"
        ],
        "published_date": "2025-04-21",
        "published_time": "10:53:49",
        "rss_source": "England"
    },
    {
        "title": "Data Privacy: The Legal Challenges Of Biometrics (Podcast) - Mondaq",
        "url": "https://www.mondaq.com/uk/privacy-protection/1613124/data-privacy-the-legal-challenges-of-biometrics-podcast",
        "text_hash": "1d87b4d1cc4cd6cc2a51118a305f48280af275368ca2bedbd96889cf66f03496",
        "summary": "Biometric data - like facial recognition and fingerprints - is being used more frequently. But with the UK GDPR and increasing regulatory scrutiny, businesses need to be careful about how they use it. In this podcast, Co-Leaders of the UK Data Protection and Cyber Security practice Loretta Pugh and Jocelyn Paulley break down the legal risks of using biometric data. They look at real-world examples, common issues, and useful tips on managing theLegal risks of biometrics.",
        "source": "www.mondaq.com",
        "keywords": [
            "podcast",
            "protection",
            "cyber",
            "security",
            "practice"
        ],
        "published_date": "2025-04-21",
        "published_time": "10:10:04",
        "rss_source": "England"
    },
    {
        "title": "UWF earns national recognition for cybersecurity outreach initiatives",
        "url": "https://news.uwf.edu/uwf-earns-national-recognition-for-cybersecurity-outreach-initiatives/",
        "text_hash": "1a19d0238e2c832a324e589d2999447e63704bacb5a9494a1a51c3bdea06e23c",
        "summary": "The University of West Florida placed second in the 2024 CAE-CD Community Outreach Award Competition. This is the third consecutive year UWF has placed in the top two out of more than 450 universities and colleges designated as NCAE-C institutions across the U.S. The award was announced at the 24th CAE in Cybersecurity Symposium held in Charleston, South Carolina, on April 8-10. “This recognition reinforces our mission to lead by example and empower others through innovative and impactful outreach,” said Dr. Eman El-Sheikh, associate vice president for the UWF Center for Cybersecurity.",
        "source": "news.uwf.edu",
        "keywords": [
            "cyber",
            "defense",
            "designated",
            "institution",
            "award"
        ],
        "published_date": "2025-04-21",
        "published_time": "13:33:22",
        "rss_source": "United States"
    },
    {
        "title": "Privacy, Cyber & Data Strategy Advisory | Cybersecurity Controls: What Do Regulators ...",
        "url": "https://www.mondaq.com/security/1613538/privacy-cyber-data-strategy-advisory-%7C-cybersecurity-controls-what-do-regulators-expect-nowadays",
        "text_hash": "d8d79e24836dd201b47fd2a28dfb59e481cc89e2faf768c82d3f1a426b0bc608",
        "summary": "At the state and federal levels, regulators expect companies to adopt phishing-resistant multi-factor authentication. Regulators' training requirements are shifting from standard \"off the shelf\" security awareness programs to multifaceted models that include role-based training. Going forward, one of the more challenging enhanced controls for companies is to develop and maintain a comprehensive, up-to-date asset and software inventory. It's important to keep an inventory of your assets, including tracking any end-of-life (EOL) products.",
        "source": "www.mondaq.com",
        "keywords": [
            "become",
            "sophisticated",
            "these",
            "traditional",
            "forms"
        ],
        "published_date": "2025-04-21",
        "published_time": "13:28:21",
        "rss_source": "United States"
    },
    {
        "title": "Senators Introduce Bipartisan Bill to Strengthen Cybersecurity - The Cyber Express",
        "url": "https://thecyberexpress.com/senators-introduce-bipartisan-bill/",
        "text_hash": "0a8104814fa17eca174829a2082b75cbdbd919650fc6abf85f4a5935bc13a883",
        "summary": "U.S. Senators Gary Peters (D-MI) and Mike Rounds (R-SD) have introduced a bipartisan bill to extend vital provisions from the Cybersecurity Information Sharing Act of 2015. The legislation seeks to maintain and strengthen information-sharing mechanisms between the private sector and the federal government, particularly through the Department of Homeland Security. Since its inception, the legislation has helped uncover and mitigate major cyber incidents, including the high-profile SolarWinds attack, as well as ongoing campaigns like Volt Typhoon and Salt Typhoon.",
        "source": "thecyberexpress.com",
        "keywords": [
            "homepage",
            "cyber",
            "senators",
            "peters",
            "rounds"
        ],
        "published_date": "2025-04-21",
        "published_time": "13:26:32",
        "rss_source": "United States"
    },
    {
        "title": "Credential theft outpaces ransomware as cyber threat landscape evolves, report claims",
        "url": "https://www.techmonitor.ai/technology/cybersecurity/credential-theft-outpaces-ransomware-ibm-report",
        "text_hash": "d5af38fb318211e08597d42108b1f7ce7c419e11508788e0747d454480023288",
        "summary": "IBM X-Force 2025 Threat Intelligence Index reveals 84% increase in use of infostealers delivered via email in 2024 compared to the previous year. Data exfiltration has become a prevailing tactic among cybercriminals, with 18% favouring this approach over encryption. Asia and North America are the regions most frequently targeted by cyberattacks, together accounting for nearly 60% of global incidents. The manufacturing sector has continued to be the most affected industry for the fourth consecutive year, largely due to its low tolerance for operational downtime.",
        "source": "www.techmonitor.ai",
        "keywords": [
            "cybercriminals",
            "increasingly",
            "employing",
            "stealthier",
            "tactics"
        ],
        "published_date": "2025-04-21",
        "published_time": "13:05:46",
        "rss_source": "United States"
    },
    {
        "title": "Natrona County Road & Weather Report: Clear Roads With a Chance of Rain (4/21/25)",
        "url": "https://k2radio.com/ixp/147/p/natrona-county-road-weather-report-clear-roads-with-a-chance-of-rain-42125/",
        "text_hash": "435fbefd42d5613a2081f30539c95ca68f5441555ec67d93519a78e0a6eeea80",
        "summary": "The Wyoming Department of Transportation is reporting clear conditions in and around the city. Thunderstorm development possible by mid afternoon across the Bighorn Basin but no significant impacts are expected. The high will hover around 55°, with the low this evening estimated around 33°. There is a road closures: District 1 (Southeast) - I80: The Summit Rest Area is closed until further notice near Laramie at milepost 323. There are no current road restrictions for Casper or the rest of Wyoming.",
        "source": "k2radio.com",
        "keywords": [
            "cyber",
            "attack",
            "pilot",
            "jarred",
            "smith"
        ],
        "published_date": "2025-04-21",
        "published_time": "12:52:51",
        "rss_source": "United States"
    },
    {
        "title": "Implement the EU Cyber Resilience Act's Requirements to Strengthen Your Software Project",
        "url": "https://www.infoq.com/podcasts/cyber-act-strengthen-software-project/",
        "text_hash": "9a07a10c01471c40e1c960fdcc7d8dd5d88c00f683bd83bfa87e856df0169a93",
        "summary": "Eddie Knight is the OSPO lead at Sonatype, which manages relationships with the Linux Foundation and others. He is also on the Technical Oversight Committee for FINOS, the financial technology arm of theLinux Foundation. Knight: One of the biggest wins that we've had is there's fewer and fewer people that are saying, \"We don't use open source\". Fewer people are saying that, and you'll find that a lot of people who are using Java and they're running Linux machines.",
        "source": "www.infoq.com",
        "keywords": [
            "eddie",
            "knight",
            "sonatype",
            "discusses",
            "cyber"
        ],
        "published_date": "2025-04-21",
        "published_time": "11:00:34",
        "rss_source": "United States"
    },
    {
        "title": "Apr 22 | TRUSTED AND TESTED Cyber Codex Revolution Helped Me Reclaim My Lost ...",
        "url": "https://patch.com/new-york/central-park/calendar/event/20250422/c87b200d-b553-4072-97ea-aa597d73b196/trusted-and-tested-cyber-codex-revolution-helped-me-reclaim-my-lost-220-000-bitcoins",
        "text_hash": "8a6aa086477270b198ff354a91c1efda2868e13b67ff49cf849cb4338a6f7921",
        "summary": "In 2021, I invested $220,000 worth of Bitcoin in a high-yield crypto scheme. My funds vanished, and the platform disappeared. I tried every legal means to recover my money but hit dead ends. I discovered Cyber Codex Revolution, a cutting-edge blockchain forensic and asset recovery firm. Their team of expert hackers and investigators analyzed the scam’s digital footprint, tracing my Bitcoin through multiple wallets. Using advanced blockchain tracking tools, they identified the fraudsters’ weak points. They recovered 85% of my Bitcoin around $187,000.",
        "source": "patch.com",
        "keywords": [
            "discovered",
            "cyber",
            "codex",
            "revolution",
            "blockchain"
        ],
        "published_date": "2025-04-21",
        "published_time": "10:06:59",
        "rss_source": "United States"
    },
    {
        "title": "Rental company Hertz reports a cyber incident - Panda Security",
        "url": "https://www.pandasecurity.com/en/mediacenter/rental-company-hertz-reports-a-cyber-incident/",
        "text_hash": "6cf856d48ca58567371e5346700c46033c20a3b166e8d1ad3248d364a10218b3",
        "summary": "Rental company Hertz reports a cyber incident - Panda Security. The criminals accessed extremely sensitive information belonging to Hertz customers, such as government document numbers, SSNs, and passport information. The identity of the attackers is still unknown. Experts believe it was a Russia-affiliated ransomware gang called Clop. Hertz has not disclosed the number of people affected by the incident, but the company has millions of customers yearly. The Florida-based car rental company advises its customers to keep an eye on all major credit reports and immediately report suspicious behavior.",
        "source": "www.pandasecurity.com",
        "keywords": [
            "major",
            "cyber",
            "incident",
            "hertz",
            "sensitive"
        ],
        "published_date": "2025-04-21",
        "published_time": "07:06:14",
        "rss_source": "United States"
    },
    {
        "title": "'Trust' is the biggest threat to a health care organization's cybersecurity — here's why",
        "url": "https://www.medicaleconomics.com/view/-trust-is-the-biggest-threat-to-a-health-care-organization-s-cybersecurity-here-s-why",
        "text_hash": "f0791ce2d7a68bc13cdaa7554b29473afb0d087537eb5440fbd635949dd4a5f2",
        "summary": "No medical organization is safe from the perils posed by skilled cybercriminals and internal risks. Practices dealing with confidential patient or client data cannot afford to gamble on traditional perimeter defenses alone. Adopting zero trust acknowledges that data breaches can happen at any point. Instead of granting sweeping access, every user, device or application must pass through checkpoints of authentication and authorization. Even if a system is compromised, the adversary is contained within micro-segments and cannot freely hop from one database to another.",
        "source": "www.medicaleconomics.com",
        "keywords": [
            "malicious",
            "actors",
            "always",
            "after",
            "valuable"
        ],
        "published_date": "2025-04-21",
        "published_time": "14:53:30",
        "rss_source": "United States"
    },
    {
        "title": "ASUS AiCloud Routers Exposed to Authentication Bypass Risk | MSSP Alert",
        "url": "https://www.msspalert.com/brief/asus-aicloud-routers-exposed-to-authentication-bypass-risk",
        "text_hash": "701894758ab78d4233e8cc7963f3dade48884e39ed3b66c606597f0180ef94f1",
        "summary": "ASUS has disclosed a critical vulnerability affecting several router models running its AiCloud feature. Tracked as CVE-2025-2492, the flaw allows remote attackers to bypass authentication mechanisms. Users are urged to update their firmware promptly through the official support page. There is currently no confirmation of active exploitation, but the high CVSS score of 9.2 reflects the potential severity of the vulnerability. The issue impacts multiple firmware series, including 3.0.4_382, 3.1.6_102, and 3.2.4-102.",
        "source": "www.msspalert.com",
        "keywords": [
            "cybersecurity",
            "cyber",
            "attack",
            "multiple",
            "breach"
        ],
        "published_date": "2025-04-21",
        "published_time": "13:18:11",
        "rss_source": "United States"
    },
    {
        "title": "Industry groups highlight aspects of acquisition reform to come from Trump directives to agencies",
        "url": "https://insidecybersecurity.com/daily-news/industry-groups-highlight-aspects-acquisition-reform-come-trump-directives-agencies",
        "text_hash": "379034007604acf97dddec293384cfa723533169f8b51083e25f11b1d967dbe2",
        "summary": "Tech industry groups see opportunity to improve security through buying commercial solutions. Industry groups highlight aspects of acquisition reform to come from Trump directives to agencies. \"The tech industry has long called for simplification of the federal procurement process and the adoption of cutting-edge commercial technologies to enhance government efficiency,\" Gordon Bitko of the Information Technology Industry Council said. President Trump issued a series of executive orders to reshape government acquisition efforts.",
        "source": "insidecybersecurity.com",
        "keywords": [
            "cyber",
            "about",
            "cybersecurity",
            "regulations",
            "features"
        ],
        "published_date": "2025-04-21",
        "published_time": "10:09:00",
        "rss_source": "United States"
    },
    {
        "title": "False Face: Unit 42 Demonstrates the Alarming Ease of Synthetic Identity Creation",
        "url": "https://unit42.paloaltonetworks.com/north-korean-synthetic-identity-creation/",
        "text_hash": "0197d923d988b05bd7ec711c8484584ec2d9ce8b9b3a6c93038f25c22eff3d62",
        "summary": "Unit 42: North Korean IT workers are using real-time deepfake technology to infiltrate organizations through remote work positions. The detection strategies we outline in this report provide security and HR teams with practical guidance to strengthen their hiring processes against this threat. Organizations must implement layered defenses by combining enhanced verification procedures, technical controls and ongoing monitoring throughout the employee lifecycle. Palo Alto Networks customers are better protected from the threats discussed in this article through Unit 42 Insider Threat Services. Organizations can engage the Unit 42 Incident Response team for specific assistance with this threat and others.",
        "source": "unit42.paloaltonetworks.com",
        "keywords": [
            "talent",
            "acquisition",
            "cybersecurity",
            "communities",
            "recently"
        ],
        "published_date": "2025-04-21",
        "published_time": "10:07:58",
        "rss_source": "United States"
    },
    {
        "title": "Cyber scam gangs spreading like \"cancer,\" UN says - DIGIT",
        "url": "https://www.digit.fyi/cyber-scam-gangs-spreading-like-cancer-un-says/",
        "text_hash": "b201b9544ac5e02d156c4a1876269bb405234b9e6ebe765f91f6c2b237ec9ea5",
        "summary": "Cyber gangs based in Southeast Asia and China are scamming people out of billions of pounds a year via investment, crypto, and romance scams. The gangs are teaming up with drug cartels in South America, as well as mob and mafia organisations. The issue seems to be expanding to countries in Africa such as Zambia, Angola, and Namibia, and islands in the Pacific such as Tonga, Fiji, Palau, and Vanuata. The scams are often committed by a mass group of workers that are often trafficked and forced to work in compounds.",
        "source": "www.digit.fyi",
        "keywords": [
            "cyber",
            "gangs",
            "security",
            "cybersecurity",
            "spreading"
        ],
        "published_date": "2025-04-21",
        "published_time": "14:57:51",
        "rss_source": "England"
    },
    {
        "title": "Cybersecurity Challenges in Zimbabwe's Growing Digital Economy: What Steps are Being ...",
        "url": "https://bulawayo24.com/index-id-technology-sc-internet-byo-250074.html",
        "text_hash": "6d954c0f449891133c1d5b3f6f6f59de3552aaa0b61ac4a38dae2320196dd32f",
        "summary": "Zimbabwe ranks 65th out of 71 countries on the National Cyber Security Index. The country suffers from inadequate digital infrastructure, high data costs, poor internet quality, and more. A shortage of skilled cybersecurity professionals is another issue with many opting to work abroad due to limited local opportunities. Many users are unaware of basic security practices like recognizing phishing attempts or protecting personal and financial data. The Cyber and Data Protection Act was enacted in 2021 to address cybercrime and data breaches, but it has not yet managed to accomplish it.",
        "source": "bulawayo24.com",
        "keywords": [
            "security",
            "implies",
            "online",
            "cyberspace",
            "internet"
        ],
        "published_date": "2025-04-21",
        "published_time": "12:42:12",
        "rss_source": "England"
    },
    {
        "title": "Apple Urges All iPhone Users to Install Emergency iOS 18.4.1 Update Amid Active Cyber Attacks",
        "url": "https://asaaseradio.com/apple-urges-all-iphone-users-to-install-emergency-ios-18-4-1-update-amid-active-cyber-attacks/",
        "text_hash": "5a387dafd4ed67ea1ebca3826ac8cfb3f7d302837d8afee37938aca7de3bd5c2",
        "summary": "Apple has issued an urgent security update—iOS 18.4.1—after discovering two actively exploited vulnerabilities that could allow hackers to take control of iPhones. The two vulnerabilities involve CoreAudio and RPAC, both critical components of the iOS operating system. The update underscores the growing sophistication of cyberattacks on mobile platforms. Apple’s rapid response shows the importance of proactive security practices, especially for those who use their phones for sensitive communications or work. Even if you’re not part of a high-risk group, updating ensures you are protected against these exploits before they're used more broadly.",
        "source": "asaaseradio.com",
        "keywords": [
            "apple",
            "issued",
            "urgent",
            "security",
            "discovering"
        ],
        "published_date": "2025-04-21",
        "published_time": "12:30:01",
        "rss_source": "England"
    },
    {
        "title": "Why Security Teams Are Moving Toward Application-Centric Platformisation | SC Media UK",
        "url": "https://insight.scmagazineuk.com/why-security-teams-are-moving-toward-application-centric-platformisation",
        "text_hash": "f6dbbfe7a4287bfec1d6d87c73e28f1ce5adc0f673dedb7ad1f01d83636266d5",
        "summary": "Gartner names hybrid computing one of this year’s top trends. Security teams are reevaluating their approach to protecting applications and data. The shift is also being driven by the increasing convergence of cloud and data centre security teams. More than 90 percent of enterprises now have a multi-cloud strategy, 80 percent have a hybrid cloud strategy, and only seven percent still use a single public cloud solution. By decoupling security from the underlying network, organisations can adapt to modern architectures, enforce identity-driven policies, and leverage automation.",
        "source": "insight.scmagazineuk.com",
        "keywords": [
            "cloud",
            "computing",
            "hybrid",
            "environments",
            "distributed"
        ],
        "published_date": "2025-04-21",
        "published_time": "10:57:00",
        "rss_source": "England"
    },
    {
        "title": "Cyber Criminals and the Gift Card Scam - Law.com",
        "url": "https://www.law.com/newyorklawjournal/2025/04/21/cyber-criminals-and-the-gift-card-scam/",
        "text_hash": "c55a9540acdb9c9f900ed6f9106ea131bfc4893aad357e14d01fcc9061a8b5a7",
        "summary": "Attorneys from A&O Shearman has stepped in as defense counsel for Toronto-Dominion Bank and other defendants. The suit, filed Dec. 11 in New York Southern District Court, accuses the defendants of concealing the bank's 'pervasive' deficiencies. The case, assigned to U.S. District Judge Arun Subramanian, is 1:24-cv-09445, Gonzalez v. The Toronto- Dominion Bank et al.",
        "source": "www.law.com",
        "keywords": [
            "credit",
            "debit",
            "cards",
            "limitation",
            "cyber"
        ],
        "published_date": "2025-04-21",
        "published_time": "16:02:18",
        "rss_source": "United States"
    },
    {
        "title": "Two top cyber officials resign from CISA",
        "url": "https://therecord.media/two-top-cyber-officials-resign-from-cisa",
        "text_hash": "8a6f665e34f6537aa66d41bde74455cd0641f91dd0b0b6c09aee30ebbad52c42",
        "summary": "Bob Lord and Lauren Zabierek announced they were leaving the Cybersecurity and Infrastructure Security Agency. The departures are the latest sign of the brain drain taking place at the country's domestic cyber agency. The Trump administration could soon axe up to 1,300 employees, cutting about half of CISA’s full-time staff, and another 40 percent of its contractors. The agency previously attempted to cut 130 probational staffers, a move that was blocked in court before being overturned in an appeal.",
        "source": "therecord.media",
        "keywords": [
            "cyber",
            "defense",
            "agency",
            "wrote",
            "neither"
        ],
        "published_date": "2025-04-21",
        "published_time": "15:52:33",
        "rss_source": "United States"
    },
    {
        "title": "Microsoft strengthens in-house cyber governance, training - Cybersecurity Dive",
        "url": "https://www.cybersecuritydive.com/news/microsoft--cyber-governance-training/745873/",
        "text_hash": "72be1f06991943aac6e4ecec62442bcc2f3b92af2bb5989b3ad0313e4240bdbc",
        "summary": "Microsoft says it has reached additional milestones in a multiyear effort to strengthen its product development, threat detection and corporate governance structure. The company has now rolled out a secure-by-design toolkit to 22,000 employees involved in product development. Microsoft launched SFI after a China-linked threat group hacked into the Microsoft Exchange Online environments of at least 22 customers. The hack led to the exfiltration of more than 60,000 emails from the U.S. State Department, and the threat group gained access to other highly sensitive accounts.",
        "source": "www.cybersecuritydive.com",
        "keywords": [
            "microsoft",
            "strengthens",
            "cyber",
            "governance",
            "training"
        ],
        "published_date": "2025-04-21",
        "published_time": "15:22:52",
        "rss_source": "United States"
    },
    {
        "title": "Varonis Systems Partners with Pure Storage to Enhance Data Security and Cyber ... - Nasdaq",
        "url": "https://www.nasdaq.com/articles/varonis-systems-partners-pure-storage-enhance-data-security-and-cyber-resilience-solutions",
        "text_hash": "0db00ce1fe61a7116f54dc1a5c56c8780e654c0c87b58fca221487531404ae64",
        "summary": "Varonis Systems Partners with Pure Storage to Enhance Data Security and Cyber ... - Nasdaq. Varonis uses AI to discover, classify, and secure sensitive data while reducing exposure and detecting potential threats effectively. Immutable snapshots from Pure Storage allow for rapid recovery after cyber incidents, enhancing overall data resilience for organizations. The partnership combines advanced features like permission mapping and threat detection to proactively mitigate the risk of data breaches. $VRNS Insider Trading Activity $ VRNS insiders have traded $VR NSX.",
        "source": "www.nasdaq.com",
        "keywords": [
            "partnership",
            "organizations",
            "securely",
            "manage",
            "their"
        ],
        "published_date": "2025-04-21",
        "published_time": "14:29:26",
        "rss_source": "United States"
    },
    {
        "title": "Spike in Microsoft flaws sparks insurance concern",
        "url": "https://www.insurancebusinessmag.com/us/news/cyber/spike-in-microsoft-flaws-sparks-insurance-concern-532604.aspx",
        "text_hash": "315e1e7e621a9a00262c6d8d110fc73908fa831d74d80f82bf2b744926537934",
        "summary": "The data offers a clear reminder that the threat landscape isn’t slowing down – it’s rapidly evolving. “The sustained dominance of Elevation of Privilege vulnerabilities highlights how valuable privileges are to attackers,” he said. ‘Attackers will continue to target identities with privileges to move laterally and gain access to critical systems,’ he added.",
        "source": "www.insurancebusinessmag.com",
        "keywords": [
            "percent",
            "respondents",
            "named",
            "cyber",
            "threats"
        ],
        "published_date": "2025-04-21",
        "published_time": "14:21:16",
        "rss_source": "United States"
    },
    {
        "title": "New 'Digimon CG' Set Adds 'Digimon: Cyber Sleuth' Characters to the Mix - ICv2",
        "url": "https://icv2.com/articles/news/view/59368/new-digimon-cg-set-adds-digimon-cyber-sleuth-characters-mix",
        "text_hash": "2718f282bccec57286245e2556394df1797d9d9b585c9a30c385c7a90d583837",
        "summary": "Bandai will release Hackers' Slumber, a new Digimon CG booster set, into retail on October 24, 2025. The booster set features characters from the Digimon Story: Cyber Sleuth video game. Bandai also will release World Convergence,. a new booster set for Digimon. CG, which will hit stores on April 25, 2025 (see \"'Digimon CG' Booster Set Unveiled\" for more information. The set also offers players more Royal Knights to utilize as well as new cards of Eri Karan and Dokamon.",
        "source": "icv2.com",
        "keywords": [
            "characters",
            "booster",
            "features",
            "digimon",
            "story"
        ],
        "published_date": "2025-04-21",
        "published_time": "13:58:01",
        "rss_source": "United States"
    },
    {
        "title": "Bruce Schneier tackles AI hype, NSA surveillance, and cyber 'rage fatigue' | SC Media",
        "url": "https://www.scworld.com/news/bruce-schneier-ai-hype-nsa-surveillance-and-cybersecuritys-real-challenges",
        "text_hash": "d2cde5becaa54b9bf948ffe4400f17e13daf7d1fcd89cc894952e50671b7f086",
        "summary": "Security technologist Bruce Schneier tackled some of cybersecurity’s toughest questions in a candid AMA-style session Thursday. In it he covered AI, NSA surveillance, cryptography and broader societal threats beyond typical cyber concerns. Schneier: \"We're at the receiving end of a strategy that is deliberately designed to be overwhelming and exhausting\" The threat of tariffs on computer components, semiconductors and the potential restrictions of software exports is also taking a cyber toll, Schneier said. \"Compared to those, cybersecurity is a rounding error,\" he wrote.",
        "source": "www.scworld.com",
        "keywords": [
            "covered",
            "surveillance",
            "cryptography",
            "broader",
            "societal"
        ],
        "published_date": "2025-04-21",
        "published_time": "13:48:59",
        "rss_source": "United States"
    },
    {
        "title": "Essex care providers urged to strengthen risk management amid mounting pressures",
        "url": "https://www.yourthurrock.com/2025/04/21/essex-care-providers-urged-to-strengthen-risk-management-amid-mounting-pressures/",
        "text_hash": "abc0486db8e7b40b702c6bdb1f4da9ef17dcde1558dff319eb5ae500a6f94855",
        "summary": "Essex care providers urged to strengthen risk management. Rising demand and evolving risks putting pressure on providers. Data from Skills for Care reveals that, as of February 2025, the care industry in the East has a vacancy rate of 7.5%. These challenges are expected to intensify with upcoming changes to UK immigration rules, which will further restrict the recruitment of overseas care workers. Increased reliance on digital systems makes data breaches a serious financial and reputational threat. Care providers that experienced at least one cyber incident in the past three years faced an average cost of £9,528 per incident.",
        "source": "www.yourthurrock.com",
        "keywords": [
            "alongside",
            "rising",
            "demand",
            "workforce",
            "shortages"
        ],
        "published_date": "2025-04-21",
        "published_time": "12:28:10",
        "rss_source": "England"
    },
    {
        "title": "Maritime Union of Australia criticises DP World port automation plans",
        "url": "https://container-mag.com/2025/04/21/maritime-union-of-australia-criticises-dp-world-port-automation-plans/",
        "text_hash": "3195c46d4312b5b6e4c793fec6bce4bf149e241fd2edeaf969e6fe3ce2f754f1",
        "summary": "DP World has indicated plans to spend more than AU$600m (US$383m) on automated equipment within the Australian container terminal network. The announcement has been made without fulfilling consultation requirements set out in the Enterprise Agreement signed off on by the company little over a year ago, according to the Maritime Union of Australia (MUA) The MUA claims the plan will make Australian container terminals become less productive, more costly and less safe.",
        "source": "container-mag.com",
        "keywords": [
            "world",
            "australia",
            "employee",
            "accessed",
            "during"
        ],
        "published_date": "2025-04-21",
        "published_time": "05:02:05",
        "rss_source": "England"
    },
    {
        "title": "Mexico Overhauls Federal Data Protection Law - Hunton Andrews Kurth LLP",
        "url": "https://www.hunton.com/privacy-and-information-security-law/mexico-overhauls-federal-data-protection-law",
        "text_hash": "aee9ce8b9976ace4c0cfbea31342998bec3843277e01d0c1035b41227036de79",
        "summary": "The Mexican Congress approved a new Federal Law on the Protection of Personal Data Held by Private Parties (“LFPDPPP”), replacing the previous 2010 federal data protection law. Relevant updates and considerations for companies operating in Mexico include: an expanded definition of personal data,broader legal bases for processing, and a new judicial structure. Promulgating regulations are expected to be issued within 90 days from the law’s effective date, which will clarify the scope and operational details of the law.",
        "source": "www.hunton.com",
        "keywords": [
            "privacy",
            "information",
            "security",
            "global",
            "cybersecurity"
        ],
        "published_date": "2025-04-21",
        "published_time": "16:42:05",
        "rss_source": "United States"
    },
    {
        "title": "Researchers warn of critical vulnerability found in Erlang OTP SSH | Cybersecurity Dive",
        "url": "https://www.cybersecuritydive.com/news/researchers-warn-of-critical-vulnerability-found-in-erlang-otp-ssh/745900/",
        "text_hash": "bef1f2905d607f9a07b00381e788d2073a1aff53320bd4b121e5641158c41539",
        "summary": "Security researchers on Monday warned of a critical vulnerability in the Erlang Open Telecom Platform SSH implementation. The vulnerability could allow an unauthenticated attacker with network access to execute arbitrary code. If an SSH daemon is running as root, then an attacker has full access to a device. Researchers warn of critical vulnerability found in Erlang OTP SSH | Cybersecurity Dive. Researchers from Ruhr University Bochum found the vulnerability in an Erlang version of the SSH protocol. If you or a family member have been affected by this article, please contact the author at jennifer.smith@mailonline.co.uk.",
        "source": "www.cybersecuritydive.com",
        "keywords": [
            "could",
            "allow",
            "unauthenticated",
            "attackers",
            "access"
        ],
        "published_date": "2025-04-21",
        "published_time": "16:36:12",
        "rss_source": "United States"
    },
    {
        "title": "Key Takeaways From DOJ's Continued Cybersecurity Enforcement - Security - United States",
        "url": "https://www.mondaq.com/unitedstates/security/1613100/key-takeaways-from-dojs-continued-cybersecurity-enforcement",
        "text_hash": "9e25ffe25ea313ac8f8e622e7fe0c23f69cb760d3f5f04e6e9818d0d27fb0303",
        "summary": "The U.S. Department of Justice announced a $4.6 million settlement with MORSECORP, Inc. The case began in January 2023, when MORSE's Head of Security and Facility Security Officer filed a qui tamcomplaint. The complaint alleged that MORSE and its CEO fraudulently induced the federal government to award contracts worth tens of millions of dollars by making false representations about its cybersecurity compliance. According to the complaint, MORSE's senior executives knew of the \"chronic failure\" to comply with the Department of Defense (DoD)'s cybersecurity requirements.",
        "source": "www.mondaq.com",
        "keywords": [
            "morse",
            "alleged",
            "failures",
            "satisfy",
            "cybersecurity"
        ],
        "published_date": "2025-04-21",
        "published_time": "15:26:06",
        "rss_source": "United States"
    },
    {
        "title": "FireMon Adds Four Sales Veterans from Now-Closed Skybox Security | MSSP Alert",
        "url": "https://www.msspalert.com/news/firemon-adds-four-sales-veterans-from-now-closed-skybox-security",
        "text_hash": "bc9975748a07ba614fc9ab14b06fb7cdf0732178d2bed2ff2e48effbdfdb6ccf",
        "summary": "FireMon Adds Four Sales Veterans from Now-Closed Skybox Security. FireMon pitched itself as a safe harbor for enterprises and SMBs that were left in need of a new cybersecurity vendor. Rival cybersecurity firm Tufin bought some of Skybox’s assets and customer information and laid out a migration plan for ex-Skybox customers to move to its business. But Skybox had been struggling during its transition from selling on-premises products to becoming a SaaS business.",
        "source": "www.msspalert.com",
        "keywords": [
            "firemon",
            "pioneered",
            "firewall",
            "policy",
            "management"
        ],
        "published_date": "2025-04-21",
        "published_time": "15:23:36",
        "rss_source": "United States"
    },
    {
        "title": "Gartner: How to build a secure enterprise cloud environment | Cybersecurity Dive",
        "url": "https://www.cybersecuritydive.com/news/gartner-how-to-build-secure-enterprise-cloud/745459/",
        "text_hash": "ee0f94a73edc9169cb16046d84684658699bb383ecd4b3481e03ac53d85c716e",
        "summary": "80% of businesses now view the public cloud as vital to their digital objectives. Without proper security measures, the risk of breaches and cyberattacks looms large. There are a series of strategic steps that security leaders can take to ensure successful cloud deployment with a focus on cloud security architecture. Security leaders must regularly assess their cloud environments to identify potential risks and address vulnerabilities before they escalate into major issues. The most common issue is customer misconfiguration, which often leads to vulnerabilities and potential data breaches.",
        "source": "www.cybersecuritydive.com",
        "keywords": [
            "frameworks",
            "sherwood",
            "applied",
            "business",
            "security"
        ],
        "published_date": "2025-04-21",
        "published_time": "15:22:53",
        "rss_source": "United States"
    },
    {
        "title": "Sports venues need to step up to the plate on cybersecurity - The Stack",
        "url": "https://www.thestack.technology/why-sports-venues-need-to-step-up-to-the-plate-on-cybersecurity/",
        "text_hash": "92d967dd39aa532b7cf44c88e1c2772e7dc1262ba6bb88e3847f47757732b090",
        "summary": "Sports venues need to step up to the plate on cybersecurity - The Stack. \"It’s probably going to take a major disruption of an event from a cyber attack for people to start waking up,\" says Ben Morris, former head of cyber security for World Rugby. Keeping events at the cutting edge of security has proved more difficult as international competitions such as the Olympics move away from building new infrastructure in the name of sustainability. Now, governing bodies “can't invest billions and billions into a country to build their venues, so we have to integrate with the country's infrastructure,” he says.",
        "source": "www.thestack.technology",
        "keywords": [
            "probably",
            "going",
            "major",
            "disruption",
            "event"
        ],
        "published_date": "2025-04-21",
        "published_time": "14:55:55",
        "rss_source": "United States"
    },
    {
        "title": "Applied Underwriters Completes Spin-off of its Subsidiary United Risk as Newly ...",
        "url": "https://www.finanznachrichten.de/nachrichten-2025-04/65164001-applied-underwriters-completes-spin-off-of-its-subsidiary-united-risk-as-newly-independent-company-expands-further-adding-new-units-and-top-leadership-008.htm",
        "text_hash": "bb9cde5a543c4954b9396c1e6bd811f6afdeefeb0f735874c1c21d0542f94eb4",
        "summary": "Applied Underwriters Completes Spin-off of its Subsidiary United Risk. Newly independent company immediately becomes one of the largest MGAs in the world. United Risk provides a global P&C underwriting platform comprised of 28 different MGA and MGU programs, spanning more than 30 offices around the world, including New York, London and Paris, with more than 250 insurance professionals. The company's home office is located at 50 Rockefeller Plaza in New York. For confidential support call the Samaritans on 08457 90 90 90 or visit a local Samaritans branch, see www.samaritans.org for details.",
        "source": "www.finanznachrichten.de",
        "keywords": [
            "develops",
            "difficult",
            "areas",
            "cyber",
            "security"
        ],
        "published_date": "2025-04-21",
        "published_time": "13:23:00",
        "rss_source": "Germany"
    },
    {
        "title": "Response To Letter “Hold Vendors To Same High Standards, Or They May Become Weakest Link”",
        "url": "https://mondovisione.com/media-and-resources/news/monetary-authority-of-singapore-response-to-letter-hold-vendors-to-same-high-s-2025421/",
        "text_hash": "41a26c9c2015cb23f92de57b6df3700ac795a082c689dc071ba30b2b78b99a7d",
        "summary": "The Monetary Authority of Singapore (MAS) expects all financial institutions to put in place stringent controls to protect any customer information that they disclose to their third-party vendors. FIs are expected to regularly review and affirm that the controls of their vendors are adequate to safeguard the confidentiality of customer information. Organisations offering services as vendors should consider obtaining CSA’s Cyber Essentials or Cyber Trust marks. These are national cybersecurity standards that help organisations prioritise the measures to be implemented. CSA offers up to 70 per cent co-funding for eligible SMEs.",
        "source": "mondovisione.com",
        "keywords": [
            "organisations",
            "implementing",
            "cybersecurity",
            "measures",
            "aligned"
        ],
        "published_date": "2025-04-21",
        "published_time": "17:03:03",
        "rss_source": "England"
    },
    {
        "title": "Accepting FY25 Applications: Cyber Skilling for Federal Employees! | NICCS",
        "url": "https://niccs.cisa.gov/cybersecurity-career-resources/featured-stories/accepting-fy25-applications-cyber-skilling-federal",
        "text_hash": "1f13af91751f72f04f6f75360459692373b242070258b6a6e345a78235e5d992",
        "summary": "CISA’s Federal Cyber Defense Skilling Academy (Skilling Academy) is a unique opportunity offered to full-time federal employees at no cost to enhance their knowledge and skills in cybersecurity. Micro-courses are perfect for students looking for training that can be completed at their own pace throughout the 40- or 80- hour allotted timeframe. Pathways are the longer of the two training options and are an intense, full- time, one to three-month accelerated training program. See below for the FY25 pathways course schedule: FY25 Pathway Title & Session Number Length Course Start & End Date Application Close Date.",
        "source": "niccs.cisa.gov",
        "keywords": [
            "looking",
            "additional",
            "skills",
            "cybersecurity",
            "toolbelt"
        ],
        "published_date": "2025-04-21",
        "published_time": "18:35:39",
        "rss_source": "United States"
    },
    {
        "title": "City of Abilene systems functioning in spite of 'cyber incident'",
        "url": "https://www.reporternews.com/story/news/2025/04/21/city-of-abilene-systems-functioning-in-spite-of-cyber-incident/83197604007/",
        "text_hash": "9c5ccca719c4aba98253eae8ba756d02e48b0c5f8499a97cc454b7dada9435ad",
        "summary": "The city of Abilene is investigating a 'cyber incident' that caused a network outage Friday. The city's IT department and cybersecurity experts are working to restore systems and investigate the incident. City services remain functional, and no financial irregularities have been detected, officials say. The investigation is ongoing, and the city continues to closely monitor its systems for unusual activity, officials said.\"We take the security of our systems very seriously and appreciate your patience and understanding as we work diligently to restore our systems and resources,\" officials said in a media release.",
        "source": "www.reporternews.com",
        "keywords": [
            "abilene",
            "investigating",
            "incident",
            "caused",
            "network"
        ],
        "published_date": "2025-04-21",
        "published_time": "18:11:37",
        "rss_source": "United States"
    },
    {
        "title": "RedGolf Hackers Linked to Fortinet Zero-Day Exploits and Cyber Attack Tools - GBHackers",
        "url": "https://gbhackers.com/redgolf-hackers-linked-to-fortinet-zero-day-exploits/",
        "text_hash": "cfa7742d0d36d1405e102f3110a58a8006339e46439ceee56043869b2e12eb8d",
        "summary": "RedGolf Hackers Linked to Fortinet Zero-Day Exploits and Cyber Attack Tools. Security researchers have linked the notorious RedGolf hacking group to a wave of exploits targeting Fortinet firewall zero-days and the deployment of custom cyber attack tools. The incident came to light when a server, active for less than 24 hours, was briefly exposed to the public internet. The tools included support for post-exploitation actions and remote session management, demonstrating the comprehensive planning of operations typical of state-linked APT groups.",
        "source": "gbhackers.com",
        "keywords": [
            "found",
            "virtual",
            "arsenal",
            "cyber",
            "attack"
        ],
        "published_date": "2025-04-21",
        "published_time": "17:01:54",
        "rss_source": "United States"
    },
    {
        "title": "City of Abilene suffers cyber attack - KTXS",
        "url": "https://ktxs.com/news/local/city-of-abilene-suffers-cyber-attack",
        "text_hash": "3a9426e6726e482d92838ae23a634d2436c8ca01529b64501b4475b6bc4440fc",
        "summary": "City of Abilene computer servers take some online services offline. Officials received reports of unresponsive servers within city internal networks. Emergency services are up and running and no unidentified financial activity has been found. City says no past due accounts will be shut off and payments can still be made by cash and check in person. The city says the investigation is ongoing and no further action will be taken at this time. The attack is believed to be the result of a cyber-attack on the city.",
        "source": "ktxs.com",
        "keywords": [
            "weekend",
            "cyber",
            "attack",
            "abilene",
            "computer"
        ],
        "published_date": "2025-04-21",
        "published_time": "16:50:39",
        "rss_source": "United States"
    },
    {
        "title": "Gangs behind billion-pound cyber scam industry expanding as they try to dodge ... - Yahoo News UK",
        "url": "https://uk.news.yahoo.com/gangs-behind-billion-pound-cyber-071900413.html",
        "text_hash": "443fb78ed5aea252dce889810a1a908aeaa678e9a4e5792758d53948abbc7ba2",
        "summary": "Gangs behind billion-pound cyber scam industry expanding as they try to dodge crackdowns. Gangs behind multibillion-pound scam industry are expanding globally, new UN report says. Countries in South America, Africa and Eastern Europe are now being targeted, UN says. The networks and gangs have emerged in South East Asia in recent years, in sprawling compounds housing tens of thousands of people, many trafficked and forced into work, scamming victims abroad. Even the more conservative estimates indicate hundreds of large-scale scam farms around the world, generating tens of billions of pounds.",
        "source": "uk.news.yahoo.com",
        "keywords": [
            "crime",
            "syndicates",
            "behind",
            "cyber",
            "industry"
        ],
        "published_date": "2025-04-21",
        "published_time": "17:01:09",
        "rss_source": "England"
    },
    {
        "title": "Everything you need to know about Mezcal: Tequila's smokier cousin - Shortlist",
        "url": "https://www.shortlist.com/lists/everything-you-need-to-know-about-mezcal-tequilas-smokier-cousin-405549",
        "text_hash": "d2d1eae5978883ff7249781eac2815022acfcd330b76c1b3e8a95a42e8ac350a",
        "summary": "Mezcal is made from over 30 Agave species, varieties, and subvarieties. Tequila can only be made from blue Weber agave in certain Mexican states. The word mezcal comes from Nahuatl (languauge of the Aztecs), and their word mexcalli which means \"baked agave\" - metl meaning \"agave\" and ixca \"to bake\" Mezcal has a strong smoky flavour thanks to its agave plants being roasted as opposed to tequila.",
        "source": "www.shortlist.com",
        "keywords": [
            "monday",
            "these",
            "cyber",
            "whisky",
            "deals"
        ],
        "published_date": "2025-04-21",
        "published_time": "15:16:05",
        "rss_source": "England"
    },
    {
        "title": "Securing our future: April 2025 progress report on Microsoft's Secure Future Initiative",
        "url": "https://www.microsoft.com/en-us/security/blog/2025/04/21/securing-our-future-april-2025-progress-report-on-microsofts-secure-future-initiative/",
        "text_hash": "7ea9fbdc39d26d8a312c7514cebe7d9af951d415b97b234692f654ab2b91970b",
        "summary": "The Microsoft Secure Future Initiative (SFI) stands as the largest cybersecurity engineering project in history and most extensive effort of its kind at Microsoft. Since inception, we’ve dedicated the equivalent of 34,000 engineers working full-time for 11 months to mitigate risks and address the highest priority security tasks. We have also made progress in every engineering pillar and objective, continuously hardening our identity security, reducing the risk of lateral movement across networks and tenants, and partnering with the industry to protect customers from zero days.",
        "source": "www.microsoft.com",
        "keywords": [
            "microsoft",
            "secure",
            "future",
            "initiative",
            "stands"
        ],
        "published_date": "2025-04-21",
        "published_time": "18:48:06",
        "rss_source": "United States"
    },
    {
        "title": "CISA loses secure by design leaders among voluntary departures - Inside Cybersecurity",
        "url": "https://insidecybersecurity.com/daily-news/cisa-loses-secure-design-leaders-among-voluntary-departures",
        "text_hash": "13b5c999f0e7731e8fb01731dbe2b81cf30a9973753b0e70b664dc3cf06ba717",
        "summary": "Senior advisors Bob Lord and Lauren Zabierek have announced plans to exit the Cybersecurity and Infrastructure Security Agency. “I’m deeply grateful for the opportunity to help lead the agency’s work on Secure by Design software,” Lord said in an April 21 LinkedIn post on his departure. Lord joined CISA as a senior technical advisor in 2022 where he supported efforts to promote secure by design practices and ...",
        "source": "insidecybersecurity.com",
        "keywords": [
            "senior",
            "advisors",
            "lauren",
            "zabierek",
            "announced"
        ],
        "published_date": "2025-04-21",
        "published_time": "17:45:00",
        "rss_source": "United States"
    },
    {
        "title": "Cybersecurity icon shares insights on NASA, early days of information security - GCU News",
        "url": "https://news.gcu.edu/gcu-news/cybersecurity-icon-shares-insights-on-nasa-early-days-of-information-security/",
        "text_hash": "4e2a77f2151ec9580981d307fd6524b3caa31d0521536f4183dbf20201c567b9",
        "summary": "Rich Owen helped shaped the cybersecurity field as a computer security official at NASA. He spoke to Grand Canyon University students and others interested in cybersecurity. Owen wrote the \"pink book,\" a document that was the original cybersecurity standard for Mission Operations at NASA’s Johnson Space Center in Houston. When Owen started his career in the military and at NASA, he said information security wasn’t yet a big concern. He never envisioned himself becoming one of the architects of cybersecurity, he says.",
        "source": "news.gcu.edu",
        "keywords": [
            "spoke",
            "grand",
            "canyon",
            "university",
            "students"
        ],
        "published_date": "2025-04-21",
        "published_time": "17:44:15",
        "rss_source": "United States"
    },
    {
        "title": "Breaking the Cycle: A Future-Ready, Prevention-First Approach to Cybersecurity with Michael Gorelik",
        "url": "https://www.morphisec.com/blog/breaking-the-cycle-future-ready-prevention-first-cybersecurity/",
        "text_hash": "aa4d49a037c18fda613de80cf4bea4745035f0920e27217267a25eeb1178167e",
        "summary": "Michael Gorelik, Morphisec’s CTO and Founder, shared insights into his 20+ years of experience in cybersecurity. Gorelik: Adversaries are always innovating, leveraging disclosed vulnerabilities, and exploiting incomplete patches. Mor Memphisec conducts in-depth research, starting with disclosed vulnerabilities and proof-of-concept (PoC) exploits, to identify overlooked weaknesses and ensure patches are truly effective. Michael and his team plan to expand their focus to cloud-based attack surfaces, including SharePoint and AI-driven systems.",
        "source": "www.morphisec.com",
        "keywords": [
            "against",
            "cyber",
            "adversaries",
            "breaking",
            "cycle"
        ],
        "published_date": "2025-04-21",
        "published_time": "17:02:58",
        "rss_source": "United States"
    },
    {
        "title": "Trump is shifting cybersecurity to the states, but many aren't prepared - The Miami Times",
        "url": "https://www.miamitimesonline.com/news/latest_reports/trump-is-shifting-cybersecurity-to-the-states-but-many-aren-t-prepared/article_e275735d-f1da-4721-9576-8cf0047ca0e7.html",
        "text_hash": "7440b9d1963da83a88774a25b9ba5da1d1503f78711ef9dd296c93b27eef2616",
        "summary": "Trump is shifting cybersecurity to the states, but many aren't prepared. Daniris Espinal would awaken and touch the walls for reassurance. She would find in them a relief that turned to tears over her morning coffee.",
        "source": "www.miamitimesonline.com",
        "keywords": [
            "florida",
            "today",
            "fopiano",
            "cybersecurity",
            "chair"
        ],
        "published_date": "2025-04-21",
        "published_time": "16:09:51",
        "rss_source": "United States"
    },
    {
        "title": "'Shadow AI' use is threatening enterprise data security - DIGIT",
        "url": "https://www.digit.fyi/shadow-ai-use-is-threatening-enterprise-data-security/",
        "text_hash": "b609b21039ee33498547b65110ac14d1b3ed421d2e3c942c8284598631816d10",
        "summary": "45% of sensitive AI interactions came from personal email accounts, of which more than 57% were Gmail addresses. 79% of all sensitive data was submitted to ChatGPT, with 21% of that going to the free tier, where prompts can be retained and used for training unless users know to opt out. 7% of users who accessed Chinese-based apps that have data training and retention red flags, with DeepSeek being the most popular. Harmonic said that firms should move beyond policy and focus on enforcement and behaviour shaping at the point of use.",
        "source": "www.digit.fyi",
        "keywords": [
            "resulting",
            "sensitive",
            "shared",
            "tools",
            "built"
        ],
        "published_date": "2025-04-21",
        "published_time": "15:14:28",
        "rss_source": "England"
    },
    {
        "title": "Asia Fintech and Payments regulatory update - April 2025 | Linklaters",
        "url": "https://www.linklaters.com/en/knowledge/publications/alerts-newsletters-and-guides/2025/april/21/asia-fintech-and-payments-regulatory-update---april-2025",
        "text_hash": "db43cf354cb2fff8a16f5a9f90bdeea7841a84d20089e63d1f5cd5b476c478c4",
        "summary": "Hong Kong has passed the Protection of Critical Infrastructures (Computer Systems) Bill, establishing Hong Kong’s first critical infrastructure cybersecurity law. The Cyberspace Administration of China (CAC) has published new Measures on the Security of Facial Recognition Technology Application. The PCPD has published a Checklist on Guidelines for the Use of Generative AI by Employees to guide the use of generative artificial intelligence (Gen AI) by employees. China strengthens regulations on facial recognition technology for processing facial information within mainland China.",
        "source": "www.linklaters.com",
        "keywords": [
            "cyber",
            "security",
            "designated",
            "critical",
            "computer"
        ],
        "published_date": "2025-04-21",
        "published_time": "14:37:51",
        "rss_source": "England"
    },
    {
        "title": "Insecurity: Waking Those who do not Know what it Means to be Awake - GNN Liberia",
        "url": "https://gnnliberia.com/insecurity-waking-those-who-do-not-know-what-it-means-to-be-awake/",
        "text_hash": "915a3f56f0287130a29be8c38d50e081dc210d0025e6355369cd9d6775f46681",
        "summary": "Ayisha Osori was one of 23 students kidnapped from Greenfield University, Kaduna. The remains of Dorathy Yohanna, Precious Nwakacha, and Sadiq Yusuf Sanga were left on the side of a road. Osori: The Greenfield story was only one more reality of schools as soft targets for terrorists and mercenaries. In Nigeria, we often say: when you wake up, is your morning and you cannot wake a person pretending to be asleep. Insecurity: Waking Those who do not Know what it Means to be Awake.",
        "source": "gnnliberia.com",
        "keywords": [
            "sanga",
            "third",
            "course",
            "morning",
            "killed"
        ],
        "published_date": "2025-04-21",
        "published_time": "13:12:36",
        "rss_source": "England"
    },
    {
        "title": "Amarillo College's Innovation Outpost to host cyber challenge Friday - KFDA",
        "url": "https://www.newschannel10.com/2025/04/21/amarillo-colleges-innovation-outpost-host-cyber-challenge-friday/",
        "text_hash": "3e045f61b08a919427a15b5c49d44af5ee28b084f49764a0e5796ea196afc742",
        "summary": "Amarillo College's Innovation Outpost to host cyber challenge Friday. The 2025 Cyber Challenge features challenges for high school, college, and early career IT professionals. The day will include an award ceremony, a networking hour, and a screening and discussion of the documentary, “The Thinking Game” to be held at 11:45 a.m. to 12:45 p.m., according to the college. To register for the challenge, visit www.cyberQ.com.",
        "source": "www.newschannel10.com",
        "keywords": [
            "amarillo",
            "college",
            "cyber",
            "challenge",
            "place"
        ],
        "published_date": "2025-04-21",
        "published_time": "19:52:23",
        "rss_source": "United States"
    },
    {
        "title": "Senators Push to Extend Cyber Threat-Sharing Law to 2035 - MeriTalk",
        "url": "https://www.meritalk.com/articles/senators-push-to-extend-cyber-threat-sharing-law-to-2035/",
        "text_hash": "7f85e15105f36430a70ea5c7ffbba016f23c61c7540ee3c8675ecf79f9f8ac57",
        "summary": "Sens. Gary Peters, D-Mich., and Mike Rounds, R-S.D., have introduced bipartisan legislation to reauthorize a critical cyber threat data sharing law that is set to expire later this year. The Cybersecurity Information Sharing Act of 2015 provides companies protections to share cybersecurity threat information with the Department of Homeland Security and with each other through formal and informal channels. It is unclear how much support the reauthorization will garner after cybersecurity issues have recently seen more partisan pressure.",
        "source": "www.meritalk.com",
        "keywords": [
            "senators",
            "introduced",
            "bipartisan",
            "legislation",
            "reauthorize"
        ],
        "published_date": "2025-04-21",
        "published_time": "19:38:12",
        "rss_source": "United States"
    },
    {
        "title": "Enterprises change how they manage cyber risk - BetaNews",
        "url": "https://betanews.com/2025/04/21/enterprises-change-how-they-manage-cyber-risk/",
        "text_hash": "468ce5bc7dad2161fb95f48c237f828929edcadd94c8577469d87315fa463959",
        "summary": "Enterprises change how they manage cyber risk - BetaNews.com. Only one in 50,000 vulnerabilities actually pose a critical risk -- and the ones getting exploited the most are often old, quiet, and ignored. Nearly three-quarters of respondents (73 percent) consider it highly important for vulnerability management solutions to prioritize risk using IT context, but 81 percent say there are challenges in that process. 95 percent say they are likely or very likely to adopt a new vulnerability or exposure management platform in the next 12 months.",
        "source": "betanews.com",
        "keywords": [
            "enterprises",
            "change",
            "manage",
            "cyber",
            "april"
        ],
        "published_date": "2025-04-21",
        "published_time": "19:22:43",
        "rss_source": "United States"
    },
    {
        "title": "Defending against DDoS attacks with AI/ML - B2B Cyber Security",
        "url": "https://b2b-cyber-security.de/en/Defend-against-DDOS-attacks-with-AI-ML/",
        "text_hash": "2f296143c2ac6444a8d71a32318cd7f181f6979c22e22a494be6d8c9e80e037f",
        "summary": "Distributed Denial of Service (DDoS) attacks on critical IT infrastructure and services have increased by 55 percent over the past four years. A combination of AI-driven automation, evolving DDoS-for-hire services, expanded IoT botnets, and geopolitical conflicts has transformed the threat landscape. To combat these attacks, organizations, enterprises, and service providers need AI/ML-enabled solutions that can continuously adapt to threats and deploy proactive, intelligence-driven security strategies to protect their networks.",
        "source": "b2b-cyber-security.de",
        "keywords": [
            "defend",
            "against",
            "attacks",
            "cybersecurity",
            "solutions"
        ],
        "published_date": "2025-04-21",
        "published_time": "17:44:14",
        "rss_source": "Germany"
    },
    {
        "title": "Securing the software supply chain for the Cyber ​​Resilience Act",
        "url": "https://b2b-cyber-security.de/en/Securing-the-software-supply-chain-for-the-Cyber-%E2%80%8B%E2%80%8BResilience-Act/",
        "text_hash": "4b5c0b14fa3993011805155de349e5065b3b0ca7b0b79a668ba7b2ef5b281473",
        "summary": "Cybercriminals are increasingly making vulnerabilities in development pipelines, open source components, and third-party integrations an integral part of their attack vectors. According to a Bitkom survey from last year, in 2024, 13 percent of IT decision-makers surveyed reported at least one of their company's supply chain suppliers having been the victim of a cybersecurity incident at least once in the past 12 months. The Cyber ​​Resilience Act (CRA) applies to all software, firmware, and connected devices intended to be sold or used in the EU.",
        "source": "b2b-cyber-security.de",
        "keywords": [
            "recent",
            "years",
            "managers",
            "cyber",
            "risks"
        ],
        "published_date": "2025-04-21",
        "published_time": "17:44:11",
        "rss_source": "Germany"
    },
    {
        "title": "Multiple top CISA officials behind 'Secure by Design' resign - CyberScoop",
        "url": "https://cyberscoop.com/cisa-bob-lord-lauren-zabierek-resign-secure-by-design/",
        "text_hash": "0780bd68dc853c192b91e2e6b2d6a6e4dba50da4153a500309827e39796cb98a",
        "summary": "Multiple top CISA officials behind 'Secure by Design' resign. Two top officials at the Cybersecurity and Infrastructure Security Agency who worked with the private sector to manufacture secure products and technology are leaving the agency. Bob Lord, senior technical adviser and Lauren Zabierek, senior advisor at CISA, were two of the chief architects behind CISA’s Secure by Design initiative. Neither offered a rationale or motivation for the decision, with Lord simply calling it a “difficult decision”",
        "source": "cyberscoop.com",
        "keywords": [
            "statement",
            "cyberscoop",
            "acting",
            "director",
            "bridget"
        ],
        "published_date": "2025-04-21",
        "published_time": "20:54:47",
        "rss_source": "United States"
    },
    {
        "title": "Banks gear up to boost cybersecurity, cloud and data spending | CIO Dive",
        "url": "https://www.ciodive.com/news/bank-tech-cloud-data-cyber-generative-ai-broadridge/745931/",
        "text_hash": "1e9423f88073387ef7a27221bdae03afc9ccc680b1da3929b950935924f0688f",
        "summary": "Banks gear up to boost cybersecurity, cloud and data spending. More than two-thirds of respondents to the Broadridge survey expect generative AI to yield employee productivity gains. Data modernization remains a challenge, particularly in legacy institutions. Nearly half of banking organizations are grappling with data silos and 2 in 5 report data quality issues, Broadridge found.“Cloud is king and there’s still a heavy emphasis on foundational technologies,” Broadridge Chief Product and Strategy Officer Germán Soto Sanchez said.",
        "source": "www.ciodive.com",
        "keywords": [
            "scale",
            "generative",
            "capabilities",
            "executives",
            "increase"
        ],
        "published_date": "2025-04-21",
        "published_time": "20:25:12",
        "rss_source": "United States"
    },
    {
        "title": "StrikeReady AI Platform Moves Security Teams Beyond Basic, One-Dimensional AI-Driven ...",
        "url": "https://markets.businessinsider.com/news/currencies/industry-first-strikeready-ai-platform-moves-security-teams-beyond-basic-one-dimensional-ai-driven-triage-solutions-1034601671",
        "text_hash": "f2d6cea663137afdd4340e9577345c453bf2720debb68bf5bc86da68b85859ae",
        "summary": "StrikeReady is introducing its next-generation Security Command Center v2 at the 2025 RSA Conference. This AI-powered platform is engineered to go beyond basic alert processing. It offers integrated asset and identity visibility, comprehensive vulnerability management, and coordinated automated response capabilities. StrikeReady frames cybersecurity as an end-to-end risk management process. The platform’s proprietary Large Action Model (LAM) goes beyond mere analysis and executes defensive actions across the environment based on user prompts. It's a complete shift from dousing fires to preventing them from igniting.",
        "source": "markets.businessinsider.com",
        "keywords": [
            "dallas",
            "united",
            "states",
            "april",
            "cybernewswire"
        ],
        "published_date": "2025-04-21",
        "published_time": "14:22:45",
        "rss_source": "Germany"
    },
    {
        "title": "Southeast Asian cyber fraud industry at 'inflection point' as it expands globally",
        "url": "https://therecord.media/southeast-asia-cyber-fraud-at-inflection-point",
        "text_hash": "4f3c56c634ec8df962c0eb205187642186e07fc47acefb78404b61d0d093caa6",
        "summary": "Southeast Asian cyber fraud industry at 'inflection point' as it expands globally. Organized crime groups behind the industry are growing increasingly professional and deepening ties with other regions and illicit actors. Criminal groups are able to move operations seemingly overnight within the region in response to law enforcement activity, researchers said. According to the UN, more than $37 billion was lost in East and Southeast Asia to cyber-enabled fraud in 2023, while in the U.S. victims of pig butchering scams reported $4.4 billion in losses.",
        "source": "therecord.media",
        "keywords": [
            "despite",
            "crackdowns",
            "compounds",
            "myanmar",
            "organized"
        ],
        "published_date": "2025-04-21",
        "published_time": "20:48:02",
        "rss_source": "United States"
    },
    {
        "title": "Rhode Island College designated NSA Center of Academic Excellence in Cyber Defense",
        "url": "https://turnto10.com/news/local/rics-institute-for-cybersecurity-to-man-an-announcement-about-the-program-april-21-2025",
        "text_hash": "d4841529cf513cb42ace7c49e502611e0060b45b4b7ccd48d84e461660ecd141",
        "summary": "Rhode Island College designated NSA Center of Academic Excellence in Cyber Defense. Institute for Cybersecurity and Emerging Technologies is making an announcement about its program on Monday. Among those scheduled to speak are Langevin, Congressman Gabe Amo, and Rhode Island Governor Dan McKee. The chair of the institute is former Congressman Jim Langevin.",
        "source": "turnto10.com",
        "keywords": [
            "rhode",
            "island",
            "college",
            "institute",
            "cybersecurity"
        ],
        "published_date": "2025-04-21",
        "published_time": "21:02:50",
        "rss_source": "United States"
    },
    {
        "title": "UN Warns Southeast Asian Cybercriminals Are Going Global | PYMNTS.com",
        "url": "https://www.pymnts.com/cybersecurity/2025/united-nations-warns-southeast-asian-cybercriminals-are-going-global/",
        "text_hash": "170ce5a7d1b2ccb64d3a5f503fff73de90730fd0efe8b7e364845e503fefe9fd",
        "summary": "The U.N. Office on Drugs and Crime (UNODC) said in a Monday (April 21) report that the threat from criminal networks in countries such as Myanmar, Cambodia and Laos is outpacing government efforts to mitigate it. The crisis is at a “critical inflection point,” and international cooperation is needed to disrupt the syndicates’ financing and prevent further global spillover. In 2023 alone, countries in East and Southeast Asia collectively lost up to $37 billion to cyber-enabled fraud.",
        "source": "www.pymnts.com",
        "keywords": [
            "result",
            "asian",
            "crime",
            "syndicates",
            "emerged"
        ],
        "published_date": "2025-04-21",
        "published_time": "20:55:36",
        "rss_source": "United States"
    },
    {
        "title": "Asian scam operations worth €35 billion spreading across the world, UN warns - Bundle",
        "url": "https://www.bundle.app/en/breakingNews/asian-scam-operations-worth-euro35-billion-spreading-across-the-world-un-warns-1e5aff16-5149-4b16-9f8c-45a37f5f92f2",
        "text_hash": "7910b715af9b272817146845554d41b9b9110366f59ee169f1e8f3322e5fac4a",
        "summary": "Asian scam operations worth €35 billion spreading across the world, UN warns. Transnational organised crime groups in East and Southeast Asia are spreading their lucrative scam operations across the globe. UNODC estimates that hundreds of industrial-scale scam centres generate just under $40 billion (€35 billion) in annual profits. New online markets, money laundering networks, stolen data products, malware, artificial intelligence and deepfake technologies are laying the ground for the rise of crime as a service, the report says.",
        "source": "www.bundle.app",
        "keywords": [
            "fraud",
            "online",
            "gambling",
            "related",
            "money"
        ],
        "published_date": "2025-04-21",
        "published_time": "20:14:24",
        "rss_source": "Germany"
    },
    {
        "title": "Regional Data Protection: DPEX Asia & One Cover Team Up in Nepal - Arthik Awaj",
        "url": "https://arthikawaj.com/regional-data-protection-dpex-asia-one-cover-team-up-in-nepal/",
        "text_hash": "2d46b732c0293bca91def5440f8b61ff2d17049c04fdba38d86679630b6e67f4",
        "summary": "Data Protection Experts Asia Sdn Bhd (DPEX Asia), a premier data protection consultancy based in Malaysia, has signed a strategic Memorandum of Understanding (MoU) with One Cover Pvt. Ltd. The primary focus of this partnership is to collaborate on the drafting of Nepal’s Personal Data Protection Bill. The MoU was officially signed by Professor Abu Bakar Munir, Chairman of DPEX Asia, and Chiranjibi Adhikari, CEO of One Cover Private Limited.",
        "source": "arthikawaj.com",
        "keywords": [
            "nepal",
            "cybersecurity",
            "companies",
            "primary",
            "focus"
        ],
        "published_date": "2025-04-21",
        "published_time": "14:25:51",
        "rss_source": "Germany"
    },
    {
        "title": "Zelenskyy Signs Cybersecurity Bill to Protect Infrastructure - The Cyber Express",
        "url": "https://thecyberexpress.com/zelenskyy-signs-advanced-cybersecurity-bill/",
        "text_hash": "a545cb25413cb1c42b467b9ae2d03d08c3075a95730d8e8570380f63c7c54151",
        "summary": "Ukrainian President Volodymyr Zelenskyy has signed a sweeping cybersecurity bill. The law is designed to enhance Ukraine’s capacity to respond to threats targeting government systems and vital services. Officials said it marks a significant shift toward risk-based management, coordinated national response, and better information sharing. The move signals Ukraine's intent to professionalize its cybersecurity workforce and reduce fragmentation in how cyber defense is managed at the institutional level, the government said. The bill was approved by parliament on March 27 and signed into law last week.",
        "source": "thecyberexpress.com",
        "keywords": [
            "ukraine",
            "zelenskyy",
            "signs",
            "advancing",
            "cybersecurity"
        ],
        "published_date": "2025-04-21",
        "published_time": "18:38:09",
        "rss_source": "United States"
    },
    {
        "title": "Technology is Changing the Retail Consumer Experience. Can Cyber Keep Up?",
        "url": "https://www.mytotalretail.com/article/technology-is-changing-the-retail-consumer-experience-can-cyber-keep-up/",
        "text_hash": "54b42198fe339e44ca65098ed349735724314bb67881cd2680783ba2bb74c74f",
        "summary": "Trustwave’s latest Retail Sector Risk Radar Report underscores the growing urgency for retailers to reassess their security strategies. The most common method for cybercriminals to gain entry to retail systems is through phishing, responsible for 58 percent of initial breaches in the retail sector. To stay ahead, retailers must adapt quickly, securing their operations without compromising the customer experience, according to Trustwave's report. The balancing act between innovation and risk has never been more complex, the report says, and retailers need to adapt quickly.",
        "source": "www.mytotalretail.com",
        "keywords": [
            "control",
            "across",
            "supply",
            "chains",
            "retailers"
        ],
        "published_date": "2025-04-21",
        "published_time": "17:55:16",
        "rss_source": "United States"
    },
    {
        "title": "Cybersecurity Changes Are Impacting Lenders Now - The MortgagePoint",
        "url": "https://themortgagepoint.com/2025/04/21/cybersecurity-changes-are-impacting-lenders-now/",
        "text_hash": "af78945765152f403b84f01f7f7bb1e07e6e888961e516dbad7bb6c3ba4f84fd",
        "summary": "HUD made significant changes to the reporting requirements for FHA lenders regarding “significant cybersecurity incidents,” particularly tightening the timeline for such notifications. HUD welcomed feedback to inform future updates, but these took effect immediately. HUD has implemented stricter timelines for reporting significant cybersecurity incidents. Other agencies, such as the Office of the National Cyber Director and Ginnie Mae, allow for greater flexibility in the reporting process. The introduction of HUD’s new cybersecurity incident reporting standards has raised widespread discussion about operational readiness among lenders.",
        "source": "themortgagepoint.com",
        "keywords": [
            "regulatory",
            "mandates",
            "coupled",
            "recent",
            "cyber"
        ],
        "published_date": "2025-04-21",
        "published_time": "22:17:07",
        "rss_source": "England"
    },
    {
        "title": "Japan warns of hundreds of millions of dollars in unauthorized trades from hacked accounts",
        "url": "https://therecord.media/japan-warns-of-unauthorized-trades-hacked-accounts",
        "text_hash": "c41581dbd66ead0df2399f09e60d39acd31891e3a2f33831e10289ae8539534f",
        "summary": "Japan’s Financial Services Agency said on Friday that there has been a “sharp increase in the number of cases of unauthorized access and unauthorized trading” 12 securities firms reported fraudulent transactions, with sales totaling about $350 million and purchases worth about $315 million. The trend was occurring, according to the agency, because of stolen customer information obtained through phishing websites “disguised as websites of real securities companies” Japan has increasingly warned its citizens of cyberattacks targeting the country from China.",
        "source": "therecord.media",
        "keywords": [
            "japan",
            "increasingly",
            "warned",
            "citizens",
            "cyberattacks"
        ],
        "published_date": "2025-04-21",
        "published_time": "21:34:03",
        "rss_source": "United States"
    },
    {
        "title": "France : Russia's Kaspersky launches charm offensive in Rennes' cyber sector - Intelligence Online",
        "url": "https://www.intelligenceonline.com/surveillance--interception/2025/04/22/russia-s-kaspersky-launches-charm-offensive-in-rennes--cyber-sector,110437798-art",
        "text_hash": "2b9af842fb5404b5da5f401ec02a8728d984d89b71074c72b2bdc0891053a074",
        "summary": "intelligenceonline.com uses cookies to provide reliable and secure features, measure and analyse website traffic and provide support to the website users. You can change these settings at any time by going to our Cookie management page. Alternatively “Accept and close” to agree to all cookies or go to ‘Manage cookies’ to review your options. For confidential support call the Samaritans in the UK on 08457 90 90 90, visit a local Samaritans branch or click here for details.",
        "source": "www.intelligenceonline.com",
        "keywords": [
            "kaspersky",
            "twelve",
            "years",
            "french",
            "national"
        ],
        "published_date": "2025-04-22",
        "published_time": "04:02:28",
        "rss_source": "England"
    },
    {
        "title": "Excite Cyber appoints Media-Wize as PR agency - Campaign Brief",
        "url": "https://campaignbrief.com/excite-cyber-reappoints-media-wize-as-pr-agency/",
        "text_hash": "2e6c15ff35532e767252a58e48fa1e07229a0da4b634a90d09f92eb0e4d992c7",
        "summary": "Excite Cyber appoints Media-Wize as PR agency - Campaign Brief. Excite Cyber is on a fast growth trajectory to become the region’s best-in-class managed security provider. The group is Australia's leading provider of digital forensic services, tools, industry-embedded training, certification, and solutions to law enforcement, government, and enterprise. The agency is also AUSCERT's PR agency in Australia and is the global lead agency for Zetaris. If you have a news tip or story idea, please feel free to email ricki@campaignbrief.com.",
        "source": "campaignbrief.com",
        "keywords": [
            "cyber",
            "excite",
            "retainer",
            "client",
            "technology"
        ],
        "published_date": "2025-04-22",
        "published_time": "06:08:32",
        "rss_source": "United States"
    },
    {
        "title": "Preparing For The Quantum Leap - New Technology - United Kingdom - Mondaq",
        "url": "https://www.mondaq.com/uk/new-technology/1610500/preparing-for-the-quantum-leap",
        "text_hash": "bd02e80a6492eeb10dfe6c9f247795419d6eb9faff4adb1267bf9c1440c36785",
        "summary": "In March 2023, the UK announced a £2.5bn investment in quantum technologies. Over £100m of government funding was announced to support five new tech hubs which aim to develop practical uses of quantum technology. Big tech giants are jumping into the fray, with Microsoft recently announcing its creation of the world's first quantum processor. While quantum computing may seem like the stuff of science fiction, its impact will be felt cross-industry and will likely bring about significant opportunities as well as challenges.",
        "source": "www.mondaq.com",
        "keywords": [
            "quantum",
            "computing",
            "commercial",
            "investment",
            "potential"
        ],
        "published_date": "2025-04-22",
        "published_time": "05:43:14",
        "rss_source": "England"
    },
    {
        "title": "Sustained demand key to long-term cyber re/insurance market growth: Gallagher Re",
        "url": "https://www.reinsurancene.ws/sustained-demand-key-to-long-term-cyber-re-insurance-market-growth-gallagher-re/",
        "text_hash": "d2c166588b663525c07caa6b3ec816936c0dfc939bc847819db1a5be47c67d0f",
        "summary": "Sustained demand key to long-term cyber re/insurance market growth: Gallagher Re. Reinsurance broker emphasised that ensuring sustainable growth in the cyber insurance market is not just about capital and capacity, but also about increasing demand. A key driver of demand is ensuring that insureds view cyber coverage as a necessary investment for managing risk, rather than an optional cost. Gallagher Re urges underwriters to prepare during this softer cycle to gain stakeholder trust and demonstrate that leaning into a hard market is a viable strategy.",
        "source": "www.reinsurancene.ws",
        "keywords": [
            "sustaining",
            "demand",
            "cyber",
            "insurance",
            "market"
        ],
        "published_date": "2025-04-22",
        "published_time": "08:06:57",
        "rss_source": "United States"
    },
    {
        "title": "The Cyber War on Democracy: Lessons from the 2024 RNC Email Hack | Tripwire",
        "url": "https://www.tripwire.com/state-of-security/cyber-war-democracy-lessons-2024-rnc-email-hack",
        "text_hash": "52771f3bf623f2fc9456380f3a361506021c7cd3aa0243b50e53a96e6ee5f344",
        "summary": "Chinese hackers infiltrated the Republican National Committee (RNC) email system in 2024. Attackers maintained access for several months, trying to get their hands on intelligence on how the GOP planned to address Taiwan in its party platform. RNC leadership, including Trump campaign co-chair Chris LaCivita, chose not to inform the FBI, fearing leaks in the media. The RNC incident highlights that if we want to protect democracy, urgent intervention in the form of stronger cybersecurity measures is critical. The breach is part of an insidious and troubling rise in subversion.",
        "source": "www.tripwire.com",
        "keywords": [
            "lessons",
            "email",
            "cyber",
            "interference",
            "threatens"
        ],
        "published_date": "2025-04-22",
        "published_time": "07:59:46",
        "rss_source": "United States"
    },
    {
        "title": "AI and the New Face of War: How Artificial Intelligence Is Rewriting Every Phase of Conflict",
        "url": "https://www.israeldefense.co.il/en/node/64938",
        "text_hash": "19e45be5c7327f23920eb613f141e56e2889c655602a4117f851f1992d1bf699",
        "summary": "Artificial Intelligence is reshaping how wars begin, unfold, and end in the age of hybrid warfare. Modern warfare has evolved into a complex domain known as Hybrid Warfare, blending conventional combat with cyber strategies, psychological manipulation, and economic coercion. In open warfare, AI becomes a battlefield actor, enhancing agility, speed, and precision across all military levels. In Iraq, AI was used to map destruction and prioritize rebuilding after ISIS. China leverages AI-powered media to craft favorable post-conflict narratives. Hamas uses deepfakes and disinformation to garner global sympathy and reinforce its influence.",
        "source": "www.israeldefense.co.il",
        "keywords": [
            "warfare",
            "modern",
            "evolved",
            "complex",
            "domain"
        ],
        "published_date": "2025-04-21",
        "published_time": "20:45:42",
        "rss_source": "Israel"
    },
    {
        "title": "Teach young people about ransomware risks before they enter work, expert urges",
        "url": "https://uk.finance.yahoo.com/news/teach-young-people-ransomware-risks-072056824.html",
        "text_hash": "7897d6d20f5aa9676a4e0760f14eca4e89301b010f1e039c12b29ce1c0aae548",
        "summary": "Matt Cooke, cybersecurity strategist at digital security firm Proofpoint, said more can be done to prepare people to deal with a cyber threat. Attacks such as ransomware often start with the targeting of individuals, he said. Cooke: 'We need to get to that level of understanding for people as they’re coming into the workforce' He welcomed proposals from ministers earlier this year which could see public sector firms and national infrastructure bodies banned from making ransomware payments. The Government and intelligence services are talking more publicly about the threats around cybersecurity, Cooke said.",
        "source": "uk.finance.yahoo.com",
        "keywords": [
            "cybersecurity",
            "improved",
            "better",
            "preparing",
            "young"
        ],
        "published_date": "2025-04-22",
        "published_time": "08:53:42",
        "rss_source": "England"
    },
    {
        "title": "The Cyber Governance Code: Restarting and reinforcing resilience conversations in ...",
        "url": "https://financialregulation.linklaters.com/post/102k92k/the-cyber-governance-code-restarting-and-reinforcing-resilience-conversations-in",
        "text_hash": "ed142fb1de7274802fc27aed2b6add4408073c5b2d7c016a24b8fa79385aee17",
        "summary": "The UK’s National Cyber Security Centre recently published its Cyber Governance Code of Practice. The Code aims to provide a framework for effectively governing cyber security risks. It sets out a series of actions across five key areas including risk management, people and strategy. For those supporting governance structures and / or reporting to boards and committees, reading the Code is essential preparation. For financial services, the operational resilience regime continues to set the regulatory standard for cyber governance. There will likely be more scrutiny once the FCA and other regulators finalise their operational incident reporting regimes. This is a good opportunity to refocus the conversation on cyber resilience.",
        "source": "financialregulation.linklaters.com",
        "keywords": [
            "cyber",
            "security",
            "risks",
            "while",
            "driving"
        ],
        "published_date": "2025-04-22",
        "published_time": "07:12:06",
        "rss_source": "England"
    },
    {
        "title": "FBI Las Vegas warns all small business owners to protect themselves from cyber criminals",
        "url": "https://www.fox5vegas.com/2025/04/22/fbi-las-vegas-warns-all-small-business-owners-protect-themselves-cyber-criminals/",
        "text_hash": "233fb65a82b5ad62f9895f69462d1000812f71e5fb04f265e80db756ab5b9ff9",
        "summary": "FBI Las Vegas warns all small business owners to protect themselves from cyber criminals. Scammers ask for payments ranging from $75 to thousands of dollars, or restaurants will be bombarded with fake one or two-star reviews on various platforms. The reviews will continue until the victimized business complies with the scammers’ demands. The FBI’s Las Vegas Division explains why small businesses have become the latest target of these scammers, who could come from organized networks or even individuals in prison.",
        "source": "www.fox5vegas.com",
        "keywords": [
            "vegas",
            "urges",
            "small",
            "business",
            "owners"
        ],
        "published_date": "2025-04-22",
        "published_time": "07:42:02",
        "rss_source": "United States"
    },
    {
        "title": "ICT Infrastructure and Cyber Security in ASEAN Digital Economy - ASU News",
        "url": "https://news.asu.edu/b/20250421-usasean-center-launched-usasean-business-leader-series-collaboration-usasean-business",
        "text_hash": "f618f7f8b6422f38afa391110f6c5604d63a575eccc7c496b2559b1c673a81c2",
        "summary": "Public and private sector leaders from ASEAN, the U.S. and around the globe convened to address this urgent problem. Singapore established a regulatory framework that serves as the legal foundation to tackle losses arising from fraud risks and phishing scams. Cisco's Eric Wenger emphasized that critically flawed AI systems, like the Chinese app Deepseek, can pose a significant problem and could cause “a wave of commoditization in the development of flawed AI models” A holistic, whole-of-society approach to building economic prosperity in ASEan.",
        "source": "news.asu.edu",
        "keywords": [
            "association",
            "southeast",
            "asian",
            "nations",
            "region"
        ],
        "published_date": "2025-04-21",
        "published_time": "23:02:50",
        "rss_source": "United States"
    },
    {
        "title": "85% of CEOs say cybersecurity is critical for business growth - DIGIT",
        "url": "https://www.digit.fyi/85-of-ceos-say-cybersecurity-is-critical-for-business-growth/",
        "text_hash": "1bb9dace3c4fd002785782fd147a1a2acba4c5d3fa58f4fad9f5caf79040139b",
        "summary": "85% of CEOs say cybersecurity is critical for business growth. 61% are concerned about cybersecurity threats, driven in large part by artificial intelligence’s growing role in commercial activity. 87% of security professionals report that their organisation has encountered an AI-driven cyber-attack within the last year. Chief information security offices (CISOs) themselves have said that AI-powered threats are having a significant impact on their organisations this year, marking a 5% increase in this answer over 2024.",
        "source": "www.digit.fyi",
        "keywords": [
            "cyber",
            "landscape",
            "gartner",
            "technology",
            "research"
        ],
        "published_date": "2025-04-22",
        "published_time": "09:03:38",
        "rss_source": "England"
    },
    {
        "title": "Man in dock for killing friend - Bulawayo24 News",
        "url": "https://bulawayo24.com/index-id-news-sc-national-byo-252169.html",
        "text_hash": "127e6017cd68fdf1a4d65c2db65664e1f12340763c882125a76f09a67eea8ab9",
        "summary": "Blessed Geza has called for a two-day national shutdown to force President Emmerson Mnangagwa to step down. The controversial call has sparked panic within government circles. Information Minister Jenfan Muswere dismissed Geza's call as futile, labelling him a \"comedian\" and a \"madman\" He also warned Geza and others like him, claiming their \"days are numbered\" Geza believes that staying at home is a peaceful and effective way to push for the President's resignation without provoking violence from the authorities.",
        "source": "bulawayo24.com",
        "keywords": [
            "muswere",
            "urged",
            "public",
            "ignore",
            "shutdown"
        ],
        "published_date": "2025-04-22",
        "published_time": "07:17:08",
        "rss_source": "England"
    },
    {
        "title": "Stellar Cyber Debuts the Human-Augmented Autonomous SOC Powered by Agentic AI at ...",
        "url": "https://finance.yahoo.com/news/stellar-cyber-debuts-human-augmented-120000522.html",
        "text_hash": "282372e5335e6245947b92df30ad97b2326dfc67522534b4ba2e7bae022629b4",
        "summary": "Stellar Cyber Debuts the Human-Augmented Autonomous SOC Powered by Agentic AI at the RSA Conference 2025 in San Francisco. Say goodbye to security tool sprawl and alert fatigue. Say hello to full-cycle, unified, intelligent SecOps. \"Security isn’t about man vs. machine -- it’s about man with machine,\" says Aimei Wei, CTO and Founder at Stellar Cyber. \"We built Stellar Cyber to harness AI to empower analysts with faster decisions, deeper insight, and real risk reduction\"",
        "source": "finance.yahoo.com",
        "keywords": [
            "april",
            "upcoming",
            "conference",
            "francisco",
            "stellar"
        ],
        "published_date": "2025-04-22",
        "published_time": "12:24:43",
        "rss_source": "United States"
    },
    {
        "title": "Stellar Cyber Accelerates Brazil Expansion with Appointment of New Regional Leader ...",
        "url": "https://www.businesswire.com/news/home/20250422257297/en/Stellar-Cyber-Accelerates-Brazil-Expansion-with-Appointment-of-New-Regional-Leader-Silvio-Eberardo",
        "text_hash": "fcd592ab9f6df04de952aa6b385f6ff557a857f9f0f01a2f8084823aed1f55e2",
        "summary": "Stellar Cyber appoints Silvio Eberardo as its inaugural Country Manager, Brazil. The move comes as Stellar Cyber experiences explosive growth in Brazil. Stellar Cyber’s award-winning Open XDR platform is uniquely suited to address Brazil's most urgent cybersecurity challenges. It helps organizations consolidate fragmented security tools into one unified platform, filling the technology gap that many local teams face. With AI-driven detection, investigation and response capabilities, it also enables lean security teams to do more with less resources.",
        "source": "www.businesswire.com",
        "keywords": [
            "stellar",
            "cyber",
            "cybersecurity",
            "illumination",
            "company"
        ],
        "published_date": "2025-04-22",
        "published_time": "12:06:21",
        "rss_source": "United States"
    },
    {
        "title": "Santa Fe ISD cyber event disrupts internet, visitor access | khou.com",
        "url": "https://www.khou.com/article/news/education/santa-fe-isd-cyber-event-internet-outage-campus-lockdown/285-ce4c1d63-98c6-4a75-b70c-2e9dd0b4fd34",
        "text_hash": "7b4c9636e77fba20e5da8122e665b03fff8ac7fa98983e2e2e4c2f316e0f5842",
        "summary": "Santa Fe ISD faces a cyber-event disrupting internet and phone services, halting campus visits. Officials have not released additional details about the nature or cause of the cyber- event. The district shared the update on Facebook early Monday, stating that due to the ongoing issues, visitors will not be allowed at any SantaFe ISD campuses until further notice. KHOU has reached out to the district for more information and will provide updates as they become available. To stream KHou 11 on your phone, you need the KHOU 11 app.",
        "source": "www.khou.com",
        "keywords": [
            "santa",
            "reported",
            "weekend",
            "impacting",
            "internet"
        ],
        "published_date": "2025-04-22",
        "published_time": "10:58:39",
        "rss_source": "United States"
    },
    {
        "title": "Billbug espionage group targets government, critical sectors in coordinated Southeast Asia ...",
        "url": "https://industrialcyber.co/ransomware/billbug-espionage-group-targets-government-critical-sectors-in-coordinated-southeast-asia-cyber-intrusion-campaign/",
        "text_hash": "657313b74debdb06347889fcce30f70a4338981ff759f2322bcdf46d392628c8",
        "summary": "New research from Symantec revealed that the China-linked espionage group Billbug compromised multiple organizations within a single Southeast Asian country. The attacks involved using multiple new custom tools, including loaders, credential stealers, and a reverse SSH tool. The researchers said that among the new tools deployed were two designed to steal credentials from the Chrome web browser. The group also staged an intrusion against a news agency located in another country in Southeast Asia and an air freight organization located in a neighboring country.",
        "source": "industrialcyber.co",
        "keywords": [
            "these",
            "findings",
            "underscore",
            "evolving",
            "tactics"
        ],
        "published_date": "2025-04-22",
        "published_time": "09:41:23",
        "rss_source": "United States"
    },
    {
        "title": "Identity is under siege as AI and cyber exploits evolve and outpace defenses",
        "url": "https://www.biometricupdate.com/202504/identity-is-under-siege-as-ai-and-cyber-exploits-evolve-and-outpace-defenses",
        "text_hash": "4047f0232877afdddff1bf0f64a5f8fec4e7c2f4bb1a0a47e2b88ee4fdca997f",
        "summary": "At the center of cybersecurity crises is a single, unifying vulnerability: digital identity. Identity attacks now comprise nearly a third of all intrusions, according to IBM. In 2024 alone, IBM recorded an 84 percent spike in emails delivering infostealer malware. With AI-as-a-service available on underground markets, even low-skilled actors can launch sophisticated operations, IBM says. The Common Vulnerabilities and Exposures Program is set to collapse in the coming months, leaving organizations blind to newly discovered flaws.",
        "source": "www.biometricupdate.com",
        "keywords": [
            "threat",
            "actors",
            "quietly",
            "infiltrating",
            "systems"
        ],
        "published_date": "2025-04-22",
        "published_time": "07:47:00",
        "rss_source": "United States"
    },
    {
        "title": "Winners announced: ELSA's second Industry Call strengthens connection between AI ...",
        "url": "https://idw-online.de/de/news850962",
        "text_hash": "235a1518382bd69ddeb34ac756db986afcb1df4eaad4db7994c58f050710c6d4",
        "summary": "ELSA – European Lighthouse on Secure and Safe AI, has finished its second Industry Call. During its call, ELSA looked for applications from SMEs and startups in all business stages and various kinds of research areas. Seven winners have now been selected. They will receive 60,000 € funding and will be supported by ELSA experts over six months. ELSA’s Europe-wide Industry Call strengthens the connection, knowledge exchange, and collaboration between excellent AI and cybersecurity researchers and industry-oriented companies.",
        "source": "idw-online.de",
        "keywords": [
            "calling",
            "areas",
            "cybersecurity",
            "robotic",
            "systems"
        ],
        "published_date": "2025-04-22",
        "published_time": "09:50:17",
        "rss_source": "Germany"
    },
    {
        "title": "Volvo Defense at DEFEA 2025: Highly capable solutions for the toughest conditions",
        "url": "https://monch.com/volvo-defense-at-defea-2025-highly-capable-solutions-for-the-toughest-conditions/",
        "text_hash": "24d4629bc6eafbb17a1e3cfffde5aff07ed875c7ce49547d0b49b700ab118467",
        "summary": "Volvo Defense will present itself at the DEFEA Exhibition in Athens, Greece. With a comprehensive range of tailor-made products from the Volvo Group, Volvo Defense will showcase its capabilities in flexibility and security of supply. The Volvo Defense stand will feature two variants of a core product – the Volvo FMX. The two trucks in Volvo Defense’s stand at DeFEA will be the VolvoFMX 4×4 crew cab and Volvo FM X 6×6 hook lift. The event takes place 6-8 May 2025.",
        "source": "monch.com",
        "keywords": [
            "defence",
            "security",
            "defea",
            "exhibition",
            "athens"
        ],
        "published_date": "2025-04-22",
        "published_time": "07:39:32",
        "rss_source": "Germany"
    },
    {
        "title": "Terra Security raises $7.5M in Seed round for its agentic AI pen testing solution",
        "url": "https://markets.businessinsider.com/news/stocks/terra-security-raises-7-5m-in-seed-round-for-its-agentic-ai-pen-testing-solution-1034603088",
        "text_hash": "fdb7e7de4d93e963221412a148c0e76ddd435394e4e11edb21755f829eb8c949",
        "summary": "Terra Security raises $7.5M in Seed round for its agentic AI pen testing solution. Backed by FXP Ventures and SYN Ventures, Terra introduces the first agenticAI pen testing platform with human supervision, while its multi-agent approach leverages dozens of dedicated fine-tuned AI agents to conduct continuous, deep testing at scale. Already serving multiple clients, including Fortune 500 companies, Terra will use the funds to advance its platform, expand its AI agents’ capabilities, and grow its customer base.",
        "source": "markets.businessinsider.com",
        "keywords": [
            "network",
            "security",
            "grand",
            "scheme",
            "cybersecurity"
        ],
        "published_date": "2025-04-22",
        "published_time": "01:11:06",
        "rss_source": "Germany"
    },
    {
        "title": "Wang Yi on the Consensus Reached at the 1st Ministerial Meeting of China-Indonesia Joint ...",
        "url": "https://www.fmprc.gov.cn/mfa_eng/wjbzhd/202504/t20250422_11601345.html",
        "text_hash": "c533015a616163c43628abea1f8a8506af03569c68f7e604035a70f9a8cdfb9b",
        "summary": "Wang Yi said that based on the common understandings reached between President Xi Jinping and President Prabowo Subianto, the First Ministerial Meeting of China-Indonesia Joint Foreign and Defense Ministerial Dialogue was held today. This is the first joint foreign and defense ministerial dialogue established by China globally, marking the opening of a new chapter in the strategic mutual trust as well as political and security cooperation. Both sides agreed to uphold the strategic guidance of the heads of state, maintain close high-level exchanges, and firmly support each other's core interests and major concerns.",
        "source": "www.fmprc.gov.cn",
        "keywords": [
            "security",
            "cooperation",
            "between",
            "neighboring",
            "countries"
        ],
        "published_date": "2025-04-22",
        "published_time": "07:48:42",
        "rss_source": "China"
    }
]
